{"format": "graph-model", "modelTopology": {"node": [{"name": "x", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "4"}]}}}}, {"name": "fire_rate", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {}}}}, {"name": "angle", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {}}}}, {"name": "step_size", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAwAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAABAAAAA=="}}}}, {"name": "strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AQAAAAEAAAABAAAAAQAAAA=="}}}}, {"name": "strided_slice", "op": "StridedSlice", "input": ["x", "strided_slice/stack", "strided_slice/stack_1", "strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "end_mask": {"i": "7"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "7"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}}}, {"name": "MaxPool2d", "op": "MaxPool", "input": ["strided_slice"], "attr": {"ksize": {"list": {"i": ["1", "3", "3", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}}}, {"name": "Greater/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}, "floatVal": [0.1]}}}}, {"name": "Greater", "op": "Greater", "input": ["MaxPool2d", "Greater/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/PartitionedCall/input/_0", "op": "Identity", "input": ["x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/stack_1/values_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAAAAgD8AAAAAAAAAAAAAAAAAAAAA"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/PartitionedCall/input/_1", "op": "Identity", "input": ["angle"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Cos", "op": "Cos", "input": ["Func/PartitionedCall/input/_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAAAAAAAA+AACAvgAAAAAAAIA+AAAAvgAAAAAAAAA+"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul", "op": "Mul", "input": ["PartitionedCall/Cos", "PartitionedCall/mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Sin", "op": "Sin", "input": ["Func/PartitionedCall/input/_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_1/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAgL4AAAC+AAAAAAAAAAAAAAAAAAAAPgAAgD4AAAA+"}}}}, {"name": "PartitionedCall/mul_1", "op": "Mul", "input": ["PartitionedCall/Sin", "PartitionedCall/mul_1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/sub", "op": "Sub", "input": ["PartitionedCall/mul", "PartitionedCall/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_2/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAAAAAAAA+AACAvgAAAAAAAIA+AAAAvgAAAAAAAAA+"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_2", "op": "Mul", "input": ["PartitionedCall/Sin", "PartitionedCall/mul_2/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_3/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAgL4AAAC+AAAAAAAAAAAAAAAAAAAAPgAAgD4AAAA+"}}}}, {"name": "PartitionedCall/mul_3", "op": "Mul", "input": ["PartitionedCall/Cos", "PartitionedCall/mul_3/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add", "op": "AddV2", "input": ["PartitionedCall/mul_2", "PartitionedCall/mul_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/stack_1", "op": "Pack", "input": ["PartitionedCall/stack_1/values_0", "PartitionedCall/sub", "PartitionedCall/add"], "attr": {"T": {"type": "DT_FLOAT"}, "axis": {"i": "-1"}, "N": {"i": "3"}}}, {"name": "PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAA=="}}}}, {"name": "PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AQAAAAEAAAABAAAAAQAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["PartitionedCall/stack_1", "PartitionedCall/strided_slice/stack", "PartitionedCall/strided_slice/stack_1", "PartitionedCall/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "11"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "11"}, "new_axis_mask": {"i": "4"}}}, {"name": "PartitionedCall/Repeat/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [3]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/strided_slice", "PartitionedCall/Repeat/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/repeats", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [4]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Cast", "op": "Cast", "input": ["PartitionedCall/Repeat/repeats"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_INT32"}, "SrcT": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}}}, {"name": "PartitionedCall/Repeat/Reshape", "op": "Reshape", "input": ["PartitionedCall/Repeat/Cast", "PartitionedCall/Repeat/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples", "op": "Pack", "input": ["PartitionedCall/Repeat/Tile/multiples/0", "PartitionedCall/Repeat/Tile/multiples/1", "PartitionedCall/Repeat/Tile/multiples/2", "PartitionedCall/Repeat/Reshape", "PartitionedCall/Repeat/Tile/multiples/4"], "attr": {"N": {"i": "5"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "PartitionedCall/Repeat/Tile", "op": "Tile", "input": ["PartitionedCall/Repeat/ExpandDims", "PartitionedCall/Repeat/Tile/multiples"], "attr": {"Tmultiples": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Repeat/Shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AwAAAAMAAAABAAAAAwAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [0]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [2]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice", "op": "StridedSlice", "input": ["PartitionedCall/Repeat/Shape", "PartitionedCall/Repeat/strided_slice/stack", "PartitionedCall/Repeat/strided_slice/stack_1", "PartitionedCall/Repeat/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "shrink_axis_mask": {"i": "0"}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [2]}}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [3]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/strided_slice_1", "op": "StridedSlice", "input": ["PartitionedCall/Repeat/Shape", "PartitionedCall/Repeat/strided_slice_1/stack", "PartitionedCall/Repeat/strided_slice_1/stack_1", "PartitionedCall/Repeat/strided_slice_1/stack_2"], "attr": {"end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "PartitionedCall/Repeat/mul", "op": "Mul", "input": ["PartitionedCall/Repeat/Reshape", "PartitionedCall/Repeat/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/concat/values_1", "op": "Pack", "input": ["PartitionedCall/Repeat/mul"], "attr": {"axis": {"i": "0"}, "N": {"i": "1"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [3]}}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [0]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2", "op": "StridedSlice", "input": ["PartitionedCall/Repeat/Shape", "PartitionedCall/Repeat/strided_slice_2/stack", "PartitionedCall/Repeat/strided_slice_2/stack_1", "PartitionedCall/Repeat/strided_slice_2/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "PartitionedCall/Repeat/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [0]}}}}, {"name": "PartitionedCall/Repeat/concat", "op": "ConcatV2", "input": ["PartitionedCall/Repeat/strided_slice", "PartitionedCall/Repeat/concat/values_1", "PartitionedCall/Repeat/strided_slice_2", "PartitionedCall/Repeat/concat/axis"], "attr": {"N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Reshape_1", "op": "Reshape", "input": ["PartitionedCall/Repeat/Tile", "PartitionedCall/Repeat/concat"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/depthwise", "op": "DepthwiseConv2dNative", "input": ["Func/PartitionedCall/input/_0", "PartitionedCall/Repeat/Reshape_1"], "attr": {"padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Identity", "op": "Identity", "input": ["PartitionedCall/depthwise"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/PartitionedCall/output/_2", "op": "Identity", "input": ["PartitionedCall/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/conv2d_4/Conv2D/ReadVariableOp/resource", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "12"}, {"size": "32"}]}, "tensorContent": "hUfuvlZYZT2jkKM9cEAivkNFmT2SpeK8hhmFPcAYUT1DaqO8qe4sPnVUL74fArY9qXcsPoQk6D3F9Ws+FYWBPohA9zwuJ6A8oWJUPij0ZL5OAz++pVRJv4Xqs75ZIaM+lkodPqD38r6ezdm+PWMDPgRmSD5xAzM+OStBPtx2kb50k748hE76vClBbD3Wsqy+h1QzPm5D9D48sJe+O8L7Ppki475Sulk+tTRJvsP5Ab0lm5m+M691vlMXXz6DXqU+eARJPlcid74pH0K+OWkLP+8ETL0b/My9YIhGPghtrL2bJg2/ilRDvHXGqD4379a+EMa/vlwtCz7mzjY+Tu3APmu6dL6ALKQ+tXhAvohcGb5s+lQ8zTeyPpZTpz5Jb44+7G6FvouvBD7eT1I+GYXUvp8Oo74O47e+kTi6PmzH6z6lwIy+WEe7Piio4b4/Hlk7lZWNPstEmj4HbgQ93u/SvegqIL/T4tA+Fz+IPgD+aj2QjJ8+R61bvhWHor4GsLW+pC6dvvPqxL4QBzW+yJEEPU4lpD5NeJa96K5uvUImiT7B56U+FUJ3vsuHEj55UmW+qhV4vjD9pb47X12+SIaTvsZpZj7Jm9y+CloBvkt+Vr5ZdYe9YvJfvRUclT4yu6W+12wRvgnnYT3xGIw97KQyPFUybz6AUNU9PLH+PW8PfL74PJI9agCwvuu0ST0jQp0+xZEuvvQc0j54Xg8+fUIGvmzh3b4yyZw+G2OGvNAKSb41tGi+ZoRXPivJqD5ROrU+i1aevT27fz7ioUa+USJkPfM3Zj2LT5k+G9YtvaDUhj5vXZe+CfTRvmwD6r4/hSQ9uGOzPoIJEL7NAqS+0vxQPoRk2z2OcLU+b2wuvg6w076Y+1c+I13CPtr4Tj4B4609vgrqvQLd3T28c48+6W2LPckmdTyg0j4+w/dzPP7Ugz6fQ7S+vICZvpby0L3xPfc+aBWavllVCL3nH7a+6oJ8PnhbCT0ZWZ69HGqaPhHptL7YFiI+ksrZvhl4Uj1Gt/W9O3I3PfLTNL4CS4Q+cj+NPpeZr76qgYA+y26tPWeku770laG9p1gKvWjDqj7i6Ni+qOC7vTxdK75AkyS9hneZvL9zkbw94pu+IikTPiUI0j7jNLq++3klvpdZ3r1ihqW+6ZT3vI+xmj74lGI+gUOYvtGcJr1lHIg9soSyPmt1ejxRgQm+YAFUPi72GL4zPNQ8eRFDPnW9zz6D7RS9uhSNvnfbgL7e9W89gwWEPV4mkj61rp8+HE1bvtHCJb6u3NA+AdfzPoiVDz8em9++NJoPvln/pz6qhog9yfdzPnW7tT6AOFU+11SXPuTcvD7YuNG+v6mWvrEJMb75aYa+xjI+vsTEBD1p7lq+CStzvufHKD4UzqE+/kDYvY00qz6f9EC+AXUVvq6wgj6PMjC89VcmPASMRD4Wb92+cxcxPf1WlDxKnns+bFPJPLfFAr2gV4y9gPC8vueq7D7BsOa95n4Xvs1RRT3NqbO+ltdKviyqgD277Qy+aXLqvGFGxL51vEI+xaN3Pv+wRj49jCc+ShYxPnMa5r0uVgS+tL+Hu8lBB767vNm9+mlUvjNKMr3ED4o+TKKFPFUCLj5lpDO+KB6XvGlkj75lOTI+KAMQPo7xlL4sNlk+mtjQvfWMWT7+h1i+H/tOvv82LD5Z8HU+blpYPXBLDz432g89rGd9vs/HaLzf1mI+JcbxPsNfEj7xyZK9LBhfvk+BnL5YZWu9uPSsPsVGxT67W64+8GuGvlpbBr7331C+lpnePSpcW77RQ0k8lqSLPoxE2L7d0yY+qFHhPo+Lg77HKMK9LcC+vqbz3j4ZqLO+w9VwPqd00T7TN5g+PQ+ZvTWEn76zzmI+U+5QPUx/B74H5lU+HbiUPon3Mz5tfJA9N6zqPdm0gz5InII+vzFVvncYDL9nPu2+lKwUvrpD+r4wNcg9c8fQPrEySD7m6yo+nkSKPtqquj06a84+/f1hPlusxr18vZq9O2cgvpsECb/UORk++K2XPlBlHD5AXQg+rTWJPhaHGr6Qf62+"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/conv2d_4/Conv2D/ReadVariableOp", "op": "Identity", "input": ["sequential_2/conv2d_4/Conv2D/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/conv2d_4/Conv2D", "op": "Conv2D", "input": ["Func/PartitionedCall/output/_2", "sequential_2/conv2d_4/Conv2D/ReadVariableOp"], "attr": {"padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}}}, {"name": "sequential_2/conv2d_4/BiasAdd/ReadVariableOp/resource", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}, "tensorContent": "SPltPT+Y+7wdZJW9ICCPvPssQrxbCsG8Gzf+vOtlIbxXoHE8V2lFOwI13jrMN9U8WbhsvLniorwjcwI9+i3/vOj6dbvJ+II85lQ/vA7/0bs8iEG9DmzMPbBrkLxSrHA77KU9u3vao7ywpXG9DhbhPHlV+LzN3su9oreaPBKaaLw="}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/conv2d_4/BiasAdd/ReadVariableOp", "op": "Identity", "input": ["sequential_2/conv2d_4/BiasAdd/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/conv2d_4/BiasAdd", "op": "BiasAdd", "input": ["sequential_2/conv2d_4/Conv2D", "sequential_2/conv2d_4/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "sequential_2/conv2d_4/Relu", "op": "Relu", "input": ["sequential_2/conv2d_4/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/conv2d_5/Conv2D/ReadVariableOp/resource", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "4"}]}, "tensorContent": "4FG3PIjlwzpoULu8ZD5/vUnIBD4fVm49tSoOvMKnBz7nTUa8ZzsvO7VSCr31XZm8Xs4yvLcuA7zWGwO90XyJvH1qhDwOKEm9i4CYPSV84jrQBCc+6hoQPbmVnz0+p+09Tu6KvRVtIT2Yfi88ycu3OwCeizxuLrM7VEPMPcWEkD1+6ek84GfOuPt0sz31/JE90AgnPlrf5z2zieu9lgP0PX1mgz1jZcS828YtvfEfNj3tfB89VnSKPVfjIz3N+vG8XuEBPjEV1z2f8wA9+rsIPhwzyLsWdH28b95MvZjDKT28w1s9BpFpPVND9j2Dw/899m8APYSq7D2yGb89JdLLPcqPlr2Shby8Jzg1PRJjEj73d5c+Epd3vDwT2L25Eis+3cuGvGR2GD3K9+m8fVacvPMpRj3GXFG98tCzvSENFz71wMo9lNCsvBupqjxwJA87tx8VPq8cXL2lmis9iJs/vfgCCz3B/HW8T3WLPIRqh7zv7bQ8touUPfBZ870XDbI9pbZtPoTFEz7I/zI+ffNgPrT1pz3Z3Ii8c7bKvE7iyTxqNqk9YPIMuhwkjjwUTh49wieDvcTZqjsB+ss9yzoLPL/e4Lyu95u72UV7PGtNzryi4s+7iIgPvWJ6Ar00x5W9wC1FvADlnTfug8K9mwBEPe5JGz5UYcs9AsNZPXIYuj0="}}}}, {"name": "sequential_2/conv2d_5/Conv2D/ReadVariableOp", "op": "Identity", "input": ["sequential_2/conv2d_5/Conv2D/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/conv2d_5/Conv2D", "op": "Conv2D", "input": ["sequential_2/conv2d_4/Relu", "sequential_2/conv2d_5/Conv2D/ReadVariableOp"], "attr": {"use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "sequential_2/conv2d_5/BiasAdd/ReadVariableOp/resource", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "+jy1vHziITsz6eS7nVQOOw=="}}}}, {"name": "sequential_2/conv2d_5/BiasAdd/ReadVariableOp", "op": "Identity", "input": ["sequential_2/conv2d_5/BiasAdd/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/conv2d_5/BiasAdd", "op": "BiasAdd", "input": ["sequential_2/conv2d_5/Conv2D", "sequential_2/conv2d_5/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "mul", "op": "Mul", "input": ["sequential_2/conv2d_5/BiasAdd", "step_size"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAA=="}}}}, {"name": "strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAQAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AQAAAAEAAAABAAAAAQAAAA=="}}}}, {"name": "strided_slice_1", "op": "StridedSlice", "input": ["x", "strided_slice_1/stack", "strided_slice_1/stack_1", "strided_slice_1/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "15"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "7"}, "shrink_axis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Shape", "op": "Shape", "input": ["strided_slice_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "random_uniform/RandomUniform", "op": "RandomUniform", "input": ["Shape"], "attr": {"seed2": {"i": "0"}, "dtype": {"type": "DT_FLOAT"}, "seed": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "LessEqual", "op": "LessEqual", "input": ["random_uniform/RandomUniform", "fire_rate"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Cast", "op": "Cast", "input": ["LessEqual"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}, "SrcT": {"type": "DT_BOOL"}}}, {"name": "mul_1", "op": "Mul", "input": ["mul", "Cast"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "add", "op": "AddV2", "input": ["x", "mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "strided_slice_2/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAwAAAA=="}}}}, {"name": "strided_slice_2/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAABAAAAA=="}}}}, {"name": "strided_slice_2/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AQAAAAEAAAABAAAAAQAAAA=="}}}}, {"name": "strided_slice_2", "op": "StridedSlice", "input": ["add", "strided_slice_2/stack", "strided_slice_2/stack_1", "strided_slice_2/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "7"}, "end_mask": {"i": "7"}}}, {"name": "MaxPool2d_1", "op": "MaxPool", "input": ["strided_slice_2"], "attr": {"ksize": {"list": {"i": ["1", "3", "3", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}}}, {"name": "Greater_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}, "floatVal": [0.1]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Greater_1", "op": "Greater", "input": ["MaxPool2d_1", "Greater_1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "and", "op": "LogicalAnd", "input": ["Greater", "Greater_1"]}, {"name": "Cast_1", "op": "Cast", "input": ["and"], "attr": {"SrcT": {"type": "DT_BOOL"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "mul_2", "op": "Mul", "input": ["add", "Cast_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}], "versions": {"producer": "1.14", "minConsumer": "1.14"}}, "weightsManifest": []}