{"format": "graph-model", "modelTopology": {"node": [{"name": "x", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "4"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "step_size", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "angle", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "fire_rate", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {}}}}, {"name": "strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAwAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAABAAAAA=="}}}}, {"name": "strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AQAAAAEAAAABAAAAAQAAAA=="}}}}, {"name": "strided_slice", "op": "StridedSlice", "input": ["x", "strided_slice/stack", "strided_slice/stack_1", "strided_slice/stack_2"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "7"}, "begin_mask": {"i": "7"}}}, {"name": "MaxPool2d", "op": "MaxPool", "input": ["strided_slice"], "attr": {"data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "3", "3", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}}}, {"name": "Greater/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}, "floatVal": [0.1]}}}}, {"name": "Greater", "op": "Greater", "input": ["MaxPool2d", "Greater/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/PartitionedCall/input/_0", "op": "Identity", "input": ["x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/stack_1/values_0", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAAAAgD8AAAAAAAAAAAAAAAAAAAAA"}}}}, {"name": "Func/PartitionedCall/input/_1", "op": "Identity", "input": ["angle"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Cos", "op": "Cos", "input": ["Func/PartitionedCall/input/_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAAAAAAAA+AACAvgAAAAAAAIA+AAAAvgAAAAAAAAA+"}}}}, {"name": "PartitionedCall/mul", "op": "Mul", "input": ["PartitionedCall/Cos", "PartitionedCall/mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Sin", "op": "Sin", "input": ["Func/PartitionedCall/input/_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAgL4AAAC+AAAAAAAAAAAAAAAAAAAAPgAAgD4AAAA+"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_1", "op": "Mul", "input": ["PartitionedCall/Sin", "PartitionedCall/mul_1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/sub", "op": "Sub", "input": ["PartitionedCall/mul", "PartitionedCall/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_2/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAAAAAAAA+AACAvgAAAAAAAIA+AAAAvgAAAAAAAAA+"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_2", "op": "Mul", "input": ["PartitionedCall/Sin", "PartitionedCall/mul_2/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_3/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAgL4AAAC+AAAAAAAAAAAAAAAAAAAAPgAAgD4AAAA+"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_3", "op": "Mul", "input": ["PartitionedCall/Cos", "PartitionedCall/mul_3/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add", "op": "AddV2", "input": ["PartitionedCall/mul_2", "PartitionedCall/mul_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/stack_1", "op": "Pack", "input": ["PartitionedCall/stack_1/values_0", "PartitionedCall/sub", "PartitionedCall/add"], "attr": {"axis": {"i": "-1"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "3"}}}, {"name": "PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAA=="}}}}, {"name": "PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AQAAAAEAAAABAAAAAQAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["PartitionedCall/stack_1", "PartitionedCall/strided_slice/stack", "PartitionedCall/strided_slice/stack_1", "PartitionedCall/strided_slice/stack_2"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "11"}, "new_axis_mask": {"i": "4"}, "begin_mask": {"i": "11"}, "shrink_axis_mask": {"i": "0"}}}, {"name": "PartitionedCall/Repeat/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [3]}}}}, {"name": "PartitionedCall/Repeat/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/strided_slice", "PartitionedCall/Repeat/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/repeats", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [4]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Cast", "op": "Cast", "input": ["PartitionedCall/Repeat/repeats"], "attr": {"DstT": {"type": "DT_INT32"}, "SrcT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "PartitionedCall/Repeat/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}}}, {"name": "PartitionedCall/Repeat/Reshape", "op": "Reshape", "input": ["PartitionedCall/Repeat/Cast", "PartitionedCall/Repeat/Reshape/shape"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples", "op": "Pack", "input": ["PartitionedCall/Repeat/Tile/multiples/0", "PartitionedCall/Repeat/Tile/multiples/1", "PartitionedCall/Repeat/Tile/multiples/2", "PartitionedCall/Repeat/Reshape", "PartitionedCall/Repeat/Tile/multiples/4"], "attr": {"axis": {"i": "0"}, "N": {"i": "5"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile", "op": "Tile", "input": ["PartitionedCall/Repeat/ExpandDims", "PartitionedCall/Repeat/Tile/multiples"], "attr": {"T": {"type": "DT_FLOAT"}, "Tmultiples": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AwAAAAMAAAABAAAAAwAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [0]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [2]}}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/strided_slice", "op": "StridedSlice", "input": ["PartitionedCall/Repeat/Shape", "PartitionedCall/Repeat/strided_slice/stack", "PartitionedCall/Repeat/strided_slice/stack_1", "PartitionedCall/Repeat/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [2]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [3]}}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/strided_slice_1", "op": "StridedSlice", "input": ["PartitionedCall/Repeat/Shape", "PartitionedCall/Repeat/strided_slice_1/stack", "PartitionedCall/Repeat/strided_slice_1/stack_1", "PartitionedCall/Repeat/strided_slice_1/stack_2"], "attr": {"end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}}}, {"name": "PartitionedCall/Repeat/mul", "op": "Mul", "input": ["PartitionedCall/Repeat/Reshape", "PartitionedCall/Repeat/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/concat/values_1", "op": "Pack", "input": ["PartitionedCall/Repeat/mul"], "attr": {"N": {"i": "1"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [3]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [0]}}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/strided_slice_2", "op": "StridedSlice", "input": ["PartitionedCall/Repeat/Shape", "PartitionedCall/Repeat/strided_slice_2/stack", "PartitionedCall/Repeat/strided_slice_2/stack_1", "PartitionedCall/Repeat/strided_slice_2/stack_2"], "attr": {"end_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}}}, {"name": "PartitionedCall/Repeat/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [0]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/concat", "op": "ConcatV2", "input": ["PartitionedCall/Repeat/strided_slice", "PartitionedCall/Repeat/concat/values_1", "PartitionedCall/Repeat/strided_slice_2", "PartitionedCall/Repeat/concat/axis"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "N": {"i": "3"}}}, {"name": "PartitionedCall/Repeat/Reshape_1", "op": "Reshape", "input": ["PartitionedCall/Repeat/Tile", "PartitionedCall/Repeat/concat"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/depthwise", "op": "DepthwiseConv2dNative", "input": ["Func/PartitionedCall/input/_0", "PartitionedCall/Repeat/Reshape_1"], "attr": {"data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Identity", "op": "Identity", "input": ["PartitionedCall/depthwise"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/PartitionedCall/output/_2", "op": "Identity", "input": ["PartitionedCall/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/conv2d_4/Conv2D/ReadVariableOp/resource", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "12"}, {"size": "32"}]}, "tensorContent": "jLrevrhzDD1bppg98BQ3voFQsz3+zvW8JvSZPWWSmT2V/7m8X+MdPpjOKb4/LYg9QNYkPspcxj2EMH0+eapvPpLEdjtbJRG7yrcoPoP0Ub7cSUi+MLWOv08Ku77qeJw+dwwZPnKi4L4KAdW+rRDHPSgUKD6atjM+RxMhPk0Au74YJp09XS2EPTwWaL1cIay+XLyFPjLj/D6lypC+5kX3PnkO8b59i0s+JUU8vu4deLqcNJG+dgptvpTJZD7VlMI+L4IcPs0Gf76mS2a+yHoPP5S+XLwJn/+9ZlGOPrQEZr2GEBC/mJhCuo/Dqj5lzc2+2SKvvmY1DD5hiEE+VvyoPsMxp74hz5k+K6UTvnI2Gr5cm5k8eCHXPtlClz7oFIg+KDtlvquPTD7mr1c+FpPUvqBPp754M8e+odvHPsvHAj8tHYy+Gg69PsI3777IXXk9PLWSPn/jkD757bU90ji+vTm7Lb9fjKc+Tct/PvwuSj2iRZE+PLNDvtd0j76pGNS+ZF+OvhxxxL7ayEW+HQIyPODqnz59mC29cy2fvQuchz40sZo+UGlyvqe0ET5q5We+42GCvs2Krr4tlGq+SKmTvqQZZz74Gd2+oEkxvmtgHb68g9i9EKzUt2bikz4u3aC+aloYvtGkXT2ow4g91Dn2PJZ+aj4+FcI9Qd8IPlBQe74RJBk9FVWcvugN3T0QeLs+DjrPvQUO4j4uqI89Jb83vqB+8r5/HJ4+qGNLPXVLcb4fwmq+gfpCPnUGfj4V4LI+CqZHveW2jT6kQIC+JapkPYW0XT1B754+yT8bOy1xnD5OX5W+u13svqspBL+i/IU8+yjVPt2e572zBLe+gddQPtUnHD7nPbw+er9yvvj51r64Ooo+FZ3bPg60yT1YIi09zGGWvYHTDT5xRqk+Sa8KPtIOBT1R5lU+LZwRvcn3kz4+N9a+9vOJvpWCz72meBQ/l1ysvsVvHz3EcIu+cWi4Pl7BMz3C01S946qVPghNwL4rVQM+LdzXvlyxFz52rSK+pmaHPVQZV74P4Io+cxuHPmUbv77wcIg+XhhIPeqZvb7LJ9a9vI1QvafusT6d69W+aA/6vVonPL57Sou9TEU9vaboKr3zOKC+o/AMPlfC+D6MhMe+U6cCvupWAr4GYaK+uN41vat3oz5fGmE+VPK3vsLxc73oPDo9jbG3PguObjx2K0m+VMx0PimlWb5emSE96sxTPgb+2z6SZV+9jjKBvm2qir4H7TU9X5EvPrrilj4eoaQ+FQ5xvqvA872ZYNw+toITP0K6LT/LOue+fYoJvnG3nj656+K8cek4PnZOsT4HOlU+GqOlPiuTwT562+++68WrvvSKU76c9Ja+RIlQvuBDrr2S60W+HiQevo25+T2xocI+AdeuvMBBjT70iHi+Qbd6vceFsj65Fi099WLRuy8ibD5XQ+e+xyg7PNgYAz49NSI+4cT2Oy3ZiL2CUA+8FojSviCXAT/xJ8i97tKBvc9Uiz2F4NS+m5tMvltzJz4aaSy+dC2JvaB3kb79R0I+I6B7PuzIVT6ByR4+risgPk/tBb4KP+69HvIePIEaEL5xpAW+nGw+vlyhi71Ca48+JmrePPh2Wz5u3Fm+VTUCvUqVjb7ZwEc+YurePcpYj76FU2E+h7fGvfCAST7DGlS+U8VOvgwxGT5dxm8+1cIGPegLAj7zmvI80A18vodCobt3hz0+vVABPxnPyz0/Oqe9MwQ9vjVVmL4J4cq8WYuZPq55zz75S8k+3AA9voa+pL24LmO+HPjDPbfLhL5Ph747DpilPsOn6b7m1hM+upDrPmE/mL77dZW99pizvheP8j7V0sS++E6FPnuC2T6HLYk+WZyIvVixwb4644c+sSA2PcZTHL4YLTU+aXCaPhOGUD7vD6s9CnUIPj3mOj5CQ28+6aJWvs+VHL95ROi+2ZyxvSGyAr+VwkQ9Qm++Pu23gT5s8Tg+t1uLPszFzj03fdw+sLBXPurgLb6O8jK9VcQVvnRUFL+dFrw9w81VPqo8SD4yJyM+4siWPgXojb0OKrC+"}}}}, {"name": "sequential_2/conv2d_4/Conv2D/ReadVariableOp", "op": "Identity", "input": ["sequential_2/conv2d_4/Conv2D/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/conv2d_4/Conv2D", "op": "Conv2D", "input": ["Func/PartitionedCall/output/_2", "sequential_2/conv2d_4/Conv2D/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "sequential_2/conv2d_4/BiasAdd/ReadVariableOp/resource", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}, "tensorContent": "ofJMPSW3Ir3m1LC9HsHWOhjfPryHREe9MGUWvadjgryrvZ48YeySvFLevzyjEpQ8m6iDvHnfHL0Rrd487XZwvOBRE7y1Iq88OImyvKJXB70ssyK9pkbqPfnHML0jkCe8z58/vLUM27xTxlS9jAIYPREGiL240dm93tSjPEOFt7w="}}}}, {"name": "sequential_2/conv2d_4/BiasAdd/ReadVariableOp", "op": "Identity", "input": ["sequential_2/conv2d_4/BiasAdd/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/conv2d_4/BiasAdd", "op": "BiasAdd", "input": ["sequential_2/conv2d_4/Conv2D", "sequential_2/conv2d_4/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/conv2d_4/Relu", "op": "Relu", "input": ["sequential_2/conv2d_4/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/conv2d_5/Conv2D/ReadVariableOp/resource", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "4"}]}, "tensorContent": "cnjBPHY8HDyV34y8ORy0vdhMxT1DPLQ96MsVvXfmED7XTAu9cqiyO8Ykab3UXVu9Au+2vHkXgrxw3XO9zhJyupA3sz0pGgW98K/WPQLcE7yWnP09tfF2PWKYzD2eGPc9/0yBvZr3VT1TE488RZRbPD7eSjxxVKc7yIMNPv2Fujz2f689Gs3UuW9ZFT71LYw9uUt7Pr4Zjz3OzRa+s2UUPh28yD2OTyC9xdpwvd1yEj09w648YUrDPX0Yez3DjYK9GbQePv+lDz5mZHI9cbgOPpoOQLyJ8j+9PDqSveBOnz3zDkA9KblEPcD5Cz4DQxI+1EBAvHKAJj7uyAQ+O4awPfpSyr1OCq+84uUBPhGGNT4/07g+f92mvF310r1jdyY++bgcvLwDbj3k9A29Oy6ovEgLUDyQEu+8huapvRXWdj4+iR0+vHOSveUaxbz0u8Q8IMV3PnjqY72zkiU9cMSYvdRlCj2f36e87kPYPGvKoLwpIn28Q0yxPa5m+r1M0eA9KLp5PiWrTD6j5G0+TJt4PgbQwj04USc7oaTHvCFBHjw5UuA9QVIhPIqFET38J5U8z+KkvSLLITwkoCo+SD0Vug1EwLydLIq88dc9O6OkIL2x/6O85DNGvQeQFb3WEMy9+y4CPU55KbyfJ7i9/GOgPYe4Wj7IkBU+RgInPZ9xCj4="}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/conv2d_5/Conv2D/ReadVariableOp", "op": "Identity", "input": ["sequential_2/conv2d_5/Conv2D/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/conv2d_5/Conv2D", "op": "Conv2D", "input": ["sequential_2/conv2d_4/Relu", "sequential_2/conv2d_5/Conv2D/ReadVariableOp"], "attr": {"explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "sequential_2/conv2d_5/BiasAdd/ReadVariableOp/resource", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "ytcTvRTB4TvHvsS7gqO9Ow=="}}}}, {"name": "sequential_2/conv2d_5/BiasAdd/ReadVariableOp", "op": "Identity", "input": ["sequential_2/conv2d_5/BiasAdd/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/conv2d_5/BiasAdd", "op": "BiasAdd", "input": ["sequential_2/conv2d_5/Conv2D", "sequential_2/conv2d_5/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "mul", "op": "Mul", "input": ["sequential_2/conv2d_5/BiasAdd", "step_size"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAA=="}}}}, {"name": "strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAQAAAA=="}}}}, {"name": "strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AQAAAAEAAAABAAAAAQAAAA=="}}}}, {"name": "strided_slice_1", "op": "StridedSlice", "input": ["x", "strided_slice_1/stack", "strided_slice_1/stack_1", "strided_slice_1/stack_2"], "attr": {"T": {"type": "DT_FLOAT"}, "end_mask": {"i": "7"}, "shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "15"}, "ellipsis_mask": {"i": "0"}}}, {"name": "Shape", "op": "Shape", "input": ["strided_slice_1"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "random_uniform/RandomUniform", "op": "RandomUniform", "input": ["Shape"], "attr": {"seed2": {"i": "0"}, "T": {"type": "DT_INT32"}, "seed": {"i": "0"}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "LessEqual", "op": "LessEqual", "input": ["random_uniform/RandomUniform", "fire_rate"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Cast", "op": "Cast", "input": ["LessEqual"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}, "SrcT": {"type": "DT_BOOL"}}}, {"name": "mul_1", "op": "Mul", "input": ["mul", "Cast"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "add", "op": "AddV2", "input": ["x", "mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAwAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAABAAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AQAAAAEAAAABAAAAAQAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice_2", "op": "StridedSlice", "input": ["add", "strided_slice_2/stack", "strided_slice_2/stack_1", "strided_slice_2/stack_2"], "attr": {"end_mask": {"i": "7"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "7"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}}}, {"name": "MaxPool2d_1", "op": "MaxPool", "input": ["strided_slice_2"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "ksize": {"list": {"i": ["1", "3", "3", "1"]}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "Greater_1/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}, "floatVal": [0.1]}}}}, {"name": "Greater_1", "op": "Greater", "input": ["MaxPool2d_1", "Greater_1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "and", "op": "LogicalAnd", "input": ["Greater", "Greater_1"]}, {"name": "Cast_1", "op": "Cast", "input": ["and"], "attr": {"DstT": {"type": "DT_FLOAT"}, "SrcT": {"type": "DT_BOOL"}, "Truncate": {"b": false}}}, {"name": "mul_2", "op": "Mul", "input": ["add", "Cast_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}], "versions": {"producer": "1.14", "minConsumer": "1.14"}}, "weightsManifest": []}