{"format": "graph-model", "modelTopology": {"node": [{"name": "x", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "16"}]}}}}, {"name": "fire_rate", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {}}}}, {"name": "angle", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {}}}}, {"name": "step_size", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAwAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAABAAAAA=="}}}}, {"name": "strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AQAAAAEAAAABAAAAAQAAAA=="}}}}, {"name": "strided_slice", "op": "StridedSlice", "input": ["x", "strided_slice/stack", "strided_slice/stack_1", "strided_slice/stack_2"], "attr": {"begin_mask": {"i": "7"}, "end_mask": {"i": "7"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "MaxPool2d", "op": "MaxPool", "input": ["strided_slice"], "attr": {"T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "3", "3", "1"]}}}}, {"name": "Greater/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}, "floatVal": [0.1]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Greater", "op": "Greater", "input": ["MaxPool2d", "Greater/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/PartitionedCall/input/_0", "op": "Identity", "input": ["x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/stack_1/values_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAAAAgD8AAAAAAAAAAAAAAAAAAAAA"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/PartitionedCall/input/_1", "op": "Identity", "input": ["angle"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Cos", "op": "Cos", "input": ["Func/PartitionedCall/input/_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAAAAAAAA+AACAvgAAAAAAAIA+AAAAvgAAAAAAAAA+"}}}}, {"name": "PartitionedCall/mul", "op": "Mul", "input": ["PartitionedCall/Cos", "PartitionedCall/mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Sin", "op": "Sin", "input": ["Func/PartitionedCall/input/_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_1/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAgL4AAAC+AAAAAAAAAAAAAAAAAAAAPgAAgD4AAAA+"}}}}, {"name": "PartitionedCall/mul_1", "op": "Mul", "input": ["PartitionedCall/Sin", "PartitionedCall/mul_1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/sub", "op": "Sub", "input": ["PartitionedCall/mul", "PartitionedCall/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_2/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAAAAAAAA+AACAvgAAAAAAAIA+AAAAvgAAAAAAAAA+"}}}}, {"name": "PartitionedCall/mul_2", "op": "Mul", "input": ["PartitionedCall/Sin", "PartitionedCall/mul_2/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_3/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAgL4AAAC+AAAAAAAAAAAAAAAAAAAAPgAAgD4AAAA+"}}}}, {"name": "PartitionedCall/mul_3", "op": "Mul", "input": ["PartitionedCall/Cos", "PartitionedCall/mul_3/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add", "op": "AddV2", "input": ["PartitionedCall/mul_2", "PartitionedCall/mul_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/stack_1", "op": "Pack", "input": ["PartitionedCall/stack_1/values_0", "PartitionedCall/sub", "PartitionedCall/add"], "attr": {"axis": {"i": "-1"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "3"}}}, {"name": "PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAA=="}}}}, {"name": "PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAA=="}}}}, {"name": "PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AQAAAAEAAAABAAAAAQAAAA=="}}}}, {"name": "PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["PartitionedCall/stack_1", "PartitionedCall/strided_slice/stack", "PartitionedCall/strided_slice/stack_1", "PartitionedCall/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "4"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "11"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "11"}}}, {"name": "PartitionedCall/Repeat/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [3]}}}}, {"name": "PartitionedCall/Repeat/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/strided_slice", "PartitionedCall/Repeat/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/0", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/repeats", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [16]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Cast", "op": "Cast", "input": ["PartitionedCall/Repeat/repeats"], "attr": {"DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}, "SrcT": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Reshape", "op": "Reshape", "input": ["PartitionedCall/Repeat/Cast", "PartitionedCall/Repeat/Reshape/shape"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples", "op": "Pack", "input": ["PartitionedCall/Repeat/Tile/multiples/0", "PartitionedCall/Repeat/Tile/multiples/1", "PartitionedCall/Repeat/Tile/multiples/2", "PartitionedCall/Repeat/Reshape", "PartitionedCall/Repeat/Tile/multiples/4"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "5"}}}, {"name": "PartitionedCall/Repeat/Tile", "op": "Tile", "input": ["PartitionedCall/Repeat/ExpandDims", "PartitionedCall/Repeat/Tile/multiples"], "attr": {"Tmultiples": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Repeat/Shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AwAAAAMAAAABAAAAAwAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [0]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [2]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice", "op": "StridedSlice", "input": ["PartitionedCall/Repeat/Shape", "PartitionedCall/Repeat/strided_slice/stack", "PartitionedCall/Repeat/strided_slice/stack_1", "PartitionedCall/Repeat/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [2]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [3]}}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/strided_slice_1", "op": "StridedSlice", "input": ["PartitionedCall/Repeat/Shape", "PartitionedCall/Repeat/strided_slice_1/stack", "PartitionedCall/Repeat/strided_slice_1/stack_1", "PartitionedCall/Repeat/strided_slice_1/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "PartitionedCall/Repeat/mul", "op": "Mul", "input": ["PartitionedCall/Repeat/Reshape", "PartitionedCall/Repeat/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/concat/values_1", "op": "Pack", "input": ["PartitionedCall/Repeat/mul"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "1"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [3]}}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [0]}}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/strided_slice_2", "op": "StridedSlice", "input": ["PartitionedCall/Repeat/Shape", "PartitionedCall/Repeat/strided_slice_2/stack", "PartitionedCall/Repeat/strided_slice_2/stack_1", "PartitionedCall/Repeat/strided_slice_2/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "1"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [0]}}}}, {"name": "PartitionedCall/Repeat/concat", "op": "ConcatV2", "input": ["PartitionedCall/Repeat/strided_slice", "PartitionedCall/Repeat/concat/values_1", "PartitionedCall/Repeat/strided_slice_2", "PartitionedCall/Repeat/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "N": {"i": "3"}}}, {"name": "PartitionedCall/Repeat/Reshape_1", "op": "Reshape", "input": ["PartitionedCall/Repeat/Tile", "PartitionedCall/Repeat/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/depthwise", "op": "DepthwiseConv2dNative", "input": ["Func/PartitionedCall/input/_0", "PartitionedCall/Repeat/Reshape_1"], "attr": {"data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/Identity", "op": "Identity", "input": ["PartitionedCall/depthwise"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/PartitionedCall/output/_2", "op": "Identity", "input": ["PartitionedCall/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d/Conv2D/ReadVariableOp/resource", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "128"}]}, "tensorContent": "wO6luyImgz0NIgI+CLbkvFFCGj4A+E056jvJPQB7zzsoS8281OlevTKt3z3Stek9IOOnPIIGkj0eEpA9rPoXPYh1nbxDzx4+YO2qPLBUAr26orE9rP0GvUCru7wD/Ac+5NhrPVFfHz4ft+C9YOPlvNcAL77wPRQ80IjHPKjEuLxydgy+CvaFPXRdaD2A3Pq9sLguPZGgCT7rDSo+l3PmvZy6Yr1hCgE+eAuUPGgbZ714w289so78PZwpM76wf6Q8PjmsPYLcsz3fzi8+UJRHvWWHHj4ebf89Yh6BPUyPMb40NPW9h2jxvRBw3LwAgqO7w/gAPsBfKryJyJ29IKxLvQtPOD6glxO8mLHLveB17bwCW/Y9WtSbPeiqFD0IWWe9AGJnvPhbrTx9Z8G93KfvvTVWGj54u3y94MYrviZC9T1X5h++bZuyvTWfIj4MBBy+qF+9PMadKb7qCbc9ltgzvtjnYL0V1h2+0JO/PC/1Kj6Ykao8uL7LvFTDCj34gTS+WIB7vQihiryXT629FjGWPQn2G75XeDq++zELPpoFCb4Q5Ri9PFspvkF7ED4+So89SmudPZszkL3QgAQ8abUkvlzRGb3ywii+Bd+TvQCV57w4Oey96+cUPujrlrwrNpW91kHavZJLgb24m8S9mgzCvabWr70UVGc9Byr4vW5F3z2Wp/k9bQavvY9eDz5uf7I9Kj3vPcZymb0cjAe++7A8Plcj6r3P+gc+j/EevmePAz50lz69yl6zPUWQk70geEy8DkkCvijHqTzh+jq+cQ4evjvpJT4QYpK8bEtOvWUYx71Igy29N+w4PlIcwr1OFs89VwkcPufPID6cGyG+XYgEPg15ET7Qtzg8NrypPai79bxk5WY9JNiWvXlplr1SCCm+91IYPtJlzr2HhCg+4WksPoXvKT40+se9kKIovpgBgzzwrCq+ADQLPZC7J73OF6Y9ZRsyPn6Y672oPt+851/jveg9Mr1IHq48MDA5vAD20bo49169rpuGPTsWMj4HVx8+Om0mvtc7CT7AWRQ9qmV+veHACT5wo4I84DHDvRGzDj52CoI9ipK3PYBtybvABT2+UBAmvWhWnr01uTU+x38FPnLc5z1sBAy+mQQMPsKYCb6xJM69cFT2vOb0zz3Ie9K8dhbDPcY5ij14K8s8Z7QJPv4T4j3lWyI+rJsGPcVfDr4/+S++mqK2vfiGSr1w+XW8veEZvubQB76WPRS+tX08PggOFb5goDK+KCnUvFgbpjzEhrm90WomPv6ZCL50rEA9JdMvPs+oGz7nmRk+HPoYvU3lID4cawS+wgP5vR/MCL4Bbzu+QIwIvgs1HL4elCK+vGlYPd5UIb7OGtw9OlXSvQaPpD3P3LW9ML6qvcCDLL4Q/sY8w/+ivazmKb5LECq+mOiAPG2yNj7XDDc+GYIqPlCRDb6wP0E8ux4qPiYs9z2aX/A9LAAIvatprr290Qg+AO7DumHxEz4ISGk99nyCPV+Cnr09sp29YHWsu4C1O7x/VCm+hGn6vUkVMj6+uoq9Q4m2vZHeFj5QlCi+zkadPVCjujx4q5y8wHgXO70SMr5awN49keMPviBlZ70YqdW96lgnvnwADj10UjE9RYvivXB0UDx2ytk95zPGvYf9Bj5nBC8+UiXuvYCvorwvZxu++2snvq4nhr06YTu+JLomvqf1Cb5qV9q9AME8PfBNdb0OVYU9KEUkPX1SFT70aTi+6MifvA4qur0H8iM+kJsWPB82Kj4LCxo+uDkJPTwiVz37vA0+2Om+PLRA3L0k2iO+1F2APcYFib24RqA8gHVWvCbVsz0o1hG+cLP6vJQIW70U7329qbDhvcx7Sb3APEk8dAr0vWaT1D26V/c9ou3cPYAgG7xgQPI7scAnPmyOFL4YZlg9/UQSPijTCb2L+Tc+Gtjivfh/L73Cztg9orzvPQNz5L12T4w94DFnPdBu473HhBQ+vOBiPbCdLbzETic9QGvuvNYfrD2ABT87MNwCPGDpETyIU289JVXpvRJThr3lSg2+SqDjPeByFTynsxk+VJcSPZhHRT1+Hcc9xNs8PQh+Ob4SQgu+wOPfvBgpJ70A4RM9AKviu39uOD7DgPG9XjXyPVBiVj2O19m9zER/vcmuv71GZ+E9CqL7vZ0OOr72QtU9t1X4vThhxTygpci8eAWNPG6miD0QVLa9zZkXvp24+L02N7o9qCkvvpw9C70pEzi+LLlxvYqhjT1WarU9mBSbPF3ONj52peE9afoFvp+KDj7YSKm8shXjPZOAND4QzqI8WOJoPQSA1b1gM4M7R7+evfL7pz25HAw+8NYbvs6Wkj1Zqh4+pVkGPs2vJL41Yxg+Lr+xPcA2tjwqfoI9yVIYPiGg8b3mkdQ9qONIPa78rT0S/uo9YdTxvfO4qL3aDJu986r5vbhIbr1osfE85Q8KPgIG8z1ppCe+WUYQvgYWib1QiVq97KJuPYw1u73U+TI9sYstPmy5R71Q53G8kD4JvoDP9jzVVwY+VdEqvsuJBL6sqWc9bMZrvYDp0zol3ou9a4I7Pj7J0j1QuaU89H2yvQ6uzj3CJcM92FEuPQ0s173wQp88lJAlvaKBB75n7iY++N9APc18rL01eSG+4TmYveCENDwehI090IR+vMgeo71UCma9smahPZjUar1Yl4w8POHGvRnwFz7ii8E9AGzdu5cxNz4fJRE+66jEvWS1WT3yINU9wO48O5j/9bzWSii+rp3/PaZOwT2iQna9gtgxvtPz273wuuW8sCRZvfC+CL2EolS9wIyCPXF+Gj67iCM+ALOsO7QPK77JuC4+yLEVPRvmIT4yoMK9uDbZvLztKD2uH6k98ExcvY2cFT6AYtw7mLEVvYH5DT4fRic+PEB0vUBYGTy+0aM9jOYWPRhkLr4mKIY9Po3QPQwPUL2ACWo8b5QRPii1Yr19sB0+EOa5vPirGr0fCAY+TnoevlUYh70Coto9XEzZvTFSOr7N+zw+UBrcPIwi+r048cs8GNiXvdgWy703DDE+AHbQukCCUD2qtPE9d94TPkjXOL5N4C4+AhiMPWgHobz85c69xf4eviKp2T3h9Oi9zpCxPSfYrr2AeLa7YvIovgB5h7rYTj09HApAvewV+72wTDS+8HosvWYf4L3wXXs8VlWgPY/VET46m6K9dXiMvdwOSb0gpxe88H0ivVY+wT08n1o9Ui7QPaiUEb0odI+8eOyEvDpsAr5QQ7W8xquUPQbejT2EibO93YQfPiLttz2QWnC8ZgM5vnqqLr7C04c9+D1zvYjuez117x6+f6UJPuBHfrwvnCW+vlPnPaDmHz3Uly491K5jvaS8Uj2G3ds9Nt4uvqxXe73wK109gOckPfhopbxgTlG9vqoUvg7Q1D2nSTm+xMkOvrY6Fb6YsXU9Pom6PXnK/L0dexY+tqytPeQ7Db2onL48aLegvfiYWD3osrE89qGGPRt7DT6SzB++tQwtPoA2Ar2irYA9KDkzPQYoIb4XgAG+AgC1PWrxDL4ptBA+vsroPblgGr5qKtA9lDUWvr0IEz58JgQ96J6UPIB/vjvg2N67C8IJPpBTGr0MJjo9AGnjumHCEj6cUoM98/kuvhyHJ75DizE+qHCUvOB0SL3hTQc+sIycvS7t1j3yC649uDMMPcyxAT3Qn848PvX3PcgrDL34RMU8YGgsvuDhtTvjPCS+q8QuPjFbJL4nS+i9JDxTvR8cFT6eZNa9WjcAviyKdD0fau294C54vcA39LxAcIy7JMcUvj+EDT5zJAs+ljDvPfmbjr1KjMw95ClkvcCG8ztUizK+jeojvrhnlL0oSzY9bFgZPRM8Dz44oWi9M2U3vvIiiT1Odd897tUjvs4JGL4RGyU+OWAHvqBwo7sqZRm+gd4MPh+IMr7mJe49gI4LO5WanL3lxDg+6OhZvWAZzbzspjy9yJ2nvI2F2r0oY8G8mBx8Pdgdv70RXtO9KTsePqibOj0YtOa8xuGrPbjxBr26xfk9IuE6vk/bg73wK5y9uuijvSYH3D34SrS9ktqTPTmWNz5YMmU9ZDgSvcBYBD1wmak8kDL0PB8A6r3eG949+Mo/PWApKL2wox2+CCWkvHDQ9LzWerK9IPlyPF5Sd73MCA09BO0LvUzTdT0qjvE94vacPTUTCD6yhuc9IqOrPVZzF74jWzs+Zh61PUoI3D3Gpiq+ABVMu5EDqb0Oe509aT0xvrBR3jyvFxA+QGk+PcLIzD0e8Ls9w1AHPtzYOL5u0qo9zGFSvQ1tKD7gZyq9EAXfvRUa8L163bw9J0A1PjyeEr4QLZU8hysoPhr7Nb4Q/9m8bu+7PS7y8z1IWty8s/8lPh7qyz1QcAk8LrvtvTVbMb6oeVw9LYI6PlmHLD4qHTi+sIU1vM781z1JnTI+grw8vqLzt73LPBG+0JQ/PQW+JD7LDjI+5Po7vrVZzb0AkBq4nlSFPYKo6D0xOi8+plmBPd56sj2JhjQ+vHMrPV5gsL2yW469jjUXvkCJGr0cPN+9RIg/PTAH3Lw/aiY+FjOIPcDyK75McWk9ICbTPCCGeDySZ9Q9IfcgPoCisjxJhSM+IFzXPLDCW72FJaa9vjO3PXALp71Vxjg+KXakvfbWyr1YNEi9+kqjvaHImr1wQFU816kEPhqF+z3+sI49Gi8ZviAL/rsAvBg5mhnePYz0oL3Jizw+rTU6Ph6s2z0gUcG9fo7GPQABvrr2hbA93IrXvQL0Ab4q7Y09KEvAvIrg1z2T8Tw+/cEPPsFeEb4nTfa921AJPjMqrr0xKTg+al3RPajMCr1eEdQ9e9+UvdlwLb7opwa9fd0fvs4ryT2s93U9OFuZPMDFSr2A2v08DLAIvmCUsLu4GTg9NJdvvdLI3D0Gaaq9e8SOvc85Hb5SoxO++6cwPj2cE74f0jk+iNp8PVy5Hb7Cp5+9W9giPlCsOD1gpiO+x+gxPoJA5j2XnhW+XralvQAt0TqY+w896A+ovMGFND7JQeS9QsPpPfwGL72RYbG90HEEvkXhKj6wf7I8ZNYVPSgF7bxuodg9S0sHPjPlHL6w7ki94GiovAgGCb0qMpo9KumFPUB4SDuiBtQ9SBeivcAROztA6H28DFM5vXvMNz45ZiE+ZX84PgADcrogTvm7t6TIvZdM2r0srng9v0+yvUl4Ob4nXhY+DAxOPXIGrD0TNSi+1GwBvbZ7iD2qQM29GENkPV6U6T2aiAm+ULOgvFxajL0YZIa8bzs1Pkgfbj39ATm+qAFRPc79Ar4M4E29fCQEvptTKD6dSDk+1HksPfiAqby+YjG+fkHMPZIAOr4YICW+qT8cvgjpDD2MzlW9PJllvTqTjj2GkDC+9Do0vaCcN74Ze9O9+VkzvjkGo71Qtsm8yQkPPoQxGr5CzjK+vnq7vXKAij16Oy2+QD6ZPHgXeT15kwa+WIJWvUB76r3NSyw+QVmHvSWXFj4SQa09mKcqvlwVAT08eFM9EExXPJB2aT0H4Tw+JV4KvoLqNb6ZVxU+ODCPPFqR/L3wbQk9AKWcO+lJFL4QzSK8AlG7PSFwHz7Gydq952EuvnpM0z0AJlm8hdDMvRiCF72/xhc+HlDyPT41/j0ro5m9Oj7cPfsELz4mQZU9BWrVvX2FFj4sXZa90LVPPTDBNj2EXiC+rSfvvQgE+Lx+q9Q9UhShPe84HD4FuTo+2LkqPQLKJL7nzv+94yjWvaj/oDzfgQ8+rsAPvnp53r04FEi9QYYvPkxJG75sDwq+WKQ2voXLu71bLY29uEfbPGCrDz3cQsm9leErPhkrHj7Awx+8nujIvYhQkTzw2fW8WjSFPTBMRjyALMa6bnrFPagNyLyQhim9cbirvatIDj625OA9YMn9O4Dw5DrDWwQ+AKL9vMijPj0Bw+69PE/vvZoryD3sMrK90zsMPoRFNz2mb6u9pOtHPdAudDysBDk9lnTnPZDLRT2ay5U9ogfxPXjdFr6IkWO9RJKCPUxeVD2Qo+k8yAFvPehxCz2gQwW81sotvqm8HT4Uwzy9+DUkPQfE2r0TbrS9gKy/vcwgZz2HVsK9vyIvPo8KKL5QNlg9s1HJvd8qEb7Dofe9oJgQPDJ5hT28SXi95tKcPdGkIb7/Eyk+JKAnvgBDeT3iytI9/t68PQvbAz5KZda9MLcQvQhmc72QEFk9weqpvchp5TyVg7S9oAzhvFAwAL6ur849nLdOvTiA67zo/8e8ywEPPnZEML5Q9KS9SBrmvKwUVD1gLwi+ICbTvGTEgr0AdYa6KUeEvYzJGD1gbiW9AmWzPcDe4Lyi/tU9zFpNvU75ML7hZC4+xPNKPRaf+j0rwzK+/7cmPqCAmbxA81I9YNyUu6krBb7ogi6+6xOTvXql/T2IFkA94/a4vUilAr3wOXe8kAWZvF3WwL3SL5O9jzEGPqzj0b2dT6q9nk+UPTDtEj24Zg6+9YIivkE/Hj59WBG+KbDTvYC2br1A0ko7rIEgPTHFEj7OgTq+zIHFvaGeDz4+8Lk9sIqOPORATr0M5/i9ruLQPTOkJD7wF5U8qmyUPcCdYDwAFjG8MDIIvFQaKb3wMkU8nP5OPVr0r73Y0a+8spXBvbYF4T2YV2o9nkq9vTvxDT6BFr29BIMpPd1EOD79eOu9gnTLPdiFcD2LjBA+wTAVPiP0Er7inZs9xNfQvT0zPL7Avdq9dM1FPQGkJT62jtw9TMHmvY7IOL7YWwK9TQwQPk/UE75IVNQ8AgyzPeaIqL2ibqs9hrnbPbIR2j1pji++xKQiPQBpAr380T49RVikvcpdOL4f0y4+s/QYvvRRHL2HbAO+A08QPnSDXL2OIoq9hiDoPZB40zwWeag9UcGOvXDzWb2Yiq28Yx04vno45D0Negs+nkn/vTG/ET5cdwK9bKeRvUD2LDv05hE9NOeovZvLBT79cNS96XMDPkx5VL3gjfc87Yc0PpLE+D249w69PD1aPaBjv7zHt/+94TM0PnP7Lz6aiYg9QS39vfNRBz4Aqs6980U4vsZlpr0ECAw9EqqTPbjddT3fOjK+SIk7vVT1Ab1qUIg9xyO6vVah6z3SQPk93yuVvYeNOD6j8zY+vAI1PRctNT6q0dI9jSAwvsxMVD2fPrO9vGhJvbBvd7zi8dM9wBm4O8XG4b0Y3yc98bfJvVcpHD504w+9AFutuzzSEj2QrHi9uTknPijLJ71wRgo8EHojvOzT6L0dZAW+ZRE3vsAvET2Srdo9uPlNPRht7Lxi45G9iaLivRwfl72fASC+Aj/oPcfNEb5Qwgy9VO9KvfTQCr4MMW29ifQDvhvNzL3ZhPK9qBTyPP89PD4aJLu9hvbjPQot0z38vdK9984UPuvgOz4THyg+bvT+vevVOT6eSu49DO44vjFzvb2U2QY9KN8fvZb5Ir4W4Ia9sBItvGh5rTybKu+910EiPgkhsr1WQtg9dIgovVzeL74oXiS+ElUUvrzFTz3OoaC9eDuePLiOszyrksu90iqBPdktLz6ymCe+0qyUPXe5Fz4lJjU+qiACvsDvpjzpxg4+oFNgvcakvT01bBs+vhvNPXOtur0wU6C82KhFvaFHKr5sfl89vdMFPnCrOLwuXdw9pHnYvWGyHj6sMCU9kNyrPKTn2b0aVqk9EG1bPTXgEb4ozjO+oNKhO8yHm70syT69S1QwPoKj5D0mEJo9lgefvTK5kD3BATs+wK4ivEN+n720uA09HFNlPddxLb6Axba9Fvf6PQz8Hj1CS9k9fDQjvoQDMT2YM7+8nKAbvZPSyr1CmO49C7uJvZMVy72ZZx4+ICTMOzBoIb5gfN+7YFEavABDHTtQGja85KBnPTy7L70lVC8+932YvQB7JToADFO5UjXkvZJa3j0Acwa6OkS7PawiRb0oNcq84CVLPLj6dD1FHxI+fzL4vQS+AL3yt/c9+BXpvJ0EGT5G9PE9INK4PLJrsz0FXYG9ohGKPQrpBb7a/e89ulK8PYPnMT5gbvS8clTJPTTdOb1647e9VO0QvdIw3j08qzW+wBYcvhmBJD4F8h2+tsjVPa2PAT4Fih0+ahLsPYMVCD7aQdw9hLM8voDwnrtki1U96GVlvbH+571AIbS8Ge3DvdRhEj3fZwg+nLYIvixrWD3ipgS+zes3PndlLT5LkYS9CAGGPKscv73vh829jewAPqOYGz4AwPY8ViufPVIn8j1wjSO+cX4BPlXmmr2MZzM9IBkrvVz+Fz1Vkhk+0Px0PARPTr3Iryw91V2kvbxzK76gXw494K+quwh7Ej2V24u9q2ImPnWDm71gg8281PAUPdJBlT0nuws+NFExPVvmFL63hae9FUowPlLeyD0OyeM9zFVUPbC3bj3cchY90FLSvG/xBT4oC2A9JGd9vchutjw+MIe9gxE7PhReC7610Mi9Ezc5vk4V4j0QUti83DAavbBFUb3vipq9lE9CvSg1Zr1ZShm+beIPPkrHML6d9yM+IUcBvkBodjszhxs+g68UPm7Ipz04Lju+9hUPvqBIhTsp4xs+Um3LPRBnqb1JDvK9KhXxPbB6PjxiXwW+QBEvu7bPmD3Q/iO91GPfvQXjOT7vgc294OksvDhIkLwcj3k9smXrPRZsmD1uTiG+KNIGvpSh+b0ZpIy99kDVvUukJr4EZjU9iljqvTIlqD2Ist88/mn/PXxDRj0g7H69rme3PbAiGr2wrYM803zcvSjF3b1BSSq+99cZPnakzL1C0IA9hGsnvXynJL1C3xa+FnSpPWYb8T2ABe87kl/BPRP0FD4w4pi8RtrqPR+cqr0Vs4K9oKcePSjQcr2eqcM9u1YwvtDxjTxW9Mg94Hs5vOMW0r162Nk9eXAJvv4k/j0vhxU+iEsHvk9e5b1scSi9E2UEPhYQkb2NMjw+hXv1vTARg7xmcMG9aMkmvmAC8jz+c6C94n22vYDxrrp1bic+wNG/PPoToj0reDM+ovCvPVL/171CdgC++GKePDYxuL2e3cQ9pI1zveamhT30jdq99PFfvcct3r2GA6W9ZpKJPdvOBz7CdQq+2EQyvtCgzjx8qz69kHhVPNYwoj0B+y0+9iy8PS4R4D2FqKS9x/LxvTnsJT6AVPy6TLFEPVPYJj7AuKq7N/smPiCpW7zom3k9ujw4vsrf8D01hzE+tRQdPp3/Lj5Qq3w94GPkPOY5nj3Lg629n0AFPvZ16j2iGSa+fI0vvQact73DUxc+FDvOvTKwt71mQ4U9ory8PaVqAT4oU9y84BuBuxwoHL4YBbc83ovsPUReL77g3Am8O7saPpgszjyKHoa9P+cVPjZSzT2HMRY+mEmHPLxuTz2afHa9BccpPlAVLLz/BRc+UKulvThI6r2Ud769fWI4PlB9VD0gpeY7rlq/PeZ4oz1yncq9YdsZvpJ83r0Wqtk9YfcWPlCXfDyugfE9+piCPUV5Aj4V1gI+5LYXvtgC1LwAazY8ad2AvfIvhz0w91u86hCZvbgmSz1Iity80M9DvdhDWr2irBq+8IJZPQDnMDsPjQU+SBnDPCN3DD4N8JC9nFgGPZrcHb5wDww8lovoPVe/BT6iezW+Woy+PWvJj70yPf89cW0tvohiGD1IDfq8z+Q2PqyBML5qnOo9GkeYPXf9H77hwSY+088DPi4U3z2A+Je7xJk+PSAlez0GIxC+FAtFPYgIjzx8A3C9saUkPlAaTD31Mx++yw8WPnB+Nj2yBvI9cAS6vBrlJL4Hdiw+nd/OvUCDDD0xpTE+Wau7vaMcMr4YMQq9hi3lPRdX371NKh6+5OUivniRGT31igW+9OYNPeU1ir0mHRm+hJkGvQA8yzqWnTC+zJ0RvYBp1DuAAjy9QNVou4iIuDwgvGM8J9A0Prg+aD0ws8m8/oIhvtYQLb7hfB6+dOJLvVnsLD4A8eY6JkHAPf5Tt70Iins9HNhEPVJ5tT0P1Sw+cKQNvRBDO76Q5HQ9JlbQvTL9Eb6QFHq8BFtWPUZ1kj3ex5I99ejSvbh0Fb2sTQK+oL3NvHi9kLz4xVe9jBrmvcfzrr3yrcc9S43FvZA8Cr4ATNK6qlLdPa8b3L3Kgsy9fM57PWlN8r3vmi4+fiwcvnexMD6Adfo84J0vvj/gCT6g6Ge9iHgxveIV4z1nItW9KN4Nvkx9ID3vFA4+mL15PbDlV7wMS0098pzzPVaMgT0AQ4W6gFSlPLmCED5Uq1S9/8ERvv/pNz4MjQW+zAzevWaMIr47UyG+YjPvPVcLEj7yQJ49sB+MPJiFoDzY3lS9KOykvAAuM7yR2QI+YOTrPMDJUbsC5d49Ko+6PRgcZr1t8Sa+KDIDvXD5yDymxvM95zmcvZnSm71MTRY9ZrfkPasKCT5Qhb08kmIUvp2LBz7Mgw++SB4VvmGQIr4f7AA+gLWFOxCPOL5Hnwm+XhYIvmjN6DwA+nw6AIWrO++yGL5jTxs+Wn7fPRz2WT3m5Jy9DG0WvQaoC74qXc895MIhvr4ohT24jZk8KHoePXaA/z1oFbq8HnbuPdqQjD0ZRZS94uK4PTd6Kz7nkzA+HpjxvZBDDr2MFU89E84dvvB7arx3SyC+wPtivFRkeD1kmUA9TqrMPXt+OL6w8hE9MO+3PPgbvTzg2ds7FX4vPj7fDL5f1oG98fPYvbEtHb5j6x0+QC2TPPgvH715kyA+tAc1vsvUFr7QSPu8K7gjvvIfEL5ZScW9Ou/XPZZp/L0AnSq+tXvwvTv0Jj4H1xg+iHs/PXKxsb1x1wm+4JVZvToarT0ASoM9QsrQPXUF4L1NiDo+bwY4vvBVJLzVDeC9QJgYvRuaJz7zYgc+3AblvcASn7wdrwE+3hiqPYwEFj2Agdq6/oPtPbyXBL7qV9w98FZ3vD7Cuj1iJpg9SM9sPabzoj0qt4Y9ovJ9vQLOzz1orsC89F1+vUC/cbxwGP69x1jWveZ4gr0Arvy5UCwLvJYG4T3wKRQ9PQAhPh6m170w/Py8Igu9PdhvEb5APeS7ao3hPZTPD77KBpo9CNeVvADEZDpknDi9eDHcvEKm2D3lJ9W94SMVPoEL3r30PMC9KDiZPA/iNL5tACc+8g2TPbGYNz7A8L+7AOspu4ddL77Aftg8ALbMOwDD/LocWxC+dGHavUi4tjyObr89mgI2vtGdKD6QDgM9Ru/hvbK+sD04bZ28GHMZvmY3Gb5P5yO+EP0PvRv6KD4WXMO94iIyvtg49bxQZj+80LJavdpWxz3tINi9AO48O0BTUDs5Zo29XAwOvoCuprpCHSW+wNOCu2a3pj3r/Bg+UAAAPMBObryGKxq+C5QSvtqrmT1j9zM+9mG5PTpYNr4kxg2+4xgVPieMpb24jcI8OBKVvKPrMD4AedO6s5fLvWrw/70KRPw9z73wvT12jr0ApxQ8iKEdPeKEo73qnJ49Pi3tPQtUqr0CKxS+4EjZuxsqEj6wmfC9DFQAvf/FBD4iqzC+b6LxvfDq9zxQzGC8dJhJvYPYLD7g0yK8YNLcO72L2b2XZhO+eWwpPmOyhb2wV128kLkVPEx09L2A8pO6PCgHPbA1abwFGNC9v+kEvpxgQj1u8Qu+ENTBvMHZm70xqTi+AG4zveAofLxbXCK+iReevZgMi7ystOy9thz3vYzUDb2AVxW92FmaPP6Y1j1KF4o9gK3jO4Umkb33USg+qlaPPZcYLr4QSC09mAoOPey5XD3gP9+8htD7vdCdBrzkniu9ife4vVIRtD1tMik+5XywvZ4S/j2jRg++B0A8vnFKJz4i/R2+MZynvVATBDxYZQy9ABdYvNuiub2XSDe++zA4vpjt+bww7Dy+0Kg9vd2XEj77xC0+lLIXvjYdrz2AWju+Bl0Ovsbq6z0w2gw8ud/XvW/+JD6VnQS+fTkGPrYd7T2A9aw6kmznvQByfzrCMr89WQYovv+job0R8Aq+uAAHPRARuL24bAq+DnyOvS/ENr5d4gQ+VzywvWWMD76Xn8u9CAekvGmUg72hbJ69Zv/nPagvG77nchI+PGsHvohZgj3AWqO8wKNzvLl8kr1cDX29AJM+u6ClzDzWefQ9WMGhPD5vzD2sQQi9Yl3nPY7Zij0EDCc96LooPSigVb3ALCc7YG1wPUx8qr0E4De+tU4bPpCRCr2xRyQ+xcMvvi35NL4MimU9QEzfvPiexzxGlNs9OGtiPaCR+buwn5W9K4wOPlxsF700Ygq9v2E4vnKk3j2bFwk+E6bUvar+vL3GPI89bw0WPqiXcj1HCjY+xUUTvtKh6T03sh6+8OxGvchVm704dEs9pCjFvYaGor3UAXQ96y0lvqNRBj6DtyK+dQk0vhdFJr70oQS9g2AfPkla9r0e0Ig9eWwtvpuLBD5WrQG+pto4vpM4DT78ZRu+5/81vg67HL4JkAW+APw6Ofwscj2aBf69uP/KPM6ivz3R2SQ+B8LFvTdsCj4U+8+9oIGvPNLI2z2IzEC9WJKrvBRvH77lbDM+cHoNPAaxsT3OjME9lBdivWRJHL6R+Tk+uScKvp6Jlj2rgBY+kEBgvRhMlb1kW5q9G+sDPiQhUD13CPq92FD4vA7u1D0BmRw+kHoGPORoNb6AI+69TXjdvQDDbT3Egpe9zPBZvRLHoT2eSuQ9UKipPEfQAr6IRGe912YEPpwKQr2TiCe+DEkTvV7C2r2Mahs99Am6vYBX9bzgJZY8UId4Pd5R+j10F+m9IaETvuQ5QD2sBfy9puinPQDdJbzUlg6+hGUcPc/yPD7gyO086JwXvl7GK74MjBe+diT6PZ5RHr6U9Ca+SKYjvmyFI72KtdU9cEgfvYQ+Kz1PIxe+YMisu6BpML0NgDi+x4gCPpyTST0K4LI9iqgRvpcrDj5UMhg9q74yvgF7Dj7gJYw8hFsIPd6ZlT3zvMy9vTu1va40oz0E9ze+SGhDPY8mCz75Szk+SWUiPjzDDD0uBtw9J+gevrBRHL6ObC2+LmmTPZG/JT4a78y9HjcjvtD3hzwnKRY+yhR+vTy9cL3BETQ+WcLSvXBx37waGu89EOCnvJEiNb5UDDs9eLrwPBshLr44d5K8CGK5vOAAhLwA3u85HoDkPWl/Gj5h8B8+Ct/HvUri3z3VMza+grb6vbTVtL1NgiU+1NYovoPkE74JAho+wONFvRaz6D3/eBQ+EMnUvAnmkL2O83692xL0vc5kn70MuaG9YjiTvVhpo7wDT7C9wBm8u5MMMj7AgDS7ABBvOVVWOT7YYf68OkD5PXPN0b0a/O492IqpPERqJb1KF7c9dKplvYxeej2DxRg+JDxDPSYUtz3z5tK9zHZqPSsiGD7YMDC9ARwqPsWVFz7r8xE+vLEKPTMEFT5xABI+EOHLvFlRBz6Mcm89WEb/vWhrW72F0Aa+qe0oPv5X172NNxS+ICPWO4C+3boQBVY8JkH9vcD+S70G4gq+BMPPvUoK8D0EYny9AOk3OlZFib0JeMO9YAHIvEjfI72sJmK9+JB1PZi8vrzSsI89qNbBvG4AlD2A3EE9gFG8OtZS5j0KLna98ak0vs6xwD26Ku89vi3CvfDf/jxwRq08RJ1LPdk2qr2XbCg+yMnJvb+NOD4l7h4+iSA4PoDuz71OePo9Qd77vaqAfb0Yc5y9kJA6vpSuQ739Bwc+sBScPPRgfL2wXge+3OhiPSQTHL5Da6m9dINFvSutJ764+re9Jqe7Pc4HuT2OKd89fBgNvaEPIr4FsNG9OHgIPTiAxbwut5g9AOZaPZcoOT7A9yg9Yxe3vR6yoT2grF28zgnxPQflKj7Or4c9Nes4PjChE74Jzji+G/MzPo92Dj5SNii+198qPnnCIr4Awoo7t/okPuEy3L2R+MW9KhKyPTq9nj26dcU9MH8TPWCTr7t74io+kdgaPr0iBj4Wzos9oHZ0vNAj7bxUB2I9YDzIvTZZGL7SYt09FdcEPkVdBT55WK69fVEKPmCalDzmCMo9oiwUvlti2L1HZ/m9lZUivvo9tz3X2Q6+aNsove5egz3I6WM9xOFAva1BHz5nGOG9GDduPYi+zbwhvsO97VyCvdP4Cj4ASTi8Ki2KPcq0Hr5i3zO+27chvpy5NL3IHfe8FDcqPXrsPL5FF7i9GnDoPUdRIT5jbxw+4HFGvf5g3z3YlSQ9wgGHPe5Xlj3PaB4+4Nl5vFT0hr2woFS8fFNnve8jDz7FXge+RheIPcFwFr49iBM+I2AWvoDkILzpKxA+IH8tPdQ6F72Yjjw9gMsaO8k/0b2HEh4+UDIovFbFtr3xLhq+qWI1PvASrbxZng4+H2KAvVCmYTyQ0I48+scJvuCSmr2ykxa+VFsOvjaWuT2ZUd69Os95vfrfLL7xrTw+oprOPTZUOL6rMAa+e3r2vWTgE74Y6Li9ILQ0PRaelj0XVr29GvqmPTR7hD18mqi9K+4xPk6x4z0YVXY9WBMLvsZa4T0gFrC7rDSFvRMeD77vZBs+QKOFPV5m2j3SO8q9gAIJO22Ojb1YAhG+SnAYvgDGwbm60Yq9Uq/fPSBgZr3e6cg9OCMRvnLHKL7mDfY9w6k8PjzBKj1TPb69qSs6Pq4Y5L3gcW88NbYFvuo2s73hRTI+X9XCvbBDozyoBz89g6CkvUNIAj626aU9kJQdvd6VLb6yBc09AMU/up2ZIz4weAU92OecPAe9O77Ghbs9O5/uvdgrxDyQV4C8YIcqvstBOT7ix5k9fu81vkCE9rswNTE98IoUvtPvN74mgf69xDz3vd3BOb7YeNI8hARYvcir972g7us8FIkIPTGkO75Yq+C80G/Wvcz0Mz15jBc+IPxavEi9cj3IUMk8IG2uPNpxEr4H/zY+bLeCvSrKrb0Q8Rm+DCYovtDYQj3cChk9G3ACPpHFMT5VNCw+IQklPin3DD4MvQ2+THeSvYDlCrtSmZo9UCCqPNONE776ecY95XAXPiDniDsirda9jIxVPeBtSbwSbLQ9PPl3vbwpND1lVJ+9g3UTPsLztT1gqMu8XsWGPXJNzz2Sbvo9ozQ3PgpP2j0qXvq9fpf2PVpdxD31jiA++w4JPiP/JT6thS2+4s/rvSDM4b2J0TW+mOzmPMDIBTvQWl28YGrwvWyQBL1JU9O97As0veK62z34EFy95qHDPYDtm7u2J9Y9USgbvtD+szxIVjs97CHNvfyaE724KnY90M4xvvRQX73gR3A8gEWCvdqLK77U4AM9ulyePSwHJz1gdj+8xJc/PURyHb1AgA87gI54u+DbX7xJgSg+xOl/vRnJDT6AmjE96InXvFa0pz1xEsG9eMMSPeiMqDzSCI49xeyZvd91Cr6IKcU8FJUAvkgH9TzIK408HJFcPY8jI74mQKU9eHQ7Pc0a573eQu890KzAvLjM8r2ikuS9MnHcPQmSgL1NGBA+79YjvpKd8z30jkk9saYuPhAFejyIUJk8CuyHvZNcED72MxO+wJ8ku05vJb74/Py91jOkPfgrwL0UHrq9xcMGPlOlAj6G7Po9ABOEPavoID5O8uA9V1EiPjwjIj1Iq2W9MCQ4vXqn/j1IFDW+rMBHvY/CF765ZL69DiqCPS/lO74gyE081aM8vsfXNj6N7xi+vA27vae0AT4gISg8QBzDvS/G8r2gMoA8aN1sPXid3ryg5po8SNdTvdeHzb1jGci98E17PWsqAD6Q1qO9US0VPg40qD3DODc+r2Amvuh+7LxQ39Y86nK/vTgKEL0rIhg+mNPJPGBlmDwo2Qo9zjcRvphpZb3GQNA9Rzolvv56wr0YZvi8rgKWPWAzAbygmf+7OkHlPSg+vb13hhw+ZdwJPiCQXjxGiZ29LkS1PRDi6zw5jg0+8DACvpWeDz5IQws9CU4SPjF8kb16ePG9zFo3vVgTI75GCK29gDDau9Ba9zxAShi9AHzBvKn9Bz5SiRq++YguPtl3BL7gyta7B2HzvUI3CL4Acbq83qkRvi+ZH74LPCS+zRo7vrpY0T32Pg6+nkA1vpFcoL1yNNs9TlqoPeOkM764+Ho9/qGePX5q5z2FI++9AE0sPbM35b346iW9djDBPXjlOT2wrzm+oA7lu/Kbmz11rBk+ccICPiiP8jzvPwu+O/TxvYPZFz5Ij8+80OC7PCRhdL0Oj7c9QlTPPUBJQr3WdBe+ACFhumrD+b0bXRI+os/TPaCDObyaWiG+eMy5vQQ84r1LWTQ+i/v0vaz+Nz2A6KE7oGrgu1sSOz4LYu692K63vBToaD1UVRG+UK89va1GBL5vfC0+N7oEPmoemT0YIUE92O/wvVEEwr0AifG9oKwbPLc/ED5XFx6+8qjzPfJlxz2XBJq9U8oSPsBaPj29zQQ+OPpLvVggLL76vYO9wZ05vuTEcD0SY7M9ZhrNPQY5qT3geVc8VrjtPRn0Fj6IeYC8+LNMvXP4nL2gp/A86vSxPY91Hz4BjgS+BFU8vsSZKz2cMEk9qY8Rviir47zgc6C8KUogvro1xb1zhB4+1sYivrapkz2wrye9oEqAvPiBZD3Q1uO8QOHBvMEdHj7u0cy9VfoEPix0D76FHSE+sHvQPMBtNjyexJI96eQ3PsyFcL15SSg+p/s3PvBPTz3FuRI+EYbLveZY/z1w5AK+CywZPj3C9r27VCI+DvDwvR+wCz4Ai+48mJlpPQiYb70DTu29oA48vpBE8Tz2e/89i8IHvgKplz3A2D28whj4PWi6dT1eEdm94GaQvJlCLz6e09I9mACDPNY9xD0MRvO9oEBxPI+OOD4K8689HBERvQqO7D117za+yBkPvtihK72YDE+9XKoMvYLVmb1CqhC+tfkePvNvKT4A5y27rqyfPbtkFb7yc/y9ct/fPeuO3r0WBS++zgWsPZiT7zwTpA4+pF1jvTWqOb6rWQw+NeALPuCFqb1yQ+09A8+uvfY1Jb4INBe+EdwmPqqOF771kze+SySrvbIBpT0G+o49suLfPTFlKT5VaRI+nB6JvXY5oj0yoTG+DKJlvWwHDb5q+xy+gNG1vTZRzb3Iz5y9nlutPWTNAD2Ac1A8ICkGPHojuj1dqtW98HBdPUCaIDtWSa29PpeKPSq7oD2gfXO9Es8uvhrUnT2liiA+4uESvuhAMT2w+GS9yAbJvZOWIj4G/fI96hYcvmBnar3vxi2+xHoPvbTeaD3w3lC9R9szPk0fCD5lmYW9l/GlvdZxsD0Mtw89Av8Vvo4OrD0Rly2+IFbYPC9DKD74MEC93RvpvXq6nz0i0s89nB4nvbMCKj6GJom9UwUhvnyeyL0ATHi5wDqqvS1FNj7PqSI+uAvcPIo8lT09RZW97cnCvXYiPL5Q39g8wqubPYodmL0DQjU+oCEaPaBtIDxMRlE9pMAzvpDosLw8mDq9IjitPRx8Fr5KWXq9S70EPoUvBD6I+dC84PjYvD0gy71ArGa7Hgl5vQDMlju4lfG9YB4MvKnzrb2haSG+pvl1vaVlKb4gCbw7BJ0HPeBscL0Kk4491n/OPbCyCjxG8949wAMbOxCJ+Lxk0li9Jzo8Ptt0ib30wmY9+8okPsJg6T0ApM25yQUEPpDBJT3gAu87iFQfvYqzCL40NWy9pmfoPQj9BT2I7Dk9VlqNPUCvkTwwDvu8hPAcvbD2JL6gyUG8gA17vaDfmDw2/s89kljIPZ7SIb6+YfY9exsIPlJk2j0AXwE6Nlo7vni5o7xQcmW9gTYNvqgmJb2wPjc9BHQiPRDaqbzgn6g7YvOHPb0aED61VLa9XK4jPeTJDb4k6Qy+C5oVvm2KA75wzHC8xVkOPgsYB766aCK+z/sdPtyOGr5dzxE+MDIoPeBZCL5wQds8AB/2vDb8Lb6C6+m9uTLPvXknNb6Wlvs9Ek2yPVY+ML64lFG90DoqvTDedrwgYpA7gveTPago2b1Akv+78haOPSsOEz4usru9sApJvDro/j2HS9m9/vkLvmDr/bwWUJk9NA5bva6Jpj2N5Q++I9OIvcBHM74A7PC60AAoPCaI7b0dPgg+Lq+5vc5GM77SrO49JfAwPsi7PD2VqDI+YDktvnwYbL1T3x++dv+nPVjW8L1Y4hc9JBU8vamOHD7YHSK+VBU5PQw44r0HNDO+Cm3XPaAd0r3vr/a97RcpPnr01D1cnHC9EQsMPsBGLb78gls9LgDSPY6LrD0gNqU8Tm/jPWwBpL01NjY+MX/0vTbQ6j0gdpy7CwObvXdnJT55KS2+4TkjPvDQy731hey9gGG0PEQWNr60cHG9pLRrvQDmHboiWJ090lS2Pd0bNr6XTQG+R0oxvuiyxDzXJRg+qjmcPdCHKj3c8/O9GeENPqbx+D1UVPm9TfY8PvgzRb0cObC9ghnaPaBTXj2aKso9gL/lu6aJ7b1oypO9uuadPYw0G77QvQG8vliUPXuGmb2Oy/g9IjatPedzKj5g4Sa+xXgzPhzJO761Q6G9GYMwPnwwDj32V/Q9Tr3tPfTCbr1g4ZO894AuPky1Az3sHkY9sXW0vWaPlz2iG5I9ACh7udBeOz2AvjS9admSvfCUiDx4Jwu+rs70Pe3uFz64l4Y8MckyPnypAr2eosc9OIohvXPM4r2Mdiw9X3ABvkTdaj3Iure8maCuvUAEoTt45BO9pCM/PcJZnz3wmzS9PY0sPtUl6b0EfS69zkXdPdr3eL1P+rC9+giGPVCWdD2CldQ9EIsxvviuir0+6ug9MJZYvPI1wT11JA2+ID+/OxBBSjyQot28g+MyPgOJFb7BfBm+5lrZvbBmBL3xxRE+gMWnOqaf6j2V5ym+CMSjvTHC972Voxs+AHOKOoyaLj3cwnw9WAorPbFKOz5fGxM+OAI7vT7QCL7Actw85IdMvYLC2D3gITi+12YuvoJ1sj1gUQw8vi0avp78rD0AjI06OmTRPTpVxj1Xuzg+gJ9TO9uuMz4ZGiI+JG5BPUTnBb4BIjQ+4P1hvJ4l6T32thi+UPdjPRowi71h/gY+AGYDvdRMJT2YH6+8ZGA4vTaE373qmTa+V0kiPmSsYL2W+Tm+6mz5PfC14DwgbUM8P6ctvuRldj0Y3Bm+TG5nPe7Jqz3qzfE9qKfKPFmlib2zFiu+io+BPRREOr715DK+kDWZvVA0erx4lHw9cnS+PY3XKz7AMvW8IEnzO9aM7T3oxOk8QROzvZoMvT25KpC9SZuEvXCCZjxnQxA+0HwPPLiiLj2c+x++KFnwvMkgqb3A2TU7/9I6Piu2Kj6kz3o9koXSPULMDb4gjFK90P6/PHmXJD5OcrM9LJJVPbBTZDxw+E68/bKFvfcrLb6wVYY8lYUtPm6R6r1y9IK9EgCxPZBPSby6gLo9k3sEvqfS7b39VvK9L54ZvpCSWTwZCzI+eKzMvSuXOT7IW7C8zV/GvSgpZT0I37k8VwUVPmXcs72JyhO+WF0tvQDo4LofmgA+Rhg1vnDlCjzif3i9HEQbvaY0ur2XyTk+Y5E1PjebOz7g8Aa8ynnyPRzEX724iiK9p6AjPvKDoz2qhPK9UK/kPC1b2b3bOBO+ONEMPd6ChL2rZR8+JycdPmBsS7xnWTg+bI0MvlM3CD5iv+U9+nTjvQHGNz41Ehe+dDDhvYRsUL3JZMy9QbgAPpdnBj4oVzy9QA6xu0CnjLsxrJy9UGyAPNJrkj2YMr+88DwavpWAHL4CqpM9rl7qPTjm+zwYYjS92Lw9PeiAB76/ehu+MFWTvUgAPT3qOsw9IGb5uyoDvr2ga1G8fF0UvrJZ6D0Atj+76bIxPumQoL0rtC4+r64wPjo7h71A8AG7io6UvWzjRT34S7e8qHeSvLch/L3qFbk9n4EzPln07b3RJgM+bgSNPcbZBb4r7i6+s6grvoB9EzsQNMw8CE6fPLANEL0Cfd29AGrDu5scLz5lWQo+l1oGPoB2Ib1cDGq9gtuZParr+r3AMve9sG/OvGMzKr5HlSw++vS7PZ1IGD5YC8m8UNZTvYDA5TsAEoM51qx+vQCFV7qo/Ao9E4sCvgBT0LweIjm+S0EOPk3V8r0BrjG+VgzbPdUZH771ywu+sJJavTvFIr4gWrc7ElW+PSrC7z3KSe09aHLvvWkkHz4AWVc7+M92PW53fb0QcTy8NLt1PWrNg716WNm9W9o0PgIU0j1riwg+l4GTvUcmJD6lq/S96MmePKm6ob3r2S2+wF+sPNpZC77UuhQ9RY4zvrfUOT5uWZ2933QdPpQ2D71jyBM+qGk7vbhFOL6A3788oYcovrAZbr15twk+z9O4vW18Iz4Dtgi+Hi2+PYfUsb2ISg29ntiuPeDwYjxXYpO9RAHKvWvOBj4S3pA9tAoKvq40oD3AzUy8RPmBPaiovbyiaOM9L+atvX4LyD1gb0Y97YkGPgBAp7yhhgE+TketvTZuIb5x0Dc+61gdPngYKb1rQB0+9oG8PZ5eEL57gTQ+WB4OPWBtED3wyEG9SOr2vE673j367ME9Qo/NPfgKyLx/JhE+1JojPYMwGT4F3RM+/HJLPUYDHL7B+O69ELtfPX4Fvz0MQG89rrjKPbhog710gue9iAD0PPT4KT3474e8dLtGvVgyhzxIvpI8q2EHPq8HFD6N1g4+lj7+PdaKFL6obTa+tt7cPV3bJb7ep9A9EreRPSVRAj7asJo9raM4Pl2SAz7wouQ8n4UkPqjWljwaTr89rkH9vcCyRrv3JS0+DpWMPUShbT1UH1y9WObPvGpV6z2WKco9UAgevvf8FD4Thfu92nTLPUhqoLxgFGy9uorNvb50rT2+j+M94JGxvF6f8j38Pmc916UhPs2/GL4klue9bmfevQBBwLzsdbG9qj2avY4WIL7EZiA9yH98PYCtirymfog9JuXcPR/G5L2AB+07khraPVFJn71Y6YM9C2kzvm9z1r14OOe8MY7KvSNbAD7tazU+8PxzPbzxQb375Do+cOktPdmkqr0wd8U8OBpMvQAECL3ZXQa+9ZsYPn/eGL66Ezu+bO4hvbClDT3QIm48bOQAvfJ76j09kCk+IvruPUgxzjzAM5Y7fnDAPTDRDzxcv2690dA4PqhUxjxKX6w9/3IOvmja7TyQBpQ8UxgyPqoJ/z3AK0089UArPhFTur2W6BW+QLEpvHgLnLxEklE9AJrcvdTWC75FDgU+8HEXvf1NKT6yvSa+224Lvpfeq73S6869qZ4OPv/2GL4GeOs9spPkPUAygrwykJ69kaYKPscOhr0GB7k9fHjkvWo+AL40ZCK+eDz0veAi2jxr+N291F2FPcgofj0HOCi+PMX5vRgLDb4SloG9M2sEPhqVG76YA1s91JQTvvI2mz3YMeM8yiahPXiWvjz+K7s9c60FPvkbLD4KFp49NPIxvRAEtLzv4iO+E84YPmFmBj7hUxY+wF4RPTiEDz3Ai1y7K/SEvcpq5z35awQ+BcUUvvMGDb5sSDC+hHYJvRpK2z0H7Ze9LDEkvTO7E74Niee9DdoZPiph973rBRW+BpDiPSmKNL7Wadg9aQYcPrCw6TzueuA9UKOhPOj4qDyYfPU8eNChvIbqoj0kD0c9wKcDvtq3jj3DLBK+Ui/lvcM5nb1AjBK8MO0IvFyzED2A2YW6p4cpvrJvsT3lWjU+4wMYvgOFjL0UUAA9Mvw3vibs6j2YlIG9As7NPXpM1b106E096woPvu1jC77qIpA9cnMUvj9AHj6anIe9GKQ7veStIr2g4si8hPKbvc5ECb775xc+IIIwPYp3sr0gc8m81FJ0PXtKkL3Z6wK+wKVevR1xD75EGS29xIqAPWQdYz3os9e8QLc0PFi2jLzKMZE9XRsrPi5JNb6nXu+9+FSqvVLE7D06AIs9MEc2PAfrsb2YfCa9OLcsPXj5gDxarq49kOFZPQspGL7AvSM7CkgGvm+FFj41Chu+7KINvR5Wwj2AKd479VkKPhvfFj4gtKy9DF4YPdWkAz5Yp9O98Gy9vQ30Nr5JRyG+rykGPiBgUjzgULq8mtXQPSDrxzyAgLc7wAWQvKaVD76snVi9WqigPYKYx72vNhI+pmb9PaJrqj0QYUu9/iOxPSBwgT1bYii+sf2OvU7ZrL3EKgo9BCZivSryqr36msm9QO4quww6vL07Vhw+t6YDPs/q+b0BGjo+wP33POisUL3JIAA+kV+evYrL7T1UE1w9Jpb9PQfVBT4IZ8a8qlbJPURVJj3wd6A8sLETvQAS2DxOpv89VoHIPQmJrr0hCAQ+YG6nu/4c4D10jxG+frYQvlZjyT1qi7I9MKANvqApGDxj5fe9MJF2PfDdBb4v5Tm+cAoAPKhz6b0A1Xo9lk7nPTc+0L1cYG89G0wnPhAYpr1u6NE9RFg/vcCXkzvLVC0+jiuPPXSmRL2FTTg+8Bo1PHZk2D1g5GG9UK4pvdN8Lj66/p09oJiNPJwFcj3kyDe+I500PvEBCT4F4Qc+5F8SvQRGT72x7Be+2nIBvj1IFz5+FYA9V+UYPuyFNT146xe+1P5tPWZXkj3YiLa9HPcrvcBUGzwk6QK9DKCrvTBnQ7yGP4G9eyk0vtVbND4I3q+8ELIAPagjqDxc9B++EGU0vkwPyr2+67a9LnwqvoC+Mj1WvOk9MME7PayaDL6sGTu90H1cPMSqe71rYxE+mo2zvdBGKjxwRza+AycGPoLHpT28LAe+kqTZvZIdG77TPAY+sOVjPCDjqDzUjem9CRkBPtBbRr3tiSQ+2XQcPgAA5rWNF7C9asD6ve8IID4UzmS9WkLJPRmMCL6gC1W8HiaiPZrnjT1Qy7e98QYIvrh3Ob47CrS9Za6GvbAfibzdfs+9gHXuvV4j0j1k2Qi+6NzVvHD44727XPq9KqzTPVA/DL4I6E89IPDHPNd/kb2piSo+H7YxPqPtgb0u7OA9vJkaveoQoT36hro9AP2vOrzaBz3OrpE9lqaOPTl5sL1sHjy9fKMAPSffMr40HzO9K873vbwPn71oTzA94mizPYcZJj7y0PM9C2AoPuwQcD1gI4y8ICSVvPGJnr0TFCA+epokvhhArLxV/Lu9DDdqvRA9zb0xcy4+XCEFPda1mj1gLpc8LOVbPYCFYTx/HDi+7l+nPVYg4D1yxXS9JlnePVxBSL2qQ5U9VkCGPcg3GL7gS9k8Cg17vSpklr1L9Mm9//MFPrZC2D2+r9W98pOyPWiB7rwS6v09sjb/vc+3LD5IKpO9Y/IgvsTPvr3QOS089cnevVDAAjyhgx2+KhA1vjDmAL17OA0+JgvzPZ4gsz1iMaA9cnS6PWkEHj7slrq9gA5fOwtIKj76Zsm9dVjTvcwZNb6AEz87VdcbPgL1jz28NxO+YBvuO0YO/z3IYAe9C2uRvQCzArpyqaU9NBkQvl5GwT32IRi+nC0jvioojz13uQQ+yUs2PpYSqz3coWy9IJCKO07VvT2j9oK9xhO+PYCSMrykvFU9bTC6vViDy70Drg2+sBzXvGDGRjxgquK7Nf4CPvNfBD7eOyq+9t8evoe4g72BTq69Pe8HPrY2oj0wly694kPkPRi7ID1vAAE+UN9YPa+E+b28YTA9zSAmPvDQLb5aeLE9yIabvYjOLD2QuAy88BIpvohHYL0QbzU9/JpyvaunLj7gv9U72EBnvdJl/T0RsjG+wAw0uyCcZDySjh2+XKFnPXjSbb24jAA9tO7Xvcpcsb10bkk9ZzgbPmIBFr5xm4+9rHcMPbegGT6jlDM+S4gBPgBtbj1SebQ93ua5PcwWTb2gG3q9da3YvQBn57zFdN29oCeyu/E82r1giV08mp4qvojYOr3gibE7AFRPPLCoAryAmNk8jFEIPfCghLyKMjW+mWkAPtwypb0LOgC+vkzAvTsQ6b3jkAo+q8Aqvi+Wu7242WY9Sx8aPtnTEz4gFXA8D8gJPlI3Gb6wNXu8ATTnvTrrk72tzB0+Sx8APgW39b1FdSk+ONTSvEprlz0Fgie+sBvIPJbUlb0GLOk9vrC+PaJeiT2UaR493cOBvegbnTzglqo8eluzPfDIeryyb909Vjb0PaZ3uj1e0f49o8TGvbx9mL3qdPg9PJxWPXGcg72efZE9mQwfPom1qL3gRnU8UoSMPVkMKD5i87M95BxSvQttKz5jkjy+5qsPviBtzDzI09k8iPKmPMpl4b3+iu09rFaFvR4ekj28Dxy+rH47PXUAzL0Saag9qrXIPQN2MD4WO7s9mgjRPXqmD74w3388RqWKPYRFOT0wJd88FdG+vbJwGb7K5e49nElnvWFCJT5MDTc9rqO3PTCGeby43HA9EJsLviL3nD2Q+q28POsEvpBHEjxAIGU9QDVRO8D9TDxWHMw9P+sCvhhyaD1A/2q8FLZiPZVqAD7CRCe+4C1LvUvYDD6VP5a9zXkQPnAhJ7xuK8k9VqfvPYCNcT3A2SG9ZycgvgDsX718Use9P10ZPi4LgD1fbRk+4EHqvQyiYz1ueJA9kcDWvXR8Oj3aiQS+WFl0PZjg0LwAsis76DvVvVAJ+7z6Wdu9SDw5PYB0/r0uB8K9+gzEPUA+2Lt6Ssw9jEPUvY7tBb7ek509cDmxvO2BFz7fgSO+JOxmveEftr2A59c6SQ8YPkpBlT2hNxo+iLHVvFBZUz1K3Y89uDaWvaDcVbyzhZe98geUPVJaF74Rmiw++DUyvSrd/z2wX0g9BEZavfLijD1o7R89WfadvQpj+T0uAZQ9GJAPvQB/rboAg8e6HSLuvRgnQT1M9309emIavt6Yuj2C+aw950A3PiYLdr3ycPk9DNJzPQjf9DzwXT69XOBvvS8B4r0a8su9ouqtPXgmbT3Oerw9tg0Rvu5xuj3Ins29wJwkO7poJb5iNh++4Ay4O0RICT1Abj88fgzsPQN+ET42IKU9NKlpvd94ir1DQr69fvCLvTkZMT61si8+2tSsvdUGwr0fySK+5s/pParijz3ICDo9RiSpPSBPMT2Ktpg9x302vrgXYD2URxe+z8I8PjqEjD1IooS9gpWePRTpdT0gqQO+UpbnPUR55L3TmZi9DuoMvrCRPL3t4oS9vdwHviRKOj1o76A8a60vPgBE9DwqGqO9thyWvWKrNb6z+hu+HF0zPSBESzzYPsS9ECagvIzDpL1A0eK9IBAivaktMT5ptwK+AA+Bu5gVvLxiQM49tZokvkrJiT3d8S0+8TgDPl/oGz5nYC4+GFiVvEA0W7woBzU9firgPZjwoLx16RY+JbU7vlntFT6QdC894OSgO9jI+bypwfm9biA6vgWDnL3gUqk7hIk9PcVBpL0k4jS9Lsvgvead0z1//zc+qiSxPe791D3YX7o8gG5LPWSAeb1IHBy+ou4Tvvotj72wgXc9Nsv9vXtTi73Ys8c86I2WPAKP6L0WN8y9qeQSPhA9ezxA+cw8CMDKvN0pyr0WBME97RgQPnxKdD1gqCc8WC/gvW6Hmz1lmBG+kVsePigDqLwgFc+8RHAyPbQ+m73Z+jG+m+c5PkGtB77XNu+9WC/qvI/pGj41Yh8+aHD3PC8WDD4T8iO+2tyQvfDjSDzExW697PGOvYDesrzY7pK8ZuOgvVG1CT5Q23W8CWIBPsZniT1JOAA+BMsuvQc7D77rKxa+33ysveAhnL0mJIk9cQMdPnvEur3Un309ABa0vR737z0rTOq9sJ1BPVBzYjz5gjs+0wM3vuElLz61RyU+9t/HvcGbKL64bgk9E4Y6Ps6Vnr1GCcw9XbsGPiC6B7wN4i4+DJNpPTPBKb69aCa+eYUnvhCtLD3S2Qa+bIslvd6Z+j0TnKu9bNIMvVfoM76KRXW9EC7qPPjnDr0BySk+NzYpPsVyBL5uArw9KECxvAAl/7y5xhs+RJUZvuB5STz0UQi9/0qwvSzWXT36Lbw9cHF4PAv1t71/bAI+15WHvSAklLvdwQO+ADAhOvNUAz6QtPi8qXAavp7Hvr2guci9oOe9vJUoHL56wgS+0OBOPAkD271gbOE86+j3vTR1RT0jQqa9iiqFPQDGSLzfViu+71DOvZLvub3E0E49AOrfPL1iDD6wjUo8A6E1vr1CO74cOSW9eua5vWSwB74aIQS+dmqdvVE8rL0ildK95vTHPX6PrD1d7x6+9SYXPlQINb6Y4ew85AE2vdjEfT2Biou9W9MgPgjl3DwGCf89CO0lvi20KD7X2hW+tkbEPQYr7b3qX/+91q21PVcHjb2Lxty9bGxIvZA97bzRLMq97O4mvnJsOb5jIsa9PPPEvaDp/Lu8VNy9p1Clvd3rCz79Oau9PIWcvT6XeL3hzjQ+OEikvEA2273rhiU+7Eb8vaY/9D1HqA8+lH1lPa3OBT68A1i9K7U6vmReVD0Lwqy9SmubPSiqorz/h9q9xOmkvTKx4T0R8xM+7i69PdSHB76fCru9eDCovMygAz39Uwk+EBZHvRAfU73Y9vc8CiGePUY+4T2QypO8KK3pvKCUjTvgYaM8UaojPutSNr6+vKU9zlUJvnCVJb3wrau8aHObvLapGb71Lg8+flK7PThX+DyftTG+RPdMPcboOL4kRCy+h408PkBfjr1ADNo7WgOLvbtJpL0Aaog8AHahvaBVHjwJe8m9OeMdPhuEEz7NNSk+gHU2u+E0Hj7Kf9U9EClqvcF9H74cfBe+somZPWQHMT1Ibzq+cJKava7+M777/x6+5HEevrMTEr5Omyq+jQYzvrA+wjyWzIQ9Nu8qvl1jIL7M6yW+QJOqPFYaD77/ZYa9FrCsvceTLb7OYzK+4uUrvlziUz1QvMe88kkuvvLRJb4oLku9TfUTPnAgl7zWu8s9oBPnvc1FAT4QVTq+iJmZvEBMVj1K2v09gibaPdBoab28xDs9pIafvZwvFj1gZGA9YFvhvEa43z03uhQ+YD1MvMBgpjzkpQm+lpryPaWXMj4a3oe91Y45Pu1iPD79Aq29u4qXvW+CJj4mjKc9S8ojPgCOJLv8Kb29xpjQPa9hGz5vWJ69SLWovcod/D2mO+Y9ORkDPip5zT1huiU+PgiLvQostT1yl5499D0rvXoU4j17rDi+MAonvNmUt72A6UA8AU4FPhDzKDyqsrg96QMwvvZvvj3Ah9E75NzNvdpGmD1hSBG++nIIviCH7zyiUNM9qzYjPm8ptr33Cf+9DmD6PWJYDr5UK1g93M55vSI7jr0gThS+XHwqPWWQGb6axLI9ewKuvR3QIT66hq694P3IvBIMv70X7jE+wi3MPcnrHD7GOeU9gD1EO8gD3DwAsL27QJgfvtzvN77ZCzY+mkPvvZ7ZKb43CiY+jb3FvTh7mr2hTCA+pCY2vVo/nj1nuSS+rKoSvi6reL2QefA8pvP6vZchGr44pHM94q8Mvu40pj1AzNc7ABpBu4B6Xr3IbA891fQLPpwN1r0XV9q9QKLZu0W3m72UFEs9ABnkvCEjvr244CK9HBwSvhji5707kpa96CpoPUDbLbtSrK89ookAvoXd7b17yzI+va4FPtWaIr7wwj495m3JPWCLe71vcxU+vlj5PcyUkL2Nham9mE+ovBMhDj4L/w4+BsX6PfAqUDzaxok9QIYVvMx/AL0AEqy7UChYPM2oKz64NEQ9nTILPuDbJL1ycIY9DLs0vVISjD0wTa29szcHPrBZPL2SLOg9LoWdPZHyxr2ugag9ra83PpctNL6UGCW90+UAPloQFr4b9Sw+UHJFvMo/M76cRxk9QO40PN/rAz5gu5a766oUPoDcQjuwsQ69pPAkPZ8P+r01swo+ciaUPbMEJT6JMJS9zTg8PlXCOD4Xyoq9UhCQPWD7ODz4mva8sawRPkUVKD6GWY49kYQvvsK0mT1gm908IG9HvPONBD6EIUU9IC2CO1zVIr3FMRi+UAhAPRiTEb3gnS08QmGUPbS+Ez1Iyqe9Znb0vb5RwD3oaq28sOeivaZq8T2Amyc8q5ravQeMNT6sAdq9WDY6vpCHXD3A11E7IOZqPENHCz7b5AI+KJ4cvRBkDr7lFho+QGNsu06edr3uzu09Dc4dvrsTMb6kbkC9P28PvsJgqT0hoCE+NPUpPfgF+jzQjRs9ABB4uTICuT2gvqm9rLoMvnDoaL0smBe+UxQHPkTnQT0S6d89oLGpPMGxzr2yZ9E9w1kLPmAmNb4g4i48ISIyPoBEtzxwsyA9YJwWvpDpujzoBSy+owkwPkp3yT1LGfW9eJodvbUkMD5GQQS+ZGREveP5Jj7PCSq+IqSiParLij1gjR48c17ivVWSAj4AdiO6WgbovRyFWL1xQ+29mJgIvn7Qrj3a0Nw94rC5PfK5qT0yyO09yb28vUgFGb1061y9GY4XvoOaOz5J09i9qf4NPoOCBD7SGLw9hOoGPQDNcLrWuZK9rF+Evb4AJb7g5TC9yt6GPWo2oz2WSbk9fFfYvdcqOL7Asq87Q6HmvfOYJj6kJXa9aMP3vMNuHz5gKc69UPyXPFi9sLyaN/k9/sjXvRA5gz0AwAS45rjrPSkVHD4AP2w7oPq0u93Jg72Agaq6XK81PZs6M76YrAy+Vc4tPmW5+b1/FA4+YOgUPBrgmj3fqBq+dBtZPZbxsz1cmQw9tMoRPUW7i734yFi9IOkXvZqIwz100jY9aGPvvYQJOb1gQbe7qtMUvj7vK74oqRE9YPZyPdK/9j20MhQ93bL7ve7Mpz17UtC9ba4XPt5Cg73LAjo+Doi1PeCTZj0QIKe8NY4JPv3IDz4gXeC8uW4nPsQAhD1aM5U9QOm9OwA/njo4KUS9ZmW7PalfGj5Pjxw+ukbnPVI55j0AfmC9kCu9vAhc2zzceAe+AtSaPRNGGj6HcQM+xFd8PW5quj2cXhS9iIQxvRWYML775Bq+OFoKPVozxT28ji29Lxv5vQ4FiT2isbY9aGGQvF7Crz283PG9KnT0PfBzBb3Up1w9J7UvPjRshT18rjQ9buDvPZpp6D3j8DW+7BEbPbel6b1B1ja+Qjb0vXDi27xDlYO9evXyvVMTOD6Mxik9vi6CvaLQpL1nEzs++GMRvmt1Lj7YuaW8wIe5Ozosh713TRs+wJXjvdI4/L2xPBs+NMUqvoQ6Ar6E9x89L28avhBzrL3auaE9dtqmPUbAyr319yg+sx+ovSzdDr0wtOu9Ijytva3DgL1w25m9TOphvTBft70JwS2+4TkxPjMWx73Tng4+AOUIvsaymL3Oj6U9Fr4JvpBAGr7yDP09odI8vnveHT7ILeS8YLO3vDt9Ez6eH5a9ALAbvibKnr0GA/g9sIEYPehirL264pI92B0JvRUDKb6wLBe8VUoaPqGUHL4VaKS9pxoZvqDoG75LOCQ+poS7PUrL7b2glf47iQEvPk+Xkr3t+wo+Kesqvor+xD3+5p49kxGsvVCUYrxtJDW+gLzbvOBLBD1KA8892NaBvGBmuTzADSQ85eAGvuAvK73hqRY+v/UCPhw9Bb4u46Q9Ow04Pki2Ab7dTQi+EOt7PQCpsrqkcH49Bk4jvuoINL501v69XOwMvnMyyr1GNeS9wJMQuxqanj1MNJS9KC3HvMDccb15Si8+2kTovUEbFr4Sesk9jHk0PZAEfbyZYZy9mq2cvWV/PD6rcDW+zAdFPYwhXj3gywM8ai2oPbT6fj0ASpw6WhbePZQJFb2Yyfs8QHh4O9ngCD6G5yq+sBUSvFzOFj1A4f+77yU4PkG4sr1Ai2i9XhMOvpFFAj60C309vXY6PkBglbsEVmi9caYqPpR0DD38Gmu9lZ+xveAw2Tus6vu9lgzfvbCSJjznoyE+Kjq3vQoI2z0jCgM+bBdvPbi3Hr6xqjS+onCBPZ+vMz7v6AU+2GwOvlCiuTxr5TI+PvstvpUjoL1rBwM+VrnnPaMf0b1grt69B5YtPoL3wD3ujcw90C0MPSWP6r0tlhm+zEohPccOhL3Qy/u9bNXrvamMOD5COvk98ZgkvlCOSb3edga+b9orPgfgnL3FIg0+SsnbPcg4nDxA1B69U0EXPuO8ID6gZBm88hDCPd5boD0cYQW9v74MPhyUAz1AJAq+mKD5PCVQ1r1c5+K9mn8cviqJE75+Zvq9AIJ9PXGklL0H3go+Pz4TPgAcjDwaQ7A9Qj23PXqRhr1AeV69WvKZPVlSFz5WP8M9XI1vvaR4dj3KHpG9pIgwvpQ4Eb5iAcS9KP/fvZ/6GD4tfB8+JoDbPcHbID5L1hk+3l2dPRNVED6LHxw+J8A7vnxHs71ALhW+Fq/qPS0IDD5IJQw9P7InPm51kT3Cnp29yrP9PS6d3j2T7SA+q1w6vt1aED6Ibgq+q6cCPoHaAz4Plgo+fQooPntWwL2Q4V+9j0cxPjOiHj5rvAU+hoLjPQBxLDoYppS85oCVvfSkeT2KZqI9PVaovQz1CT2WtKy9Eo/CPTwMur03ISK+hjEhvuvuAz4Dzio+ImGyPZQGHD1fJ8S96uKZvd8uA75MiE49WacXPkPDBj48ZRi+gPfQvcGbCD5TKyk+38jfvWZTsD3ulYE9NMxbPeESKz7cpye++WUwPiDkarwEpDo9AKWbvME6nb0AIya9oOHHuy7pNb4GWb89+r6vPS0jPD4eb6I9DKkSvjV8IT40yx+91yacvTRaOD3PEQs+KBpqPa6uqj35KTY+Y4UYviAFE74Z8ji+gUiqvfC7+7y27vs9pBjWvQMWIr4tQA4+180kvhRvL745ua+9sIE0PLgPKr6iP/c9oK5pvKDkw7swlY+9IJNPvDoxGr5vQg4+ECBdPWZh8L3AGug8o1wePjDPCj3hEhU+54zxvdzaeT1hTie+ZKr8vRCjBzxo+SY9OVELPnr3DL6Y5H09BBOXvb2gLz5jozO+XCRfveEnL760/Sw95I0BvmhUljxFbws+WpmHPfZpxz10jkQ9HNMOPY5x671qMb+9O1L3vQ+7lL1bBoK9Lqa+PTu/OL6wb2s9dD9uvUrau72UEzI9MPYZPXvwIz4qRs49O6kYPnC4WL2KG4I9E5E1PurduD1plQY+i72ovSKYpr3ET0C95xQDPrCLFL6uMMI9fCtCvaGvIr47yDm+wB8Lvq7//D2/jww+MPbKvUDaNr1guGA8vAcSPc8RJr6Yku88EBQTvXggDr3Ezzq9Wp7fPX3jDT4ALGg8oBvnOxA5FzwAbMk7Yj2ovYvk4r20AVu9SAIFvsBFy7tIi+A8mHihvG+MGj4TbRo+Sf4OPmCVyTxyiO89muOtPTcaAj5FvwC+IP7xPE0jMD7AXoG84g2tvUzlLb5hVyy+I6+DvePQpL0MAO+9m+MJPg4nkj0O6aM9ZeAmvjLb7D2uwfE9EH7svV4x4z1h8xw+CeczvtshGz4zAyG+uOE2PcVGND6mdCO+ONYhvhfEOj4H9Bc+KEIrvlINyz2AVc07EHONvCgPp7wlPQw+EiLfPdB1Gzx5Mpa92Mg2vtowO76Zfgk+zUM3PiDBS7wA3t86HCYXPS1lHz6CHpe9gWgTPhbY0r3mrLs96o2fPZUMvb0EXkm9ftsHvmMh2b3ZODy+EGEwvHAzlTzA00U7XKUWPUf8N756CAO+EM4RvHM2Bj4Il6m8oj+XPTLt4T20qRS9sHkkver9pj2Qklu8T0gOPlz/G740cXY9h36Gvfsyxr0i+Im9wUsDvnv3FD7A6DC9SBJJvbi5Dz2/XRI+utTrPQobhz0K9Mw9sAntvL9GAr5Idpm87s/ZPUZ/qr3AbiO7b3cYvlNuIL7+4Yw9NYoCvnqv8D0e6a493VoBPsw/Cr5YF+m8jEAwPW5lxT3Llgg+FysLPioF/L0uZfw9MEyCvB11Ar5bGSY+RvToPXCsPTy9+QY+xU8EvrZAAL7wzoI9xRWHvSDrdjzg9yq86osivhx0HT224eM94D0ZPXRlGr7sfTu97iOrPTQw2b0fTOq9zr26PTw/QD1LDS4+Ycqgvd+tp70jrxk+uIJCvbBiOLzaARu+ANz3O2pGK77gGzW8oOz3u6mBLT5fCyG+gO53vMujHT5geoS9hUClvYzzD754Agm96m94vXhSoLyD9yI+VFJ7PZBBITwkYR497ZfQvQO/t70+6YU9LjUMvs63mT0DCAu+cj7PPSFyPD4KshG+AxPNvTEhEj4wkhi86W8qPmIx/b1Pjx6+onUfvmom2T37Ny8+Oi21PY5EhD0cN0c9Q2WnvZecIT6y0Zc9mgHwPQ4bhL332Y69j6MCPjj4/zw41PA857AWvrjUujzHSQ2+OUgaPswOOb7n5Ru+gNRXvUDtETvg+vE7/uzOPYmMKD5T8Pq9O1OJvZiE771it9S9918CPljBDb0jbTe+CCqCPOmiJD4gibG9aApqvbsTx71VQy4+C+IMPnz9H70A0Ic6ey4YvuB+7bt1Mfe9Gb0evlfpDj7msCK+kAIOvrWh3L0G3Ng9xpG7PW71kD0+2409ivHWPYpRnz2z7SY+dToDPjCIob3p0zI+AsXLPRCgQTyRrPG9PvrgPSz+b706ZRW+EIwrveZomj1K0d09GnC9vQCaOL2sQia9c2PxvVcdBb5vkYO9YY8dPha/Er6pHi8+tdI4PlBcuDz2KYc9D2EAvjDa1r18ve+9EtqwPWp/pj0Rb+W9gVoAPitQKb4yFLY9/3smvgA/RDsA1U+6R5nlvR1BHL667Mo947g2vi6dAb7ANoQ9WfYjPrjF/7w62Jg9I5icvTkWNz6AJ3M8Du8ZviGSKT44PR69Q3U2Po8OM75BCCI+n3AivljoFL0sgki96JH8vUzZab0E1hE9XvK0PcgmPz3TnPO9QeQavhCz7bxTIoW9yfgwPq3jBT7i4bU94oTfPY1ygr3g9Hy84C2yvEvxHL52NeO9SKQ1vVeNOj5AovG7sJUIPMAFLTsp8M69FlmePdronD2A6wa+Ia4yPkZewT3w5R09iAc1PS1OHT7ao9k9PIJ5vaa2+L2QB3U8YFkivYC8z7xXXzE+U5L0vUoUPL7cKg89HQEhvo7E5D05Pxi+fNjGvcAkqTwV5Qk+3TsxPtAzh7w8PWm9AF+zvFIj0j1AgCK7"}}}}, {"name": "sequential/conv2d/Conv2D/ReadVariableOp", "op": "Identity", "input": ["sequential/conv2d/Conv2D/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d/Conv2D", "op": "Conv2D", "input": ["Func/PartitionedCall/output/_2", "sequential/conv2d/Conv2D/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}}}, {"name": "sequential/conv2d/BiasAdd/ReadVariableOp/resource", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA="}}}}, {"name": "sequential/conv2d/BiasAdd/ReadVariableOp", "op": "Identity", "input": ["sequential/conv2d/BiasAdd/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d/BiasAdd", "op": "BiasAdd", "input": ["sequential/conv2d/Conv2D", "sequential/conv2d/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d/Relu", "op": "Relu", "input": ["sequential/conv2d/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d_1/Conv2D/ReadVariableOp/resource", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "16"}]}, "tensorContent": 