{"format": "graph-model", "modelTopology": {"node": [{"name": "x", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "16"}]}}}}, {"name": "angle", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "step_size", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "fire_rate", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {}}}}, {"name": "strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAwAAAA=="}}}}, {"name": "strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAABAAAAA=="}}}}, {"name": "strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AQAAAAEAAAABAAAAAQAAAA=="}}}}, {"name": "strided_slice", "op": "StridedSlice", "input": ["x", "strided_slice/stack", "strided_slice/stack_1", "strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "7"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "7"}}}, {"name": "MaxPool2d", "op": "MaxPool", "input": ["strided_slice"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "3", "3", "1"]}}}}, {"name": "Greater/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}, "floatVal": [0.1]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Greater", "op": "Greater", "input": ["MaxPool2d", "Greater/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/PartitionedCall/input/_0", "op": "Identity", "input": ["x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/stack_1/values_0", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAAAAgD8AAAAAAAAAAAAAAAAAAAAA"}}}}, {"name": "Func/PartitionedCall/input/_1", "op": "Identity", "input": ["angle"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Cos", "op": "Cos", "input": ["Func/PartitionedCall/input/_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAAAAAAAA+AACAvgAAAAAAAIA+AAAAvgAAAAAAAAA+"}}}}, {"name": "PartitionedCall/mul", "op": "Mul", "input": ["PartitionedCall/Cos", "PartitionedCall/mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Sin", "op": "Sin", "input": ["Func/PartitionedCall/input/_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_1/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAgL4AAAC+AAAAAAAAAAAAAAAAAAAAPgAAgD4AAAA+"}}}}, {"name": "PartitionedCall/mul_1", "op": "Mul", "input": ["PartitionedCall/Sin", "PartitionedCall/mul_1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/sub", "op": "Sub", "input": ["PartitionedCall/mul", "PartitionedCall/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_2/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAAAAAAAA+AACAvgAAAAAAAIA+AAAAvgAAAAAAAAA+"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_2", "op": "Mul", "input": ["PartitionedCall/Sin", "PartitionedCall/mul_2/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_3/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAgL4AAAC+AAAAAAAAAAAAAAAAAAAAPgAAgD4AAAA+"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_3", "op": "Mul", "input": ["PartitionedCall/Cos", "PartitionedCall/mul_3/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add", "op": "AddV2", "input": ["PartitionedCall/mul_2", "PartitionedCall/mul_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/stack_1", "op": "Pack", "input": ["PartitionedCall/stack_1/values_0", "PartitionedCall/sub", "PartitionedCall/add"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "3"}, "axis": {"i": "-1"}}}, {"name": "PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAA=="}}}}, {"name": "PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AQAAAAEAAAABAAAAAQAAAA=="}}}}, {"name": "PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["PartitionedCall/stack_1", "PartitionedCall/strided_slice/stack", "PartitionedCall/strided_slice/stack_1", "PartitionedCall/strided_slice/stack_2"], "attr": {"end_mask": {"i": "11"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "11"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "4"}}}, {"name": "PartitionedCall/Repeat/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [3]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/strided_slice", "PartitionedCall/Repeat/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/0", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/repeats", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [16]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Cast", "op": "Cast", "input": ["PartitionedCall/Repeat/repeats"], "attr": {"SrcT": {"type": "DT_INT32"}, "Truncate": {"b": false}, "DstT": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Reshape", "op": "Reshape", "input": ["PartitionedCall/Repeat/Cast", "PartitionedCall/Repeat/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/4", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/Tile/multiples", "op": "Pack", "input": ["PartitionedCall/Repeat/Tile/multiples/0", "PartitionedCall/Repeat/Tile/multiples/1", "PartitionedCall/Repeat/Tile/multiples/2", "PartitionedCall/Repeat/Reshape", "PartitionedCall/Repeat/Tile/multiples/4"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "5"}}}, {"name": "PartitionedCall/Repeat/Tile", "op": "Tile", "input": ["PartitionedCall/Repeat/ExpandDims", "PartitionedCall/Repeat/Tile/multiples"], "attr": {"Tmultiples": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Repeat/Shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AwAAAAMAAAABAAAAAwAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [0]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [2]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/strided_slice", "op": "StridedSlice", "input": ["PartitionedCall/Repeat/Shape", "PartitionedCall/Repeat/strided_slice/stack", "PartitionedCall/Repeat/strided_slice/stack_1", "PartitionedCall/Repeat/strided_slice/stack_2"], "attr": {"end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [2]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [3]}}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/strided_slice_1", "op": "StridedSlice", "input": ["PartitionedCall/Repeat/Shape", "PartitionedCall/Repeat/strided_slice_1/stack", "PartitionedCall/Repeat/strided_slice_1/stack_1", "PartitionedCall/Repeat/strided_slice_1/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "PartitionedCall/Repeat/mul", "op": "Mul", "input": ["PartitionedCall/Repeat/Reshape", "PartitionedCall/Repeat/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/concat/values_1", "op": "Pack", "input": ["PartitionedCall/Repeat/mul"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "1"}, "axis": {"i": "0"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [3]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [0]}}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/strided_slice_2", "op": "StridedSlice", "input": ["PartitionedCall/Repeat/Shape", "PartitionedCall/Repeat/strided_slice_2/stack", "PartitionedCall/Repeat/strided_slice_2/stack_1", "PartitionedCall/Repeat/strided_slice_2/stack_2"], "attr": {"begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [0]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/concat", "op": "ConcatV2", "input": ["PartitionedCall/Repeat/strided_slice", "PartitionedCall/Repeat/concat/values_1", "PartitionedCall/Repeat/strided_slice_2", "PartitionedCall/Repeat/concat/axis"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "N": {"i": "3"}}}, {"name": "PartitionedCall/Repeat/Reshape_1", "op": "Reshape", "input": ["PartitionedCall/Repeat/Tile", "PartitionedCall/Repeat/concat"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/depthwise", "op": "DepthwiseConv2dNative", "input": ["Func/PartitionedCall/input/_0", "PartitionedCall/Repeat/Reshape_1"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/Identity", "op": "Identity", "input": ["PartitionedCall/depthwise"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/PartitionedCall/output/_2", "op": "Identity", "input": ["PartitionedCall/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d/Conv2D/ReadVariableOp/resource", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "128"}]}, "tensorContent": "AQhevYpUJT0rUsU9/q+CvbnF8j0dNoC8HQ+5PR4a17zQcxK9IL6VvTbX3z2uLsw98TpbO3ceXz0Mf3I9oL7qPHCHcr0NBxk+TgYePIlxW7ydPXM94JfrvHq+Mr34NN89k9zkPO5SCT5n4ge+o2C0vIJ5Kb6izpG8JC0FPOP7Lr3sihm+uz4nPeN7eT32QR++y5/iPPcLAT4gkAk+4yXcvebFxb1MYdE9E6V1O2KmnL0OuiI9hQGhPWEUML6B1p48YhONPWHogT2euSA+Ls2CvcvFBj6BidI9vH42PesAML7MoxG+qXPjveRcDL3z+5+8WF3ePY7OCb0JU6K9x1SAvaNAND5rTBi9v66GvdA5bL0Vcd09h/9XPZMqvDxQ38C9oHPUvCoPlbzWXcS9mXoFvnmHCj7uCy698JNXvmnyAD5yTCm+yxTbvSOnEj7lfTO+ceFTPOn8Ub6Bsao92ONSvq1oor3zRCe+LAoMPGGfHT7KBrG7MS44vd7r/jx9WVq+sR8evaUuBryj/Im9oixfPWw+ML6aEl6+N737PYKw870FLmG9cq87vnbZAj4UPmk9wC+LPRJjmL2QnTq8s2wfvsiPR70c0g++E5e6vUFRZr36TPW93PQFPkWgqLzq77a9b5XGvfFEir1lQfW9jKfWvalD5b3Cpxg9YPUJvjq+xD3FYh0+VvB5PNv8Fz62MQk+tWlEPqfno71Sdgm+5X1PPhm4Mr1AcCs+9t0FvsupTz6uFl69nLfePUL7H73WfYs8RgvfvQoSbz3+SjO+Ogkqvg94fD7Mpka8/txKvLhzZr3Wkj+8inNIPvpbsr3B3wg+BuI4PkVYFD7ZYRe+Fs0kPnc9Hz5M4Ug93zjOPePVxbwkrbw9oQszvR5kNr1Sh4C9t4Y0PnvIVr0W0WA+Ei8zPivWPT5ub6u9iaQ7vrKByjweRAO+d/aEPRKAbr0ju+I9pDYxPmFY871M4x+8u7rrvaBGrrzz+Sg9081/PNYl/TyA8ei8o7KDPdUoQD5I5FA+EhEJvme4KD4Wuuo8+TjxvCC/KD5WXas8gxKHva2HKj4HW/I9PAr3PaTmYry8Pj2+Ski6vCT6ur1k0n4+7qwaPn4QCD7eJva9baspPgkm/L1kGp+9f9DBO7geHT6vWVW9tE3PPehEuT3+aEk9tKj6PWwR7z1Aw0s+x3k9PRN3+L0oqCO+ruNsvYE927wZEI08pI0Avtb5771Yu6q9+26ePlQl+70FazG+P2yqPEN/5jxeScG99F9HPqMJFL6Mzo090EdLPklgLj59th8+o80evcJTLD6q1vK9ctWrvcNK5L3/8Eq+Y0XOvR97AL7VuwO+yi2nPWLiDL6WFgI+r+2AvVhwxD0B3d28b9FLvazPC74da549nXrkvey8VL4MCz++/flNPaWMWT5NYUI+lChUPuvkBL7L/Cs9GBFGPrBFFT4JzRM+1bJ0vIUV+L24sjA+B8ttPS4s0j0wvaA9sEzWPXzkJL2Gdd69gec8PaYNlTx/KQq+yQwJvlWOSz5UOiq9x+PhvUd2PD4WP0O+AiXEPVm7sruyFgQ9n4X9PL3wUL7hThE+fyc4vjnBpr0ivwm+3BFJvuHSvj3Sa5E9kF4XvvS4g7tdwAw+jaxtvashFT6tI1I+SgwlvrXHSb0tHEW+/cRBvtGIbr2FdxG+4PlIvs9x6732kfC9XBKEPD+xzbxoLJ89dceAPUSWKT6jRCK+8VvEPNJR3b3FMkQ+f61oO95JQT7a/EI+xy2Au1Dlmj2c/iE+Kd1lPYhiWb3YWEO+s3wFPRDigb3g4hU9CkggPNNcCD6wwR6+9EGpu8XC1r0/ztO9/nOuva4UKb2vyNg8vGwdvqK0CT4Q4Rg+g6ckPvwmgTyXiyg9dMBGPpGQ/72Np7w9YzolPsU1dDyQbks+D4aovW695rwrNQo+VX8VPk0+oL2EcfY9ulPcPX2FGr70hSM+l6SRPfogazx5ThK9K+ffvKjH6D3pgBW9l2sqPTIiZDw3dLI98mCsvUO+l7vT1lW+hqYPPg9y9LuT+lM+VRIWvGugujxQcos9O8RXPPMQXr4QkRm+xp4PvV0Jkr0AUuE87M6wvPpeNz45Vgi+3uPRPbqLGD2vKvG9j4OOvc8SCb5e89I9ST8IvnzlKL7Pj6Q9e6Ppvbiz8DvLMzu9SwAPvE0EOz0h/Om9/gwSvkEZ8b2Ip4M9y6I/vpeWVb2BNES+RJekvU3PlT0bv1U9CTG8O/XrLj6c1qQ9Us4Hvpg4wj1IkDO94PbEPccBHz64FT479r6VPMhv170XGCM73+m7vT2gdz3ZNfs9wz4ovua4Uz2WQwo+E2PrPaJcJr5bMQM+VK+7PQqdlzxlTE49Ck8JPqftD746z9A96kwRPTXqqj0Bzrg9IvquvdzU4r2nrbG9hxMVvs6Sjr0u97i7Rf39Pc49oT36Iym+sLYkvt7tpr04lTK9RQNSPFGkrb3MSxM927wjPtN4hL2RDiK9Rn4VvkWH6LuV/wE+cyNEvk2SHL7o0Fk9BBCQvdQCQbyXQr29z4QtPsxAzD3lWG68V+yFvSiS2T0D7+A9TbvGPEI6A75IWIC887ddvUh2AL7rAxg+1QTwPBCJyb2bLS2+QHGlva8r1TuZ3ls9LiQ6vFGqsr1jkDe9jO52PeTVrr3IvT48O5LYvVcZFz6yGZ49LwIiu6JxMj6g5vA9c6XWvS3n7zwUx6w9s7wjvBuRMr14HQa+fyhlPgIx1D3/Xmy85JfNvW9s4r3dt/W8kSwVvTor/zyN+IK8Ul6zPTuXYj60EB4+d/HmPOtJCr7TzUw+Fl1vPd+7Rz5eObS96FUNvcyd8j0rrLc9vrKJvA+APT4rgR09swSjvJO9GT40OEk+OKD8vCh4mbrL0rc9PueKPU+RHr6a4dE9vKv0PQOgL724j0c9+N4uPk/L2LzXuoI+XKqUO3apEDznXD4+BroXvsxFOL0yyfU9tHnxvfdiMb64Z2M+iytwPWPYDr6A2149UNSTvYKg0b0i+EQ+83Gxu7UkkT0bQg4+Ca0xPuxcFr7a6Eg+mpmJPSydlbsbxk69CzgCvttMDD7/Cfi9GMj1PZ7Pab1O4y66uN8NvhFq0Txr1so9rB+AvCNyAb6NbDa+JFzQvGd1BL5zqak9XQXMPcvNJj78cIK9KPUrvb9ZK735iSo8GyHjOjyHFz7YfgE9P3LcPdj2RLzSFto7KyTTvCM8873LsZE8PgKzPbu2tz38EJ69KM5BPptn5j3sT408sQYnvo7oIb6W4gE+V6Z0PUAmrD2BiR2+N5w2Pt3i2Lse1iu+RpMWPosZ7jx/EoQ9s2zwvHGKjz2/Iew9NlQxvtNOTr27voM9/zqjPcKiGzusk4G9dUDpvX1+BT7QJx6+0kTWvfMvAL4SFaU90swDPon13L1jCko+u1npPc2KBrysoIs98RPhvbnNSzz+rZM7VWnIPSzqLD7VVRW+T0lVPjlHpbxoYsA9PJiTPQoaBr5A5NW93WbZPWHXM778LTY+EdUsPrNVQb4AKPk9lK7nvS1bNj7nZDM7tZqGPWrzEj1EosA8YfEAPtLelrzY0Ig9sAnPvObjMj4nGR09jjQdvrCCRL7kyV4+TMPgOwIswb0txyg+tGf1vZLCoj1HRmw9GXiRO/Z9uj39R1I9myWwPQIySL21cmQ9SucHviplfjyVd/y9/JwBPnsRQr5Gshy+pfWjvRFSID78A429l/Qmvqjinz2QwAS+mzu7vWmHlDt8Rc07oe8AvmuoIT5t8RU+ywsgPsB4sb2lGAY+sQiCvXrd3TylchC+Jx1JvgSUQ72puoQ9GNuAPYVXOj54NLW9zC9TvqkwkT0XHgQ+6cYcvk4w6r04/yA+Z7bbvbkgar2Gv0K+PcMnPvy9Kb6OKQY+MjAEvSZMT70aM1Y++nf5uxqLiblRQHK8fh7yO2REvb0peGM8eH+dPa7GY72YvrG9C0I5PtxVaz1ypT26WxPoPce0qLrp3S8+Gpz/vR271b0IkIK93w2AvUTgBz5D5Ry+/JyYPfPbVT5OdWA8u1ECvFaFFD1qnUk9mwdtPa8De71YVwc98lyTPf4IbL0yJMq9vEuAvSm2LL2qDOu9ziwjvE3drb3vCp48qsonvVy3Bj3did49IQaFPa1XBj6Vwtg93GCFPUUEJL6S7Tw++3SlPQa6oT2yvDC+6NlYvFAIfL3XQoA9AQQpvixqPDzk5vA9ytOmPFpsnz2a0aI96ZMKPrOtN74ThmE9cxdrvdpGFj5aNi69zWYGvrgh6L1JJoM9cssmPo3MFr4twEa8KaA0Pk0EZL4vnEG9lkKdPVoIyj3EhzO9FWIDPv6/3T2IubY7uqwHvm/CRr6ogR491CUwPiB/FT7k4kq+m33gvBim2j2N9iQ+OqY1vjGiwb2YSB++Abv4PHNqDz50kDA+3H8/vkK71r10R6e8tcjQPdzhsj23Gig+UQkdPe46lz3pYRQ+lUQBPfKl/r3Dw5G9ePQtvmxGUr0o18K9ujGGPC2xwbyPzR0+I5BsPdn9O75Q7fc8Q6K3PGZgk7xMr8Y9QAQfPo4KLrh20iM+wWYRPN77jL0kcNK9s+eXPSnUpL0ivxc+1dJxvZ5FrL2NPiC9o7fGvZRds729ZKi8ffX/PflRED5aOHI97yssvi0Hkrx7AzK86ajJPTM2nr2/FS0+x+86PiE4zD3BfKy9a+ihPdqTH7zbgKE983nhvUm+9b1eSVg9zMyGvNzG0D2ImSo+EdMGPqhmGL5QEA6+q//3PdLEyr2DXFI++2o/PrXypry/ERI+rhgvvCg1Nb7KvRO91ZQQvhCCFz53p7Y9WxssPYl1ZDx+aC4981rpvanTzTw5rpU9KH4pveGuDz7VV6G9WSK8vcR4ur1jfhG+IRFVPj8/3b0bz1o+vsScPbJ8GL65JkW9dm87Ps5lRj2QDh++3bhRPsUY/T2Lu+S9Op2Cve80Jjy5T5I9pyczPAj4Tz406NC80LYNPqY4ezvo0yG9SrsAvmVEPj76SRc9KklmPMBdubx1SRI+avMnPgYbIr54Y5G8JTYnvCyBKL2I3bo9qUhvPTylkDyRm/g9ukFVvQ6cGz3WTQg84DYNvRw0RT5gNVE+LZpZPrb4AT0dPw69vrVyvQA8nb27lZ49+Qx7vZyTIb4Nekc+7galPfrrnD1D7S2+DCiivKYNQT2VhDW9qOCZPXyNCT71LPy9ojiXOzbbeL3Ie047wXZdPk5x0D2rBlC+cq5rPZgW2L3Dp/K8K4gAvpXyLT7PWl8+QrxjPfbqwLv+hCq+k0kDPniRJ74INAu+0U0WvnHKLj0sGDc7fdVbPRryuT3wISy+C+tTvBETM768BcK97wgWvrwuqr3UubG7zNQoPr1AEr6tHy2+HSPEvSPEnj1SpC2+UbhTPQJYwT2h9BS+TI2/vP+vt71lu0o+7RgCvRpeKz63CdQ9iFUIvpIFRD0CWbc9BFM4PZ0omj3BkmA+A+AsvhnmX76XvPU9zFpWPf9f07128TI9xggjPRDxBr7afqI8UKvzPWSvOz465b29SmogvrqKhT12+8A8xUVSvc8Gnr0NZDA+oIsWPko3IT4V7dO9VrQUPnjvSz4r7bk9n6/UvaxTJj6OymS9AoCgPIxflj1LSze+TGXNvSCwV72i0w4+YnnQPXi53D1Ik1g+APE8OytEPL5Yahy+caMFvsrRkD0rFik+Zwc0vk1v9L3aWZO8MKBYPlVIFL5nste90gZkvuXN/L0sz+W98NSCugEPIz3XfKy9VBURPtyELz6hPBm8JVYGvuiRPT047nS8Tja2Pfu5Bz3St2U8AREFPrCEEL3f5Va8OUa/vVRuIT65Pgo+LcDavMuP1jw4uxo+Gg+xu/oTnj0O8Re+gm4LvhmS0T0me4+96goWPvV1iz1lE8G9AOiKPU9N77zMuGs7ffkNPgTyXj1zV7k95yGrPXlaAL4wn9C8NH3PPbTJoD21OV49ySqoPUfkRj0vlf88h90ivjU+OT5zZQ29YgCHPaxzvL0CF4m9PcSIvWIZxz3PXWG9JSppPmMCUb7fQos9G2W3vSws6r0UZUO+1V9PPLb4uj18lc+9riLQPYa1H75YmEU+vF8Qvh356z0a/fM8sezsPU846z2SeWy9Kb2ivfTSqr1e7NE8ZQ75vVH7trvMedO98V8KvX8IJr7alK09Y0iUvVurC73clBu9vrMBPgDoRL5r/bu9Rw4avfuPPTycohC+YD4QvQk7IL1uBu28eJ1sve5PXzwsZpO9FK9gPRDLXr1exJU9GsM/vfcuLr4qjBU+wEb1PF8Txj0QREy+ziYIPoCwYLyZW5484Mq2vEfJFr6aOFi+TtKIvYK6pj0Af5M80UHkvWowWr0HjBG9TdeRve6mur1f6ZW9CNblPfS0Cb4nrMS94oxrPZmHOjzuvSO+zLs2voICHz4DZCi+Hg3IvYcVhr0ESHO8wUGEPDDa+z3WNDy+7LADvvlkCj4ZLYA9sC1ZPc45nr2jEge+4LCkPVw1FD5/iJC8MG9lPT8D47zNLv28+LmUPKqQZb2wtJc8hEMIPGNkpL3ljQS9wgv+vc+cuj2nhVA9GZnPvXaCwD1ZedK9PVaDPF/yGD69dwS+bK6iPeWZSD2bW+M9t+nzPcsTFr5zbRw9p7Wmvf/YTb6miLi9L4jCPMQkHj6DQZk99PIBvg+GLL7Lv0W9KjoDPtZTJr7vZFM8KJqkPUDTyb3a0Yc9kKfmPR/evj0NpRa+7jqWPPBynL3ldBw9LP3AvVqCRL6pOCI+E2kGvgttMb0tMx++/iEKPoBkr71dzLy9rTy9PQ5cYjyCX8s9JPPhO70cP73vw0M8jzrFvRR40D0TlAo+B2rFvblyVj6ESIS7fCJjveglqT3YOyo9tI2WvdDeJz7Wf529Z+8NPqI8vLzLVCo9ZUwVPoNJPz7Zlua87969PQ7srTxP7tC9EJU+PhYdNz46Pbg9qxzHva0nBj5LHb+9cO8avs2Um72oYp09nl60Pd4Yhj26dgi+0mGLvCaucbyFQio+HHCOvSFXMD6l/Cw+YFKMvSXoRj74rD0+GxgsPDm7Pz7HdBA+z60Rvp3OMD2PLHu9knVhvXHhnLxr6+w9iAGNuzdvwL3sK289FO2evQNwRj51XWu8sz6WO2mxLz1ZxQy9IrpGPgyObrwIqwG8vKjePDOXy73Q1+m9eioovupwcj04ryE+1oGePS38I72pgJC9iBjNvfXvm70K0sa9zEsEPjSbAb6+mLa8AdvAvNRSDr6yTUi90vbDvaNZUb15lvK9Egr+PLSbTj5QlY+9LGDUPb7i1j2mhYK91xwbPhnsQD4szEA+fVjSvSfgTD6GDxI+XRsgvib7nr0vzro9AK2EPTYCF74WHWi9h4T4PMgQBT35nPu9iz47Pu0Ix704YgA+MBKCvMauLL5Muye+zhIRvh1IcD0j4rO9lNRoPXJxKD0GpAS+FT/XPdRORz6V/Ay+q9bIPXUBJz4fxkM+NqmmvQLU4jwQeks+DoravNSoAD6L20s+F26cPWZCA74ZoKq8jrLsOkHODb6o/3E9mXsqPqIzhTykfQQ+Ru6wvRstLT5t4H49eoDIPBDMCb5gM709giXyPW/MQL7EtBq+TZdGPR3nEr1geY+93tRdPsv8CT4l1M89PN6Uvc/bxT3Hf1s+iJI9veYBJL3zkjQ8DxiUPfpsMr7qACi9id0WPiUFWj3ZLQo+G5sxvs+UBz0ApEm9Q9apvQNeYb1e9gg+/fvNvQBz5b2TTjs+FjRBPSNvDr4s2pU8smVqvcRq9rypkUa9tydNPT3zTL0vsnY+Ke6VvSacqzvS4nE84NUQvmf/Ez5+fNc8lCX5PaOuOL0dk5I8hR93PVUakz1Oty0+PS30vbjqkLyFJxs+7duIvR7MKz6w1wU+urhmPS9hEj5hsbi9ke8PPbxi8b2ZfQE+FrMaPhAIbD78wBK9vUUKPq4lm71C/fK9umFWvE4a3T3ykxy+H6I8vj8VQz6AUhG+3UAZPi5rFj4gpkA+UYIUPr9QID5Vkxc+XTQrvpeCMD1mzo89qOTTvJQsnb2i6GS84OGLvTc1lz2vhjA+5q+vvd7wzjxmivm9aCI1Pg4yQD7UdCG+u0UuPGvZqr2IPAO+224mPhLjIT5emWg9lfzJPY/mPT7x3FS+NhgfPuOwxL0c8Nk9AGmKveQfWz03ffA9kjl9O+sVRr1Ukfc8Ygh3vc0tOr7NUEk8CFe7vIpS9jzy+Sm9sB8RPkjkg72+4gG8ncgWPeJrOT140w4+1GOfPfLc7b0y9PC9Pro1PvYDqT1Bu5Y99HLdPMdCGz0CMLI8I7u4vFpt9T1/sbI8FG6NvXtDlrwfxrG9FL8XPp/Z5b0fIt69BARLvm7prD2XoYS9uBaAvCycy71izq29Wa6Fvdw/W73FAye+kse+PRoyIr4OTSQ+zU4DvlGEJzwpIQY+g5wnPuJ8QD19PSq+NE0Gvk0mkDzBPRs+th+/PTyyob1vKgS+QsSoPTT3g7yRwAi+9tEsPErrXz2cyoq9fj86vRZ2Hj687N29WkAKvZUeBL3K1089qOnCPVXs+DxJ/iG+Hr0zvRv09r1r1IS9KVakveLgI76wPyU9B4HJva7Ifj0U8s4525EQPsBDfTzPfpy9Wua9PRqYar0/gw48SzwJvu39Br5I8zi+WQbgPcZU372cjAE9iqlMvH9Rjb2xKQm+QFxzPZxTCT6T04W8rPHCPY8SLj5DzY67zn3NPasAhr3Z7X+9gumrPJv0n70/zqw9cv8nvm2ttjvnBO09b+QSvbdbrb1pXMU9Ii/zvbBJBz5Qpfk9B5XuvRXxt726qoS9cMEAPsMCXL2aWQw+5q8Pvi03A70oFn29yBdxvq50fz3Svqu9woCEvZsta7y8jA0+PLKZPX7QiD3NKi4+P0CzPZNw1L0xCpq9ruSPPfN0eb2TTPM9kt+Fu3B7LT0Xwca9urwkvNDIKL4EnKG9MCrAPZe8BT5JC9a94ehEvgNJHj3+n5a9k9YAPcX5CT6d/pQ+6PPVPcY5yj3R1oe9KRsCvv0QND4u9QU9JkZZPcNTOj42/iq9KLsqPvBmND2SePg8jeRTvnuoBD7w4mw+aRx7PqT/Ij4LaY49pZyOPXDz9D0zyIq9Jm48PuO/yT0zKi2+HY1/vWcF371sMx4+hfCqvSqxA73rTpQ9hq0QPrHw4D1u8VK8ty+BPTq6zr2yJZA9YoALPvqNNb6ZeTQ9cYpDPnnVTT0atXy9xm0jPgZwtj0wlDE+7MRVPG4t0D2To+u87c4fPqYXBrsFHRo+FOW0vU8SC77gG4O97AaEPhbSX7pgaEQ9Rzm+PSYuzz2P9Nq9Xt3tvW7hBr6vWNY9JiMpPqs0KDw9Evg9spiTPVfQAz47K7w9Xj8TvrfNxrshQQ+8GQ3pvduHnz2mp+M8qnO5vbnB5j1TBRk8JPgZvfAcvjuliiy+OStvPV9707w/QAs+8nGRPVYxBT46W7W9k/IRPDPoz71GTrO8AwsJPqNcFT4hggG+w0sfPTF5h7zFB/M972DyvW26UT1/vRa9lndEPjoWO76wPmA9Ua9GPTWmQr5oowU+/LdxPoWHrD0Re1W8m2CAPIhC0D0w2hy+0/UePS8G0zyryk69UVAAPoNGBzx5iz++p/kOPgU5KbySnQg+i5navOJ2CL5HoCE+d07wvZSFyTzCWjA+R+GEvfugQr7UQDG9P+KqPQuzxr3jjji+ZtkhvpeFOT0beTi+b54EvLD1EL1nuye++obAO0vaDDxcTVK+PaugvYNMmrxWkpe9gCUmvULx0zvee/Q8gwpfPrmjaT1qd2W9h/xXvlisUr4NXEW+v7F/vdycDT5Onpe8Mx8BPjqiG74tVsc9mTyePI1C1T0FLEk+WBagvFBkUr4ysrc9auCxvZ+1sb2m1EK95hY0PUBIBz14v9o82YsWvrma17yb5uW9sejrvGmRn73kRIO9a4oYvgosz71YOJg9NwYyvVhhNr68egO9SmD9PSCyzb1awv+9iSiBPUUGKr5KrGA+lZw5vuIfJz5zOWI87sIpvm4uMz7tVSa9ej4/u2UuCT6o05i9jLsGvjT5ID1NZwk+HVCKPermNz3rGTA9zCvMPe11/T2YIR297dQkPQNFBz7QLmi9OmglvvrPVT7Vl0G+oi75vdmWQr7K6S2+AYDqPRwcRD5yMLQ94reQvILcpD3kC6C9cP5OvX+387xHDBQ+rJVlPCldrryrIsU93PCMPWhNh72oaRC+lu2svI9urLzzC749IzGrvZ1Ikb3Flhw9PQjmPeGg9z07WVM9ozgHvgz1Cj5M0x2+Tp4mvn7b4b0bKM89PyqtuSbvTL4A5Rm+lTUfvsQ7DTyvvDm8q8BGPLVsOL6EKRY+zvelPTZsBD2SYtO935d9vdZcML5KJ4Q9Tak8vicNSD2PQZy8sbfrPLj/yT0XXoG9t9alPd6cIz0MeIO95YWKPQ7/LD4dmBE+U0znvZyC77yZj+g8XsAUvii3qrzNkxq+Zh2HOoSorT108dA89y+bPQ0CLL5JrgK7ltMEPJrFzDu+BCM7KQMDPpCAGb75jW69eQmyvQRVLr6dAgI+xk53O48EH736CQo+dS4wvoB0Gr4X5DW95aQQvtC5Ar6sW/+9/SaYPe79+r0BNBy+Z90GvqnFDD5cxhc+/pOrPAevBr4QDiG+n8M/vcuYkD1uI6M9G9etPZry6b3Mpw8+6A9MvgGU2rvKkd69HolhvedcBD5u8PA9qroIvsZWQLx17cU9N+e3PXouHD06IXS6pPXKPYdBC75nba49D7nsvFlBlj0cnqM9+tqLPZeviz0c0X09rytavZUDwD1KBiG95GPEvbv9GL3msvy9ySWHvU9tqr3tGxS8L5J3POeF2D1HlWk8b/4DPu3EKb75laC9E+bxPEECIL48Yny9DvhKPSqVFr6jR7o9L6D6vHXdKLxG9Ji92if2vRnwpD2TRcW9v1TIPVPUEL63y/C9gMjhvI33Xr5L60I+qHq+PCT46D3v/9C7Zn8EvakeUb5aViS9YwGEux76l7ynZUm+pBf0va4Q7zxrzc09NBRYvil1Iz46b427nmP7vTIchD0a3SS9vi8uvubVX76wEFi+vE9ivUoUFD4UMQS+f3A0vs0OXb0UEVS5TRulveW/1D325Q2+tqYQvO59ujyXRfO9FQIOvoRuEzwO4Ta+umQMvZ/Oij0vAQ4+HYYavaRzUbx4Yjm+khMDvte3Mj2TiAY+Pg1bPUqzgL5KnAS+TTggPmD3Lr5V8Ac9FtJ3vXNAKD7EnX69mJwIvoq5C77LnCc+I9scviqOV7vaUn28OdmCPB9ly726vAU9Gki+PQHzD75R/iC+ccRDvXL0yz2tg0q91ihYvcFByT0XK2S+mi/xvfXDaDwGJpG9LJqSvbTrFT7KaII6DSH2vDBLCb58qC2+NIkvPmNvTr07TK29ssdSvf/nTr60yvM7Sl8uO55tEzzlig2+eqU3vvG69zwLbyO+DxQmveAgD77BDmy+PWWjvR+IBb2ZI12+i9XcvV96e71g8CC+zqryvRtTSb0gSMK9u36tO0QUtT2z9UM9jZ1YvC3Ss72tpAw+NWdgPTpTMr4IsSA6Ok2NPUxyyD1pepG77gFIvTlNjrwQZOG9b1LxvQDiEz4RwQE+taoQvjDAuD0Tyw++M318vqPQJT6TKIq+VkjhvZH/TTzg4GK9TPjOvNmwiL2e4R6+oW9rvq/Anr138ji+TeUmvIDsKD4QZDI+plxIvrIrjj3+UEa+mfMyvqcJMD677288xC72vZrAQj5qyD2+4tE+Pk/yHz6yxi08r3VCvrQ4mbx+Ayo9lAMZvmUV0L0m4jK+8COEPaZYnb1k1Eu+rGaivVk8N77obhk+hcpKvfPBLL5bZuu975D7PNzi0b1sty29MRLsPQ/qGr5OXBQ+9TcKvuZHerzC2Aw7b2y3vMxCCjtLoJO9RCb4PLfyw7xu7Mk9GI+juoXchD3VJ6e9mvEfPvY6bz0LE7Y9uQ91PC30Bb2Z4vq8gS8CPka9br0GzzS+bPYpPj/mFD0P4Fk+ia1PvnkvXr4qY6A9fd+DvAwit7vpnKY8/JosPcDXIr1n9JC9mgsGPtfbgL0bFYu9kG8tvnbj2D2Tbqw9H6gDvt5Tmzs31rk625UKPv0s0j3KXf49W0sZvoJNNT5jyWK+uLXgvZYn473Ie4s8JlTmvcbgUr7gTFk96IQYvjRdDD4bUjS+i4N1vu95LL4K8qO7yrIdPut8CL7CaaI9VVFLvjIY0j1y6hW+I81Nvruo7T0omBG+ocs9viDfUb57HAm+w1iwvDjWiz2GpQq+Qj2HPG0Edj1WuDA+33TmvWxy9D0b1c69eO/8PEvk2j0Nx5K9QjJkvKZ8SL7NPwk+5QTRu5ZYYj3FF4g9k/xpvf45Nr7f5yo+1O4EvjYO7DyZOw0+VAjDveCUnL23qOK9dzsCPjbsEj3cnzm+ThSXvPBaKT0mXPI93sKdvBhDOr6bbQ2+qyMdvvXNMj37pqW9q6SLvZoycT1eNbE9QXpbPFbLFr4cCMG9weXYPSGuDb22mhW+HHQXvfkDrb20+/U7OnvLvTCOYL1gDt875+iOPEWA1z3gbg6+qAj+vXlpszyU3v29F/5sPXSPGr2fLCu+T3mrPEevEj7H01O7wjnlveZfHr6wfyS+IXGuPcGEDL5DTiW+MmETvqigNr2XBQc+chgUvVSqNLwB8Ru+bXKfvLhjpr1qAiC+CXLXPYyeEz2ePC89NUcgvlIVCz5JvWE8++5DvuNW6z0qwoc8fMeWOuFnuz3F8AC+xvetvRfvsj0BHUu+MjbdPFkj5D31iyA+5YYPPuf1xTvyvsg9j1QAvrlMG76btg++i5aUPYHF8j1HiuC9Y7sUvn4XBjz7FQU+by+OvE3fir2r5Bs+CnbXvUm0Hr0A78Q9tbCIvZl9V74kzww9WhOnPag1dL5+3oq8i2AevVkby7yxhsU8ZSqoPTwobD5L4hk+e6o1vkaXHj4uZXe+ikApvvaa1721zCI+0M12vtHSwr1Dmzk+HBTavdgAEz66XyM+/LfYvINy/bzIhw6+3ufTvS/Tzr1h5Uy9Pqc1vb4HsL2gOyG+ULeIu0slOT6Cou47b+6yPDflKT5tLwy9DloEPt6GQr50EzQ+ME5AuVVqB73lRBI+n2wVvdlEND10e949K4quvC9H9D2Ptae9A5MzPZiqpj0Xd2O96fLiPXX9JT4V2x4+l5OEPJsGKz5ycR8+dU0mvTnBAz7qtXA9mKtEvgFSir0/9Sy+TGfsPa5DU75uJU6+ZAd7PKq2gr03Njm9D4JWvvkLSr2wxAO+h+ICvvLM2T1MQay9C9LHu68sB77hW9S9Vxuou82gRb3RQIO9OpeOPVhOyrxP5OU8QGaQvR9ZDT5viqQ8OTMtvZ/8yD3wJxO9KiN2vlgZ3T3PwgU+lHsRvnY1sTwgo509n9x9PaG1kb09lDY+tOqnvTcrQz7eBiA+3JtsPk0KRr5KV6s9kWO8vbj5zr1tDBO+0qA5vtO6A74IlSc+kvoJPVxHC72HaW++tCsyPOt9Ir5bbO+9LkEKvAPFhb7SqQW+PWsFPjcYxj3Qzls99NJlPPf8Vr5IvdG99zz0PGcIwrySeuk9jd4EPYrkgT4L3LQ9HTRXvDxkqD3tsQA9mw0lPsu9ZT6tTb48O8RcPtXbBr7EuSe+ChQoPreOvz1vxAu+hJU3PqkWHb5ml6G6wM9ZPlZ41L0yhK+9GFshPoS09D2/hP4919WiPcP7EjquXl0++wYGPqINaj4l1f09Ay4rvaANsruZHKk859vFvX2A7b1HbDk+JkY0Po93QT4XKH69OdcJPpXErz0Qs7s9r8f7vTLkib35Idq93yshvnan3D0pMxK+std6vVAXuD3vsEI9MQ9Evf9+Oz6w1te94WO8PfFYDL2Cc2Q8dhhxvVarJj5+QL68WWCGPbLJD75JES6+ze8ZvoRHyr3zJqw8pb6bPcitO76csKi9q1cKPjc6ET7E7Ug+p0UyvVVoxj0gcoy8RwuyPSW8CT6WrU4+BKUmvb4Ba70MJc+8nt3RPH3fbj7Zj/K9bXcbPu8fDr7S6kg+2TL4vRKiQ7zDxeg93L8aPd5lILwooM481mhKPfFiKr72IEM+uf8ruvxjq73SxAm+52FGPvSAHjqlAwk+vD5Avc1gBT0Yc0e8TajWvXbJ9r1339a9NS0avnQs3j0dlvS9ug2QvYwyVr7YEDc+/zabPQkqTb7xLQe+l4DYvRM/Ib60D9i9mjWkPTMInT1GGsm9rswDPqOyzj2ZseO8i/g9PrjiwT3Osaw9KcALvkldxT006EY7OquYvb0VCL5bJCk+doKWPRY0xD2qgJa9OiISPcpbgr0Ftge+8hkLvqpCwrsB+X69pZCePR9Hkr0v58w9WUgMvmskGb5OgQ8+DHFGPhezED241Ra+XQ09Pr5K1r3YODo9o0ImvodOmL2sFRI+2dy9veCg7LxIOSA9eSt/vXEb9j3zSMI9WzOVvMbMHr7Ug8k9mi6PPHDHDj7WYTM9VsnqPJreUr4LQH8914O6vRlL5zzYa/m7RLoTvksmMz5ZPZ093Pchvrz/Er0iz2k9rmgaviB6JL4/BOC9j4vXvQxfIr5OL307dGShvV3CwL0Jcz49Dm/XOk+zN75pZd68UMWMvdgKiD35Lgw+/LOQu5fihz0HWLM7oD0CPp8LB76RCA4+4SqBvUV0sb1rSA6+GYscvnRBfT3zOYQ9krzQPXwcAz4mnCc+F+EBPu8JAz4rewm+hNRMvWTdrzzb74E9PQfxPPe0GL6cPMk9n9oHPmyt8bwO2Qe+Z8UYPcNNBzzJsLk9T8OlvTw+DD26m4G9FxcpPnX4oT3WDuu8zRSpPVKCqj0YXw4+7xgxPra/3T2/wQe+hQD4PRz50DwGPAs+Rb3hPaez1z3B8hC+qrwTvnPxwr2AOii+XlsWPSrHF73x81S86ssLvhfRK70KFpy91mMjPKCi6T30HFu9z13EPS1ouby+0Zo9mCIVvjshjz1ZKSc9x3oTvhvDEr3Vc589B/Y3vmzHub2acHu7gaaMvIjLSr43eys9FDdoPS/ylD36DKO8BU4pPdd9Sr0l6QC9AtrZvCf2vrssSx8+VmyFvUHlKD7wh3Q9Mo2CvczLiz1M8sG9BpLNvI7iEj0DlT89Q58Kvj14Fb5Kw7A9amMNviQmNT1xOzo9WHHVu4EoL77ZhkQ9Uq10Pee3Fb4d2Mw9GBApvfzR3b0DSh6+KsbhPTXBpL3NRAg+I9ZAvgqcBz7O8Rc9/6MFPrKloDwHDF+7z7B4vfCeAT4SISm+yYWTu5hrKL4x3wC+BLqYPdSUF76fEcS9aObBPTzoDT4sbwI+SR7bPCwPIj4gIBg+BB7ZPQYXiD1zdiW9jB5avfmCxz2+/Ta+48+wvdupWL63tgW++O8GPskgLL7+gK85VFVPvpdyIj4IvCq+AyWAvXc/5j1oqwM7j0r6vdC5873DlpY8vHD8PFMjOL0kB6E8FsSCvCjZsL1XSlm96G/9Pe0PxD03pQu9IXoaPrNrDT52LWI+tJIsvjycsTy5W2M8+s32vRfdVb0C1tA9xFF6PSotxbwCWDg7rGsKvsz3BL0QM1Y9AkcxvpOW9r3rtl+9EEE0PdQUZL02p6K8GOUzPgmmBb7K9Uo+/4XtPZw19DwQsJm9fesPPjJlsD0FXDY+qmnLvcHiJT7A3hq8oQoIPjPZNL2/6Be+r42rvUPgPr7NMwO+qQ80vQ2ukz2glva93o+bum3bPz5IAVW+MCskPtCBGb5DpLM8UNoTvn/CG76SWp48xpsCvvrkG741kx6+nm+AvsP4tj1i5B6+z0pfvttUEr24XPY9O12LPeeLG74DMRI97bvZPX/0CD6TPK29UtfpPHfFyb265q+9OqcEPtFrZz3Nq1e+rmi6uziajj0Mbho++0UXPonBhD0eUqK9Z9hfvUE/MT4uOII7dEooPZf+1L3FisE9Kzz3PTeVQL113yG+yZmqvGc/Ur6E/AI+9p/VPWanNT0q9Su+/HKevU8wDL514TM+kXX0vS+sXTtzeNq8a+2iPE1NUD5IGZ69v1R/vQRbpD1LXDO++4IyvddTBL6/DD4+hac2Prmv+D14kLw9GSwPvguF6L14Vre951ACPWNO9z2QTGa+OALuPRVWfD0tu5W97v4QPoeOzzz4ZQo+jrRJvWduHL5TR5+9OHJVvheX+T2ykoE95H0tPYC9Kz0aiM+6TrSrPTUVVj44QK+9C1OKvd+U870E0YA9UksMPUr47z2Iwdm9DmpPvvvwPT3DD8Y8gLM6vmo4v70USjq77k5Bvhukp70TWy8+ol85vlrKQz2ChrG9U7RCvQxcNz3onau8HisvvQ3Ixj3oFLe9xm7DPQ00Ib6DPB0+IooWO7BYi7vp+qs9eooyPmfWmr0W0Rk+YywtPkIVAD27OtE9wofxvUHIrT1jwBS+wjgFPtPOEL4LvQU+NVXXvdKMxj2qe727nXYkPe8gsb0yKgW+2Q1fvjdQbTytQbA9cL0MvsALWj1JtH699lbbPQ1eGDwBOxK+pfcrvVGFFD4csLI9M2xavAYdmz2lQBO+NZGrPHUzNj4pPCQ95bLPvOYJtz2kSlm+IoYUvn7KL73hvjO9rh12vTeTcr0pBTG+FGIKPiNWAj6UHvW83OD3PPzIKb5H3xW+TDvVPY/V5r0vRkO+ofZHPbEfaTx0B/I9XeeEvcI8Sr6539g9qY0ZPl5Kcr1jrM49RYL4vTvNHr5bcw++MMguPs0CIb4Thxq+izavvd430jzy4Co93qO+PZq9Bz4dBhc+9z+RveMkPz0PUVi+n3mlvT+YGb4pLii+vqa4vcg9A77zOKu9dLpZPYw5Nz1dtYy8qJJEu+UIpT3cPPK9LPgmPLJPdbzrNty9XnH8PFYASj1FXbO9sDQhviMHhj1mNR0+L3P7vYk8Yjqahpi94uvtvUY0ET7BTa49LUnMvVFVjr0pWjO+eooPvURS4zwzk2e9o+IBPpDElj2meX69I+ELvYY8NT25nsw845YsvrbJmT2nnSW+C6byPJXWdT4TXlu9eyA+vtFv8D2yNJY9eLm5vRRECT6/y6W9LJFUvhjxt72BK/0843IGvnCWUz6Agiw+VwvJPKRwwj1UtQK+DQXEvTl4Yr605QA9D8S3Pdua2L0soew9MYs4PFq9LLxF0l89/NJRvhl7CL1sGFW98yBcPb+hTL5w9as4jNTtPabsED4W5vA8V205ve9k972Owwy9Ilzevav85TsEWOu9nbiZvN+z5738PUm+/rq4vYcyJL5PruE7T15cvI9mJ73yR4U9UOdoPTlqlzwFDtc9c2ACvXFrUL36X+K9uG4ZPk0KBr5wqtc8a8gnPkLVSD1/7uq8y2aZPU9aLD06G4g8saKpvQ+9Eb4BU0i9UcFuPRh29jq/oGM9UFmhPQBnPjtgoRW93Ks8vc7VY76Bc5K9aEzAvfwnfj3lFYA9NOVqPbWRO74jaPE9bVrYPQK11z1PgYK6H5RjvmZ06bw1Lyy8cu4qviAgZr2OC3A9Hg2QPePLiTvUqpc722kBPt+DiT37r+G9LMhaPYyyGL4cVS++EKokvnEALr7++Lk6o1cOPpp1Fr5JZ4C+SEX2PcW3PL6xkcw9SdZLPWzrPb7guyi9tu0TvEp/O75hZzW+pfmjvditgL6KtvM9J2e/PWnsOL6k1zC9GslBvXZQijzb+r88KdcPPk6/q716O5U8DkUWPkkgND6VXSm+loKAvBWkHT62ePe98MwvvpYzn707+PE9C7qTvZRIlj2xtUy+R5Y1vbRcLb5ZF+e8d6+iPUk1jr2qoEQ+26p3vTxkQ76rrCg+jA45Pq/81T12WnY+EiE/vmKIRb3URky+ZXUHPTO7tL0KsM89o+FrPN5oHz4TTQm+NGlGPRRWb71whjS+oW36PY2ZkLyNcAC+W0ofPpeXAj6MDL29PCEGPg57KL7XiYM9c9LuPRwe6T0qLBU9bggIPq5ysr1W+YQ+b7vzvWiyKz6S1D67gpZ6vdUZIj787SS+vTxGPlWoUL4qIZO9j7vOPBI6H779rv+8ru8IvTAnGr06UOQ9FA3zPdrCYr6nqGC+xMwZvkd/NT0P9UM+UIw+Pa/7qD25Vw2+HmyBPmvlOD4XaNK9guKGPu6kAb25M+e8t0DcPVzNYj2d57Y9+eZBu1at2r3H4QW+NBPuPdoXW74lQ7U8aRONPeEOsr04Ebg9LcHPPe8IKD5j50i++eccPsrqAr5lhQG+9DpEPu6PiDz2MhE+61zSPQ1VhLx7MzS9a7EUPrHJrrxtrGM92sDxvX0mLTzXVMU87QXaPGvs7zzBk4m9h2CjvU9nAjxeIi6+KRghPrFmPj7T9Qw9VTYDPkz+Ur2ZFpk9+OCCvU32Bb4VjZI8E1H6vSM35DwSH+a8wOXJvYEvd7vBQ0u9QrMLPbNNfj2rrfa8lPQdPmnRDL50Jku9anXIPUiiDb1OC8S9XyhfPQMmKT2j1o09HRtCvilRxr2Tp6c9Gu43vK3gtz1g9CS+ln6GPFmtmrzCGBy9YsMbPriM3b1GzCi+FXTwvYehFr0l1NQ9WcBCPCUVeD167zu+Lt/fvelGBb75qAM+hHQCveQ3Rj1xcXU9g2XGPMnfGD6KgwE+ebhSvZ3WI77K4/+6ScOCvYJc3j0IvzC+nYIuvirKqj3LnJ67PjErvtjfhz0p2oK76UuGPVgRqT1+kx8+HYcVPephIT6HORc+jrnePG3PFb5jIRk+sgYEvbfSkD3mESG+SMK7PVKfpb3djwo+GkVsva8QTz3yEvm84XMCveQs9724pCG+X50jPtzZ1L3vWz6+ocC+PVIKCrzNN787//I4vlHbMT1mjzS+Y+AdPUURvD2Bpqs9LUolPW+4o71EAyG+MrAqPY8IMb77ozq+KeKsvXCsQLy7RTk95zSmPVO6GT6Czg+9TUcou+E8vj3pHao8SJiiva0NqT0W51C9opqMvd4sE71+RAc+jNKLPJ7MFD3H6TK+ndbHuwiWr720rGa8XJw7PmSTBT6WEzs9q+yOPRmZHL7Yw4S9yzq6PRQT2D22s+Y9sySwPfk+GzyMdBA767muvevZrb3s+iI9hVAzPsbQg7y4qM+9h0ilPSZQuTxM/Po97aAwvj6tlL1IAra97xZIvmmDlj346VQ+NFmMvXOriD6GyaK81riUvQpVDz1mZYc9ukM7Phy5Bb4rjDG+XNzGup2wFTz99Dg+mC0avq1DdzvQS6a81dWBPKdlw71+BoQ+dMQsPo9YWz65+TM9qagGPlNFV73lYmO9+1PGPdwr9z2Ag4K9nNdQPffxIr7fVe69rYmsu+uZhr2NIzI+5gUiPoUDoTvzU1Y+iMHRvdWWCz41pxQ+EvodvpRJOD6OKiq+NqbbvUo6m71fkgK+mSEIPvbuCT4WKom9gM4evR6lwrvf0+28r9oiPZwxgD2ZaCK9gYAKvgQVQb6e8LY9YXENPi3fRj0o2yS9r0nEPW7w6b3tbiK+xfDcvQ35/j2rQzE9f4hSvF4tsb0Rf4Y8+DRHviDqBT5URYc9VUAhPje3o70uy2w+6y5UPqm1xrwpXOw84NlSvU9VYz2FQ2Y732stPch8Fr5vRnE9KmpmPniSCr4doJY9sXrcPfboR76krQO+Bgv+vZM5ljwIZiE7liQSvFlYq7waMd69lkY9PUzG6T2PPPs9OodPPmfawbybs4i9j/qlPQ2uDr4kLuK9fjU1OzWSC76sAFc+5inPPWLzUT66Qh09+hQZvVqVmrt6Jns8xyMJveKKOz10oJQ8Mmy7vXrIk7yu6x2++VMjPidB7r3PrxK+FSELPowdGb5r+e293mq/OxzkMr5YDuA8oeMcPsaxET4MWAw+AWKrvUv/NT4KviY9x+1BPRn+3bzPxyg9H1FRPQKCx7wWewu+J1ZMPqH6AT4Y0Uc+8zj6vGtbYT43cL29ApDnPFdgHr0OrjO+aCJPPSPH972CZZE98sY3vkWZWD65qHS9nrIRPqKVO7zubw4+d2yOvYzzOb7AWJg720wDvj91WL0skF4+7sCNvReeMj5S8g2+TlG0Pce+Vr3sgoy8+U7TPUZd0zuTAva81yhkvU8lDT6W4Z09RgbxveOS1z1a9cE8HxSCPaZ+u7yYjeY9O8LCvSD3JT48zTE9i7cNPptq07usVwI+wJ6WPPeSpb0NMjg+vlJtPtv+Kb1imDI+PCz+PTAQBb4sOSU+uoekPNuhdT1ubBe9r5SvPLNm4j121gg+lyn8Pb44Yjs5fzs+FbRsPaTvND6v9js+F8mGPV1REL7BcN69wvKcPRyDhT3jvd89YYKvPXTNhb1IOM+94N8SPblngD02Uja91NZOvaHWzDw9J6Y8NW0dPqdEGT4FcyA+wIQhPpma8b2+PT6+ucofPunhA74LURw+/XJOPTwv4z033Zs93D0XPjuF9j1oN8k8NL4PPjAg5bxiWMk9Rs3XvUMvSTtRfjU+TDFxPU3zRz2KLh+9QYlzvI5ssD04Fb89oTZGvsrsBj7pmfG9s5qpPaCHdLxf7w6961juvZ5HfD3N4Ko9vVDyvOwE4D3OxlU9vEoGPsyeAL7zthO+irPuvV1aP70ZM++9rxqbvX7BE74/Xbs8HCJvPUaOgrwXw1c9SKK0PRpbG77y5WU8yVqyPWYjsr1iryc9+3ErvjPR5L3+pUK9nZ/FvRTY4j2eUxM+iItUPVn0Sr2zXkU+57QVPSEzr71LmaI81R3svGERNL3yXxW+6u/QPTBEGr57zTq+0j88vWr7Bz1P+qq8aSEjvVkO/j1B4wc+XTwIPq6VkDyYX0O9mqroPeGEsjyYo569TmINPilnkzxxVMQ9jb0cvng4YD0qYyQ9YrgePokqkz3QcSo5aXjfPZgl971t8g++mlorPOv5trxnjZ48pL+8vdzi5r0h9+s9BR1TvSAGCj48azO+eEgJvqp4Cb0Ca+y9/r/oPWKeBr7e8co9WY6vPQjJGbzYN9u9eWTiPUQMqL03IWw9jTTmvSTB7729TjO+L9zTvdz2Ub1qQP2954RrPVq9UD01mSS+LjjIvZ88Dr6/jSS9vbT/PZeFQ76C9Ww9IGgivivPLj2WCDI9RhUyPupbQLs6ccw97pkBPrBWDD67Ob09ZPwevSfGaT1qfCW+mnPJPTQ+NT7K6tU98GsVvaVmRDztBMm8jaaovaVGBD6/ZRk+hapYvtt7lL3HQ0a++5PIvGvpAD4xlQ2+2XomvcIYJL4K2tW9B0AXPohBK77Mwj++EkmlPWpKPL4+bPE9FNgGPj5XYD3jgtk97zCRvJSQzbziGyU+ZW3WvFjS1j213eY9LmIfvnS/Uz2FsVe+lkBAvrQzrL2+4EO8JzsNvcYR4zoxOOS8NbltvlDWhz2VIC4+BptFvgQE1LsMkZo8pLRivlbI8j3K4bG9AQeMPTqE5b1Tkv87yw8tviRAP75djlY9hcv2vdaa6z2mLuC9GPj0vVVY1bz6tvO7FqjnvR5oHr60Lx8+g2ZrvB397b3Xx3888+WOPU/9rb35qhS+q6RRvfIYQr5jTJq9yp9YPfltAT5KnC+9cChduiE7K704UIM9HOsGPrHcOb7s/ta9vyjxvToazz01oNI9OgSCvPP7xr3HOBy8V8OoPY/E9Dw4MR8+INcwPjRlUr5j06m8iNjnvX6bDD4EtyW+h/FnvYlbUj3Nw6U83a0DPjfiAz7jtR6+yEa3PPXt0T2Y7ie+rOEHvavGXb4eHVy+6yoUPs1+s7sR7dK8IrsSPtzIKr0Q+RY6rbIiPZu2Gr6CTsW8hPP2PTSzDr11LDc+UcU4Pmv6lT2/7w+91McxPl6XAz5g4l++7/d6vSLmgLwh/wE8NjnBvZga/L1u/lO9IXyCvUOAu708qZs9TJVNPtJ9Db7dLSk+2BzOPQiCF7ypUx0+TDZlvZyjtT3QJMk91DQvPuDjQz6OkFQ9+vWnPZHsoT1IaVS8cc+jvSIxaD1MjEU+8jwjPvrAg729nBU+jVGauyx3Hz6J5ya+uAwTvvywLz4xSGc9PiIhviLo9zwFgwS+uPXePZba772Iqxa+cq8rPC/BxL0Ykjs9i1P+PaGcA74UyCM+dOo3Pmueor0hpRk++oYdvQWUFjtYWl4+qbwAPiU5FL4KTo0+8U+HPf6dIj4dkaq7pBaQvHq0ID7hZBE+Lih0POaIOjxAZnW+BhU9Pg8BLT7fOSc+4rKxvUvYfbzYRVO+mi8XvGmDVD4CPIQ9z6WBPmRz7jzd9eC9JMwyPbMAhz24anC9BGpZvTieIT0MOM29+RxLvNQZgb04w0W9Pkw8vqEvPz6veEu9EGMxPaIbpT1Yh0S+6k8zvip/NrztZAy+ERIKvgHsZj1TEgg+7V2gPcBi9b0oUq+9oPAovRV1xr1FAuM9lDwIvkqHbb3txl++cpVVPguBhD1IOR6+v1sEviVPsr3XJrY9zZsXPdRLQT0xFCy9a8WZPULFi73S6fE9I3ftPRMZ0bygceW9WNkAvoHL3z22WYK94yN9PWHBF75LwAu96KhvPccFPz0TZ8G9ickfvtWgUb6QV8O9VMSdvSC+3DsSAwy+0h8HvkcWgT16BjO+PrSSvV3OFL4EyQ++gx/RPbRCGb6rDZo8uXlzPJNB671crSE+RGUGPgsvD73JppU9PYh/vU5vgT3rZQo93pTtu8VoybzhfgU9LE8WPToZy721fZu99AOLvCwbJL7p/DW9/Ckfvkn937086oE8yWhzPS9NBT6z8KI9fAYMPsssZj0ytHC8zAUGvdSlxb0YT+E96ABHvj9/Wr1qfNy9LurGvQU/Bb52g/w90fx+Pb2kST18db84avWbPHxQq7xWsFO+usxnPT7Jgz2/Gpa9b9QIPtgeiL2GWo89FdThPN4XC74hGus7Etucvfunzr0zW6S9+RMCPgGCXj0jYvy9AOSqPSgDhL2v4Oc95GoavhLrEz5sKeO9iJpKvsBc0b0+MuS8OUK8vYDbIbyO1BC+qahTvlLho7wMDNs93jnhPbIR2z2yfgU9Ku2NPdjrDj4RUtC9mtujvIqZFT4tl/a9OeCfvd7zRr6NNQg9yKcHPkbjHD2N2h++9q+5O6UV6z2TjnW9lbkPvRvo0ryGPVU9X2EUvqy6kj3i3S2+XW1JvgDZJj1qhO89SgpVPieuNj0tCHC9fpU6PJGSsz3t9pG9bbnbPQyEfT2Sm5E9QdvEvU0MF70oZyq+lhsSvX1e9Dw/S7k8yPS4PdgAHz5QTxO+NKk7vuWU5LxDqEi9vRMoPlLiHD7Pagi9wOzmPWuMDzxT6Rs+21/QPcfaGr72GF08grZJPno8HL6qiwI+OY+Ava0y4jxT5wQ9CgAAvuu7Yr0aOag9pzJ9veQ2Pj4T4DM9g1VUvTeu8j2tjTm+83VBvRsxEz1EJNK9nEuZPeLPvb3onmI9dynyvVQcq73uUmk9DIcHPoqqGb7pqje9NXNxPViOLD7BaE8+MdvOPXgsTj0t8HA9t7rHPWYcir2prbC9m1HMvRLtDr22aOq9wOf8u6sp0r0kTm498xocvo++cL3K/dK8rOe5PMoOtLy3MQc9VrI4PWIsS7xj1Su++oQTPkEUnb3oxhm+AnLcvXKOR70o/7o926w+vuCtub2aLq09ugn1PecOFj4DBIE9vjTzPWrxIb4b4A89IwXRvfCVBL1x9Ck+mZcMPn4ZxL0VFCk+bNC7PAfGUT1/7Ty+8HJ6PcnXrL2Yo6Y95zrtPaPZwDzCjoQ9IhsavdjMCj01aRO8XHtsPQN7obyFM9g9cwcJPtIhKD1nVd09Rj8XvWjlbr2nUdE9YW5/PSF5iL36lZ098hAzPgc4k73Mx0I9N/hnPQSOYz7BGww+wQbqvAvUIz4Y/iu+oTXEvSCoij0l/SA8gE9JPe6L8707lBA+9DFIvbnvgz1LVAC+/wuePWga070i1b09HXEcPuogKD4BCuk9EO4rPniT270f6jk98/XpPXYRgj0ih5U9R1Dtvcdm1714nDU+Xm2KvSxAUj6QYGA8ACHhPSdbrztMZ+I9di6/vZwU+T1mLIo7INj9vekEUD2qmVs9QskdPYeUQj1ANgY+iQgEvs7LoT08NqS7cf4TPdpkFj4J9Sq+OMibvZ4oDj6/A629y7M3PogFrbhmsDk+dVwSPjTxwT18Q2S9UkAfvvz9KLwFnLe9h7kgPlaGUz17TEM+gBScvU0KWj0XHKc9WCW4vdv7eD38Ac29OHBhPbHSM7wlsyC7XafVvfoI1DwikNa9NLhVPVQ20b1GsKy939VAPnpLjz1C/tg9f9CVvNUp9b3vLco9VFYfPNGJID5Qoza+RLhuvSayar3duug7SWFBPia6kD2d4kk+epCZOUZDtj1Nxto96+ZRvakfFjvpvRa9G5O1PVWwBL5DcjU+uEupvNR5xD3dD7M9+4WfvU1tmz0AFE09jV+NvT16CT415Eo9mBcavae2WLuHmi+8GdXmvd+OUT2Ifq49jf3wvXgquD3rmZo92LNiPgxWp7wdkCM+G6urPdw00jsj36u8nulivd0syL2wn7S9vASaPdD8cj0s8689RRYAvhUo0j1oD6C9N8APPEfnF76Txgi+L+quPI6jzTtQHEk8/hjtPV2i6j2ozJs9pvtZvZ0kWL1RzJa9EFFHvQAVKj5YPPU9ZyKrvXwwt70woRW+J7eiPavqqD3kIKc7zIamPTlXBTz2YZw9LjAjvgj99zyjb+W92oVYPnMftT0/qH29tvWcPYiqKT3TVN+9seQDPhEg9r1rrZG91V/bvfIgxLx8n4K9embfvYT9dz18Ypw89dAzPoFtBT27lDW9fraUvQTxLL5U/g6+qKaHPSrRkjyl59S9XWrzvCRHa72OGJy9lgJ7vTvPMD7Fr/W9pWXXO6/QBTxrO5E99lAQvo2jqT00W9A95rZYPrqfLT4Hk+I9d7+gvFWbtbwaC289ZQLBPcgUTDslVSE+6Dk1vhHvwD2Rw7g8jU6FvYkcCL1tqN69jXEkvvfzfL2jFUO84O54PX6Sqr226Qi95fXyvXDCfj21XiY+amyiPfN0Pj6Gk/08MggYPfQJdb1RjAK+D5Ygvi4WiL0FWeg8Uiz/vW5Xpr3UElM8R6yVPI7x2L0jEuu9O6AVPjwHgL2Vfpg8VXudvFUg8L1Sku49GGf0Parnlj2FiM88+5LuvYSDTD3ftBW+t8cMPvjW2Lywpow4C1qsPbsSmL0iSUC+R98sPnIcHr57Y9i9+nEGu4q5Tz6uRRM+qg6dvLMCED7+1y++aETMvRcHd7zQxKm9TA+tvNBeJL2iQ5i8QUrpvXWeCz7q1xu9CQEBPg6yVz3/AJY99l9mvSDD5L3g4y6+4r/GvQmSjL1bZdI9oBvjPY+h9r0mcXM9bNgAvrHRGT5aOwq+pBglvFl43bxmio4+qqE/vq8lTT7KQEw+sm8ZvtUNNb5gL5W8cXxAPu30yr15TJA96fbfPZAnCbwWcgE+UUiXPJzxMr4n5DW+otREvtu9lT2wNRm+w8vBvTGiCj7VMty9UykJvSzYPb7Tjru9GjGIPBO8Q71oJls+sKo6PlrJUL7SvoU9P6rLvd2YRbwQmBM+5nJHvoA3wjuHBsM7zbcfvnPejj0lxNg90/ZrPIgY2b1UGtw9KCC0vfAoiL2UETW+JHRtPTDUCT6vlGy8E9sXvsvi5b2dy/C9LgO0vJ3iJ75bDg6+fufTu0nQ7r0Iehg9XFQsvi4DaDyieJO9Uw3kPagCIbye/AO+0xVFvJfOCr4ddHg9dnfsPIBBRT6fuTk9jjVHvmhtGr5yIi+9GdTWvVxlNr4M6jO+haYovcSU2L1tDzC+2S8sPrc43T0/kGG+nxgSPsqdSb7CcHc9WaEgvb3rtzxZ+qC96wVuPmtSmbzmHg4+6zvzvSKGKj4vviS+3ioAPpmD6b2nu/W9cawrPsd/d71Gbga+uS+Svai3hD302w++WVVOvhfxUb6eW8G9v6EevkbTbrx2lDS+6aZfve8HyT1Bh/+9/w+NvfGni73/PzM+/bGLvUZhB74V0jk+EFtQvWqVBD4GjBc+Uc4QPad7AD7Jup69QMdyvvnStD0UAJm9EUGMPSZFxbv6igu++YQdvUm//j2u4/o9X09XPVNH17019P+919NOvRWpwTzbg989IVKZPJH8nL16tz89KPaePQcC4j3qVau8Kt1OvRoeiL0u91g9iZoyPiuaYL4vyR4+dkIFvnc0h72C8Mo7DpgBOxFwWL4LWFY+FdLEPcNZ3T0XuSG+zpeDPWs1UL6pfCC+bZQuPhTi8L1W+Kq8mqpBvTC2wb2ZxUM9Mk4JvuKzDz3pyR++p/JgPnclHj6pSxU+30FqPSsgGD5wauQ9pV+xvZYPZb5EjZ+9aDKJPYpPJj2oQHS++m1avb+1TL5KbiS+BiAlvoV8KL7aylK+v9A+vl4dVz0mQrw5oWtHvsTLeb2mMk++uAm2OwxZtL0+Dru97hgQvX5HBr7wUW++KsdXvnuuwjz0woK912WBvgKXbr5sAd297hdSPg0x2DqgHps9VvcyviWgPT5dgme+/Ab+vCA+9DxHexw+SvKsPUa4h713emE9XnysvRVVczsG3ls9PsaxPNdM0T13bsY93LhUvCjI0jzdrAe+kNUIPnn7Gz6O0669eb8sPpwLFT4utYi9mUYGvVcEST5lTnM9anwkPn2MIbyCUBO+JkugPZLGAT4j0r+971i7vciK2T13+gA+QJv3PQhGZz3sHgU+otHDve4DFD4YVoY9NjFqvQAD2j07pzS+uV8Uvc2Jxb0GvCu8V/KYPcmKnDzc/6U9PvcovvjbvD1i8E49q9kAvvavhz173dy9dfAWvtBfgDyA+BU+5gwkPvgOwb3n9+C9bSrqPWNzHL5yvzk93uaFvX1QQ70DGv296WhLPeXSJL7ETno9Qxs1vdlBGz6VhDS9J8AivGEY4L3aIiA+KbxaPSOHBT67ecY9AQCpPd16AD3LGsm8AYUevs5TMb5rCiw+SBWpvRGdKL4VOiE+q72DvV8f073IHQo+bCiqvSkZHT21Hy2+bbAjvlhjE70id508d0UZvgX+Db75gQ89wxYGvlt7ij3Merw75Ki5vFshuLyz+us8S1vePTt4yb25Ore9exOeOwMlrb1765o9Ln3uOWu+3r1itJ2810UWvolGz712Onu9vvoSPad6UbxAGLE9C9p8vbKg+r1II0A+j8cwPknoDr5Bi8Y8R9XYPVPnlr1vD+Y9NhvzPefFd72qywu+4Db0vffXGz5Pj9Y9yyoLPrQSwTxiKsM93KqGvEBvp70xONu8uLySPJW55T2mjMU9Mw8tPuFZnjuSS7I952edvfFjIj0KiC+9Y6sXPvBa2L3+yxo+DTyaPTQdyr3mgK49FnM0PgYRMb6AprC9O9kEPkGtv738ums+xaqdPN3NL750PBY9rtYqPflNDj4gJrM8JIRbPkjvlLpKAa+9ymjCPOmIwb0P4UU9VEmyPU/9KD7rOCm9LN5bPnwlYD5HJ5O9ULyVPfqPJT2Ho+G8lMUyPtjLIj6HP3M9K6kQvgh9ST3uri0920+PPGPa/D1H5EU9F8s4PRxARL0oez6++kbAPbrunbxUiJs8Um+UPTDzjzxz0ve8IurvvamsrT10VVu9JatPveMOGD7LQi887W3IvXxyFz7KQP+9TQdMvvOtlj2l8Do8WxXCPBrjKz5LShU++ChpvQDOSr4P7Ck+ElQGPPptGr0QhbY9x0cAvkUzK74mwk69iPD6vbEZmj0CwUk+kvyqPfzXND3pJAS8/Au5vAD9tT2cJwC+PlxivvRjkb2KBAS+RfvxPctpVz1KCPk9srNePNeBqb0WQ6c92ywPPpalUL7IRqk81dAwPgiLPT2gwm48604gvlUOCj1W1je+VqVDPmIC8z2gW7G9R52HvarWYj54rRG+2dFxvKWATz4Ce1O+O7HVPShrOT3nG+C8kjMKvhrlyj0QUsK82zS7vCgUw72sv/y963dBvkre3T08Y8Q97nqrPaYFlz3cbN498nXyvdbrNL3hnr69mh89vpFX5D3iuvS8jnsMPlRVEj6nwp09RA+Wu38ww7yMM9S9ClE4vbCvTL7evDe9bFAxPRHd3z3V7Xs9PYO5vXUsF75bWmi9kHXzva0VVz6KR5m93tUJPQrBQT4K0hi+ZHznvBeLwr3UpgU+E6UWvu2ndD1CWWY8Wo4TPs+dNT6YvCC9SJVuvatC871McIi93vN0PQNcYL7q/he+nW5aPhjuO7431SE+4S5hvMEQoD0WzF+9F2PxPZvPgD2Ol8I9XzP1PPK6wbxDOL69gWZHvUKx5j3Sbru5yzodviw7Cb37PVC8D1ZLvvN2aL6SK+I8iukPPQjcAD752BU8f/5jvUiPWD22zgu+A50NPnC9jL2aLzQ+ehLZPdZbsTwm5rY8VjrLPXjyGT6rlQW9OqgPPoxCqD39w2k90j51O8qthj3IFeG8an7QPVenJT7Q51A+tuECPqTS7z2eDYW9J5bcvNO/gz0KeDq+kU6QPe1PIj75GxM+gygiPaMA8T2qFm+9uixsvfN7cr4qlvG94MYTPRQB9z0Zv069s1IVvnwbPD7y/dw9QfkkvQ8Ijz0MNMa92cWSPbqOFL2KQdQ8X+0QPlm3aD0f9UI8TWyyPfMDnT3wlUG+gFgQOVU4AL550zq+BM4Kvj+XVr3Jwna9YvISvp1cID5L8dM8mM2EvaT0tL31CiQ+9TESvh7yBT4LGWq9YKYPvZ56070whQw+VcgDvv7UM77eawQ+xa8YviCCLr424RQ96m5Cvuchob1280k9bTdZPRRN1r1z4O09qfduvU9At73wGQ++PYHxvcCcmr0MVuS97l7avYtBy70THEa+A6sOPt023r1/pOw9DGEhvod31r33YyQ9dmEuvsugA77yfAk+8e1avgPGCT4rSZC9BiaJvV1B8T2rfOu9UbUwvrJ+1b3ySbc9WpyGPfwE6b0HFDk9w3FxvakVOL7cEgK9QfoKPrHATr5sqeO9VXuhvTbcEr7iJi4+57WYPWXQDL5cTWq8u9IYPibu0725Fw8+tuAdvirHXT1z2zc9HDSuvRc5Pr3+Tzy+ukyZvYtkfjwSJW89TbprvT+GtDt6F9e8qsMRvpjngb2rAgQ+587FPWelsr02W1U9DoE0PhL02b2D2yO+dzMxPRpdULx6Clg9lt88vjvZS77rtha+/NcYvsLz+700vNa9hHepvP7ZfD33AMS9z5GlvLvAgb1DFyA+2uOnvSMOHr4RyII9SFMSPblPmLyOOtK9bqnnvbbRHj66XB6+cfepPXMdLz1RMys8mTPPPQT6sjzg6vC8nwIRPvOZAD00T7k8KnPPu19zPj6wPSO+TxgnPEzEaD33b/87/v8+Pl5ZoL3Eci69QpMavgW/Jz6lozg9NHJiPkMyMj3NTiK9W/QPPlJL0TygFIC9ODqHveNTuztqbPW9HT/DvcU0oDv+zEc+mxPHvdFV2j2WUCY+qCFUPSlrFL56ZwC+ZnCEPRusYD6UHBo+RRESvsKmCjzF2DM+QqRBviY3zL3tMS0+lQcGPrnKz72krbq9Euo+Ph20pT2MXrY91/nXOiC73b23ZBe+lmSGPdZBDr0wM+m9SX/pvUVtET7RIcs9I5oEvtK8HL0R+Qm+lAwuPhISoL0PUxg+af/UPXNZQT0uaV88pCgPPpPOCT6PMAq9CJC+Pb50cz1v22K8dCn4PbenzDuifva9EcLAPO7x7r1dOf69K/n9vVHV370W3wK+H2A0PZyigL1YgB8+4ToPPuCwR7gnh/A9guFpPermj73VZBG9BqmYPSK8FT7s07o997tVvS4Hqz36IxW95pTAvTvzGr4cN8C9TjWVvfA5JT6I6hM+TSEFPgKOHD5VMQk+wIGIPdpoDz6yG+U9f482vtYT4r2bBxO+P4EDPt0+Bz7nHsY7VWlKPhtXpD1iqIi9CYMQPj7Gyz0mJBM+BFQUvsTvDj56W+C9MjXaPZVzEz7pwQk+t8AyPhnLw73pnxq9ibx2PgNDKz5VLqM9C2vJPWRKmzyOQBK92trzvUWnDj0aPsM9KhXEvVDUCz1WpPW96tYDPmB7xb3atii+gQoQvmfKGj4pOjI+22/ePe8o1jx8Lme9oiWsvZERur0SjGY9nZ7KPVKZBz5yFSS+y0/ovW22GT7v2UE+lW0Bvv4W2z39uWQ9s76KPTvsPj7ebyK+KoMTPvICWTyBpk88Wb2PvD2tyL3lqq698QNivHFLKr4H1ZI9OKFiPUEAKz5GKo09yf3mvSdDKD5r4Wm8h+6gvbF4vjzx+P09mkBzPeiLnj35/S4+AVgrvg5vWL6BKiO+O5CIvZgNorxxI58943G1vaG2SL5ZNgA++4EqvkY1gL70qCW+pYs4PW7/KL4mfwU+iApVvSv6oTxEq7q9kj+PPdnZB76iqwU+zFbRPaFJt70N5v483OEePm5dpjzIvQs+h2jpvd3tUz05m0m+WY/dvWul7rzDRX09WYwTPo/mx73K0AU9fMZuvS2nJT4ww0q+juaqvULVB76XBOk88XT8vdEIJ7vtdBM+HkxtPRIU3z0V+AQ9yF/FO6iMFb5UDxm+7TMKvgbivL1/t4y9ZgiaPdJgRr7tWQ49FuFjvUONur2Nnds80iT7PK5gNT5k1u499qLEPTpecb1vWwI90Z0YPs/Pqz0xq+k9XTycvalT3L3QOF+9o4viPTNgF77I47o93o2DvW87LL52Sx2+rTwVvn5OzD37rgE+IlXqvUNvmrvoQhq6l4T2PG1ePL5Lf887yCuOvd4IZ73tWYK9RsfkPUiyCD7L4Iy8hIX2PK62kruTvZC7PbzNvdUU0r2+FoK96+8Qvt5nAzv2Nig8xxrRu1M91z1F7BQ+wy3dPQIACTwJ+bs9qDx+PbPIBz42Zf+9PJK9PCR+Gj7FrPS8VO65vRrmRr64ETG+dviRvbW6hb1DHfi95OACPvSjjD3V1549vU05vl7EyD0aMOI90WkCvopLyz1ZFgk+WHMEvvMCCT7O5yO+nrvDPHmtND7fwz++HCw0vl9dFj453u09Js2eveOpqz1KxeA8lc+dvPAKfbwjyAU+oY7QPUz4bruUdm69GtsZvhs5Z778Ou89btIYPonJBr2ZS368qCGtPFmhDD5p+LO9ZUH0Pbocrr3qNF09l5q/PZB6n72aCCS9H68Wvmfalr2pak6+tBy6vMG18zw/oUC7vafNPMsRQL7N8gG+t++FvFF80T22O/e8T5moPastxD2s+pm8OyU5vQnadj0uisC8mB4KPjgaIL4EMC89YVUIvShStL23d5i9ht/3vbP+8T1prFC9m6WSvc4HjzypNyA+VSUfPvtKQT2pawM+oGDgO3f2E75kqvi80XD3PQhA67rYyX88G/8BvvoHjb22nXk9vwv2vaOOLD4W6vM9o07iPRR61712TJC85xnbOzIyJD7xawo+3LkqPuplY71hGA4+XweMu5VrEr4F+Ew+7f0VPuoZtjvJfe49BAa7vd8G/L0gBvM9Gpl1vcAfHzxPbhw98TbmvUeyRT2sPzM+OjM9PWbE0L0doh8755+YPaBLu71X/7u9Sm5hPcEVTT3j/2A+12dGvSMP0b2jnTc+qPtEvfcHAb3kswu+7IAXvPBcJ757Jp07c9HePFB/TD4P/AO+2QbRvDdqGj6uWJa9XygsvavQAL6tjYi9w8XqvCYqBzv+ryY+DXOQPYy0PTzQ+tE9BMCTvbai5r3SgWo9mmv9vYR5QD39buC9XWj3PUD+TT5g1Aa+GEyVvXESHT6RxUi8jRocPvp6qb2qBjO+Zh4jvohsBD6wd00+F9mVPfBxgD1xZdI9ePSsvY7eHT48Kec9gSQVPg2aIr3KRi29RiIbPkJfND3Or4k9YVuFvWIWsTzpjx++Z6lKPlS2SL7MizG+Fhi8vAjYJr2owO08m/EFPmxRKj4TmAa+iP+mvdud5r19wuq96F0pPnxSCr1VcUm+rU2NPTrVPj4esk29DEpsvQJSxr3hDzk+LRcyPtLHQL0IO2o9ljIfvnKmAj2ckIS9kIAnvoUX2T2y+v29pOC0vaOGj70se809/fcDPj5wzD3VApw96TvxPW7KnD3wLS8+QKEYPuVHy71ZiT0+/ccnPrA2oru9+r+9mKQaPjdbzLz++Sq+9U7pvAtSwD3cKhI+6DfQvetbsjpgoZO8lyUvvk8dyL3jFri9ojIxPm2S8711x24+tClTPjfWij0lzZQ9wukJvos/y73dsAe+TqERPVuorT2Decy9EBDgPaeQN74jsNI9UXQYvgpWSz3WEUK7m8UjvrWrNL5Ji489VoUnviTF/r0C3vM9nC0qPnfDhb1uIZI93tDbvSdiWD7hEUY9OAAAvhqfGD5qUhm8oYKGPnUKIb7xCTE+EZwhvlvvA73icLK8V7Agvh/Nd71KNww9cJqwPXD+2z26YQm+Jo0zvmLC8bzdP5G9rn90PrjfVj4Yp4w9rxYCPhsroL3vGxW9175KO3VaJr4Rsba9PCmevZPmRz6mJPi7S5ZDPUkq9DvYnna9s7LXPTq91j2CH5i9vDQ/PpxmGj7CQp09EGuUPXzUNj4JwuE9QwE4vZNT6L0JS2Q9SXG7vOWZRr2fLTM+gU37vboLPr56avy80cgqvixLAD5FDgW+BnChvUo6zDzL8Bg+FklTPpnnHD03qcK9GVuEPJDcpz0TgmA9"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d/Conv2D/ReadVariableOp", "op": "Identity", "input": ["sequential/conv2d/Conv2D/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d/Conv2D", "op": "Conv2D", "input": ["Func/PartitionedCall/output/_2", "sequential/conv2d/Conv2D/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}}}, {"name": "sequential/conv2d/BiasAdd/ReadVariableOp/resource", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}, "tensorContent": "H0JZvF71ozpjpVI5xHYnvIX3HL3mhMk6PJYbPBO1j7zkrd479cbtu1VO9jvmaiS74vouPNzoXrxVIC87ba8Yu2cm3bubpga8jnxWPIpqlbt+9Pi7lQK8OvFrLLtmeY28tkSeO7ywlruaFnK87tSVuzFlzjuykD467XWCvAQFpDvSkeU7V0MePPjILjxX/a+7/M2FPCsM/7va0pI78q2ePLRwtbzlg068X7m4u/WRAjxL0767bV8PvJEnbLzTX5w7oYlnPNm6obsPoxk8YIbXPK00Uzswxvo39zHiO5gH+jtEqoi7ln7xO+SVGDxhIpQ8ffMIuwLouTuSwPs74J3YOqp/zDzrnkA81lzlO5Tdbjp13/Y75oNXPDILjDw2PmS8EfhRO2HB/7wpGyc8EbAvPMfBCrxtCtY8vou2vK4XVTyF4iM7Yq1VPCDqorzUJta8WCBbvHGd37x/LOA6iqjMObE+pbvViMe72kqQODK0NTxwZr86WRjWu9bAoDpgJEK8unLeO06y3bm+Uau7yKlTu0ViCbwW4Eu8ydhhvM1ZyDlqd408asDGu+MWLbr6EAe83t5RPPxAU7zRSlk8YNpcPLaImzrGhIc86LM0usCWMrwL4/M7CskFvBXKQjxPUPs7Wnu3unx8GTweXom8DMmAPMM9M7xl0gq9j6i6OozU8bs="}}}}, {"name": "sequential/conv2d/BiasAdd/ReadVariableOp", "op": "Identity", "input": ["sequential/conv2d/BiasAdd/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d/BiasAdd", "op": "BiasAdd", "input": ["sequential/conv2d/Conv2D", "sequential/conv2d/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "sequential/conv2d/Relu", "op": "Relu", "input": ["sequential/conv2d/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d_1/Conv2D/ReadVariableOp/resource", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "16"}]}, "tensorContent": 