{"format": "graph-model", "modelTopology": {"node": [{"name": "x", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "16"}]}}}}, {"name": "step_size", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {}}}}, {"name": "fire_rate", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "angle", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {}}}}, {"name": "strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAwAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAABAAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AQAAAAEAAAABAAAAAQAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice", "op": "StridedSlice", "input": ["x", "strided_slice/stack", "strided_slice/stack_1", "strided_slice/stack_2"], "attr": {"T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "7"}, "end_mask": {"i": "7"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}}}, {"name": "MaxPool2d", "op": "MaxPool", "input": ["strided_slice"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "ksize": {"list": {"i": ["1", "3", "3", "1"]}}}}, {"name": "Greater/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}, "floatVal": [0.1]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Greater", "op": "Greater", "input": ["MaxPool2d", "Greater/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/PartitionedCall/input/_0", "op": "Identity", "input": ["x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/stack_1/values_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAAAAgD8AAAAAAAAAAAAAAAAAAAAA"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/PartitionedCall/input/_1", "op": "Identity", "input": ["angle"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Cos", "op": "Cos", "input": ["Func/PartitionedCall/input/_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAAAAAAAA+AACAvgAAAAAAAIA+AAAAvgAAAAAAAAA+"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul", "op": "Mul", "input": ["PartitionedCall/Cos", "PartitionedCall/mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Sin", "op": "Sin", "input": ["Func/PartitionedCall/input/_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAgL4AAAC+AAAAAAAAAAAAAAAAAAAAPgAAgD4AAAA+"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_1", "op": "Mul", "input": ["PartitionedCall/Sin", "PartitionedCall/mul_1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/sub", "op": "Sub", "input": ["PartitionedCall/mul", "PartitionedCall/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_2/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAAAAAAAA+AACAvgAAAAAAAIA+AAAAvgAAAAAAAAA+"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_2", "op": "Mul", "input": ["PartitionedCall/Sin", "PartitionedCall/mul_2/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_3/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAgL4AAAC+AAAAAAAAAAAAAAAAAAAAPgAAgD4AAAA+"}}}}, {"name": "PartitionedCall/mul_3", "op": "Mul", "input": ["PartitionedCall/Cos", "PartitionedCall/mul_3/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add", "op": "AddV2", "input": ["PartitionedCall/mul_2", "PartitionedCall/mul_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/stack_1", "op": "Pack", "input": ["PartitionedCall/stack_1/values_0", "PartitionedCall/sub", "PartitionedCall/add"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "3"}, "axis": {"i": "-1"}}}, {"name": "PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAA=="}}}}, {"name": "PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AQAAAAEAAAABAAAAAQAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["PartitionedCall/stack_1", "PartitionedCall/strided_slice/stack", "PartitionedCall/strided_slice/stack_1", "PartitionedCall/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "end_mask": {"i": "11"}, "begin_mask": {"i": "11"}, "new_axis_mask": {"i": "4"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "PartitionedCall/Repeat/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [3]}}}}, {"name": "PartitionedCall/Repeat/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/strided_slice", "PartitionedCall/Repeat/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/repeats", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [16]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Cast", "op": "Cast", "input": ["PartitionedCall/Repeat/repeats"], "attr": {"Truncate": {"b": false}, "SrcT": {"type": "DT_INT32"}, "DstT": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Reshape", "op": "Reshape", "input": ["PartitionedCall/Repeat/Cast", "PartitionedCall/Repeat/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples", "op": "Pack", "input": ["PartitionedCall/Repeat/Tile/multiples/0", "PartitionedCall/Repeat/Tile/multiples/1", "PartitionedCall/Repeat/Tile/multiples/2", "PartitionedCall/Repeat/Reshape", "PartitionedCall/Repeat/Tile/multiples/4"], "attr": {"N": {"i": "5"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "PartitionedCall/Repeat/Tile", "op": "Tile", "input": ["PartitionedCall/Repeat/ExpandDims", "PartitionedCall/Repeat/Tile/multiples"], "attr": {"Tmultiples": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Repeat/Shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AwAAAAMAAAABAAAAAwAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [0]}}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [2]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice", "op": "StridedSlice", "input": ["PartitionedCall/Repeat/Shape", "PartitionedCall/Repeat/strided_slice/stack", "PartitionedCall/Repeat/strided_slice/stack_1", "PartitionedCall/Repeat/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [2]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [3]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_1", "op": "StridedSlice", "input": ["PartitionedCall/Repeat/Shape", "PartitionedCall/Repeat/strided_slice_1/stack", "PartitionedCall/Repeat/strided_slice_1/stack_1", "PartitionedCall/Repeat/strided_slice_1/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "PartitionedCall/Repeat/mul", "op": "Mul", "input": ["PartitionedCall/Repeat/Reshape", "PartitionedCall/Repeat/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/concat/values_1", "op": "Pack", "input": ["PartitionedCall/Repeat/mul"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "1"}, "axis": {"i": "0"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [3]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [0]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2", "op": "StridedSlice", "input": ["PartitionedCall/Repeat/Shape", "PartitionedCall/Repeat/strided_slice_2/stack", "PartitionedCall/Repeat/strided_slice_2/stack_1", "PartitionedCall/Repeat/strided_slice_2/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [0]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/concat", "op": "ConcatV2", "input": ["PartitionedCall/Repeat/strided_slice", "PartitionedCall/Repeat/concat/values_1", "PartitionedCall/Repeat/strided_slice_2", "PartitionedCall/Repeat/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "N": {"i": "3"}}}, {"name": "PartitionedCall/Repeat/Reshape_1", "op": "Reshape", "input": ["PartitionedCall/Repeat/Tile", "PartitionedCall/Repeat/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/depthwise", "op": "DepthwiseConv2dNative", "input": ["Func/PartitionedCall/input/_0", "PartitionedCall/Repeat/Reshape_1"], "attr": {"explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/Identity", "op": "Identity", "input": ["PartitionedCall/depthwise"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/PartitionedCall/output/_2", "op": "Identity", "input": ["PartitionedCall/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d/Conv2D/ReadVariableOp/resource", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "128"}]}, "tensorContent": "RGmSvelJED3JIcE9O7aavXHH1z2Xol+8foCqPZ7ykbwyXOK8Ki6bvRqR1z2EnME9eEhxO2ZZZT3Rfi49PzPkPBKTYb2uKRM+wnrjPEglurxOFEs9X0z2vMTkK7083849ROUEPdddCT46PxW+jFYZvcXwJr5gbee8HiFiPP0CB71trRi+Vp4MPWo2az1IKCm+tngePUFfAj7YIg0+KZP4ve8v2L19fe09Dk8Du57agr3+cxc9ieqiPdmaP77ySNQ8sF6LPZRUfj2gDBs+LBo4vR4w9z3qb889eUEfPXqDQb4PNiC+BYrjvd4lLL1iM2W85WrNPXwJK70QPaO9JbSDvX8GNj5j7hS936OtvRR9jL0y4+w9ENJPPeO51zyfI7m9do0svV7F1bzSZNO9if0wvsGM6T0gzQi97vFgviv98D1GSCu+IzHhvZ6TEz7S7TS+4NKQPLtoQb6lC6g9fd9HvtnCmL0lzzG+sg3Su4yIGD5/kb+74dB5vbrt3jwUamS+VygkvX4hlbuFWqm9DwJHPbPcRL6Z6Hi+IoXXPeBvA7684Yy9IT87vgcf/D1ylGY9S9KPPcF6sr0TjE28JKAzvoHDLr1uaCG+kZnSvQq0oL1axvW94NPwPQGg7rypub+9z6HgvflUq70SMPm9sDLfvVe21r1iOyI9q7MPvoum2D2t7yQ+RVoOPWOMEz7RvxA+4kNhPgSExr2A5wy+lkdKPq/1Jb1/1yw+Aa0DvpfyYj7vkSe9s33OPVPYzrxaA5I8KHysvJU0ij2K9ky+NIwmvhKohD7HWam8kxdvupJoTb33tcA80VM/PlVR1b0KyBU+X7A6Pv8zEj6dCRi+etYpPmNWCT5Tfl893oPpPXH/dzynStU9Sg8svRPxC71oCxi9WvA2PmYJBb0Hqms+nH4KPtTHPz7F9aG9fso4vmIcxTwlevm9xiqaPXKURr2JOQ0+LxwuPr8aCb4AVom7EBT7vfq2TL0FWwQ9KN7RuqQwEj3w/528FneLPY3sQT7fUlc+Ah/9vW3LOT6GNBQ8Fc0mvWvNLT5Oq5s8l+zbvBclUD64w+c99S/uPWXNNL3VfTK+6sn0vI6Iyr1kaY4+yS4iPk7lED66X9G93l4zPklvyb0YaIW9t6eOu2bJIT5/ulG9wRPfPYKUxz0Oo40926nmPbDF3j3yzFA+nPxjPc9wDL70YBW+naIxvZptyrzyk5M8BEgLvouS872yose9ZZCYPsgW8L1xwy++1WUSPR+w8Tt/zIq9NU1XProwBb4tAIw9pPVMPh6YMT4S5A4+KtNJvck3Nz4ASAK+NIeNvbpiy73wRXa+rY/HvdxL/71GR8O9VmzxPWv2Cb7U7gQ+RiJzvd+TvD2yPk06Y42ZvLTAyb2e4bA9WRjovV+sbr4cLke+dcrLPANaXD5DgCs+foJUPo4ewL1TYy49YjxHPhfdEj7amlM+XkFTvIBBE77d8jk+M6ykPaNAfz3rYnU99WfGPZbhEr2BTtq9qdy4PXTfyTxifve9e8AJvqmxST6FKVS99ezJvecbNT6lpk6+PEBgPVdNtzvecF89li1yPPabdb4R8xA+uSVZvn2N173Q3yC+/ohPvpeXHT7Jz5Y9dldAvioVzrwutQ8+bWINvT0d8T3T+FM+HlYkvuMBX73qdlO+BHNKvvKFz71O1RW+NmxyviYaGb5My6u9Oh/DO8ndqbwJUpI9lzGBPXcWGz6VkQi+cu12PB+n2L3LZU0+zYiMu+xpKD4krjI+ILpGO0La2T3eBB0+XRyQPS1BWL1MxUG+YqPKu0+/3LyoETw8/Bu/POWuDj5J3iq+Lnslu8fKBL71PsC9H8OsvUkNcb3KXjc8LfAfvjkaEz5N1Qg+OqYhPkYpNjz6gzY96TxHPoSd9L1Yw6g98d8iPlfkMT05Kk4+L3G+vU3ee73PKwA+ez8SPlPyt722EAY+V1gDPvokLL4nxhM+SJybPVH0zjxq1U29k9htvfuh4z2apre9MRmIPSIS8TtaN6M9hEy0vQ+lejsa/oK+t6gTPiM1Uzti/kk+4ujyvORcvzwNkoY9Ztl5Oi6scr4SPRm+9X4mvS02eL0f4xo9gl2KvDdoMT7wKxK+yZLUPRbbHD15wQ2+ubmRva6dCb6CAMQ9OJ75vUukOL71VKE9nG7xvVStGjxAtlW9gnsavD5hPD3FPAa+xRQhvml+8b0lXmA9RM1FvpVbRb1sbWW+JvawvfvEgD309EQ99Z7dPG+fLz74PLI9fa8SvioZpj0XIti8UB26PV7VNz4eHfI58s6MPCPe8b3Zobw7tZrpvdTvhT2QnPM9fMwbvib8Lj2VHwg+2onaPRKKN75W5O09sgy/PZovbjyobFs9h0cBPkbfGr5Ar+g96VAJPayKrD0tqb0910TjvbXI8707Xay94IcjvnHekL1b+me750/dPYBekD20Dza+3VBTvsfN1r1rWC29xsozPFcnwb3FggM9A7wxPlQZmL3IzD2957YUvrSU6zsebwA+jhQyvtLEIL6HylM9OqnAvZd4jrzfrsK9Sd0ePk8Zzj29dsC8fsGRvYcw6D3+8MQ9BpKXPFqqEr4SEzW9FqGSvV/cBb4Vowg+BMEFPaQJ072F3E++uqmevWlgvrt1QF493F3+vEqTpr1RIpC9GnQ0PUoz071DTgU8hD73vcb0ET5bGpU9cXzEvGynHz5t7PY9xsvcvU45HT3hGac939ehvKpWHr1DGP699b2CPqZCzz2jR9q7qeKHvchYBL7NIAC98ZA2vcZ3Fj0U2UW8WfO0PZQfez4axSU+aS28PCFT+70CE04+eqYYPh0+Uj7hT+W9CorSvLprDj5a2aw9tpzpu6YART4DpJI9SyzwvICXDD7Y9VU+8UAAvR9JALxvaMc91jWTPV8tJL4V0ts9mlQJPojm6rtIKEs9THoyPlNycbyKPZM+aNbEO6YTuTx+ako+iKM/vjLgMb1ko/Q9n3bmvSGiL747Bms+B9eJPaMEEb4of689KXuhveJO672c/kk+O0w/vHGcQD1+2gU+FV8mPhJaF74rw1E+xdOFPTbgYrtc7SO9iAoBvp6yGT5QqgK+76nWPZ/8UL34Xku8G/3SvSR3bT1Uy8I9OwKnvLILGr7aozS+xyD1vPJNF74KW+U9mhvZPQ7mLj5ueWy9QdAKvQCsuLzketw8hWFrvENXGz5UZGs8c17sPeCPHLxTxs08duo6vUGMAb4xFcA8Q4DNPTZ2nj3O9429ILVWPuiA7D2XgZw8RKQtvm8oJ75mxPI9H6dzPTmVvD1u0hq+z21APijALruTmB2+figpPnuxAj0MuoE9BejCvEDMnj3nidk9kUw9vl42JL1KTm89pFLFPZWXQzxMt8u9sbDuvd3JBj4YVv69RkZwveYx8r0lhqc9tscMPu4n6b0PK1s+3+cRPnvntzyiSIk94F/nvUR3TbwtjLO7D/RRPYbrJj5WbSm+PiNTPjiy3Typ1MI9v1iWPY2FCL7p8P+82m3kPULVRb7N0To+G947Pv4iZL6xCs49AXEEvjgaPT7kmcU6EtDfPdpoJD3vEQE9Q/IQPgIa57xrAjY98nEcO3weKD4vVg89THxGvg3eK76iQWo+T50NvEBIGr457y8+vssdvpoZMD282i09CqPCO4UnKD4MkUQ97GNnPSu0qL0KGYA9kbDMvT53/7qXs/y9+xwFPgWFSL7YxSi+LT+6vZF49j1FKby90QlEvkmrOT1uwau9pFHEvTKYBzz5idA7bPD2vQlTDj6W9yU+QukSPkVWj71c6CE+k0ObvcvXF7zX/yO+nAlCvgWD57xfGoE9UCLUPcQrOz5ul7i9qa91vvhI1z0g6OM9ZWUovgK87r1NJyA+ySL0vZm7g71Ozz2+qbYoPi/5PL4BwgM+BbkCvRrEP72qzUk+dKVLvLEVprvNNpW8M7b4O+oFur1AYRC7RNeSPadsAr1rO8y9pmgwPs/wrTwN65S71W7mPQHMSDt1tDQ+82S6vbt39r0ICqS9HAt2vW6REz4uwia+KStSPVTGVj5LoSC9zezJPFL71zynSSo9Dw5mPRxTbr02sEK8jruIPfdoOb0s+/O9KJahvbM3ML3ANPe9CY67vHg92r0LQlI8FO5AveedJz3fz9w904+NPf/QAT7vAMM9Pft7Pc7LJr64xis+/ESiPXLthj2xiTe+MTUBO97ZoL2Jgmw99nAqvh+6VzxppeM9Jv89PETMnz1mYJY9E6L9PVDIOr4xUjw93omFvVNeEj5O8qy9a0wNvpJN9b0F9nk9q+czPkb7G74BLDu8gKUlPvVVcb7rsga9aX6MPRFHAD5+Xzq9Ud0BPr0i1D2OSEU8FKQlvhsOSb6Uqwo9oDA6Pke6Cj54qE2+3oMWvanywT0H+Bo+S0ozviek2b1oNyW+8GeuPOLpBj7/JUI+mxlFvrp94r3UcZq8HLawPdyhmz0mwyo+cTXiPNSIlT234BU+cz2JPMtoB76DGqS9VMFdvqwnm705UsG9AmOCPEjAF73knxs+sCuCPR+BRr6w+WW4LSmWPC6Gu7oMgrg92n89PhajoruCLiE+3piAvBiOlr0NEtu9WtVzPWhIn72J4A4+yCZ6vQlxnL24bV691YjUvbLP2r2pZka9W3rmPcJjET50CSs97OctvnPGqbyocDm9BDjPPXzgtr0UTS0+BMAqPv1p2D2pMM29wmyOPaTGlLw9xKA95j//vUDSAL5ri0M9QYYZvRq+rj3FDS8+JLwBPr0dF76K6xS+6GjhPYCizb21fFk+TzJdPqQNkbyVoRk+aUTVPGG/Tr4DWxG9Kt0Uvj5JCj5p/8M9zZIxPfUWEz175Gg9ay/4vU4l9jwmkJY9OkAqPanZGD4yYuG9u5mpvcLPmr1sOhy+OIxjPi4sz73JEIU+h3OJPS6SIb4nih29lO43PpfvMT3ZLRG+GMlYPqeS5T1w+d29vvIxvbLnRD1QF409bQWcPJ/fYj7/6we7wVMOPhcKnjw0wgu9HLYovlc9Pj4+Fhg9fiMpPFi2orys+B4+3JgyPoFYKb5OjwQ9/PiBvLjMYb3hdr09Y1RXPZUDM7x06t89E3txvY6AEz33oYc8gIUZvWeRRT6HAVo++Y1ePra0Uz0RzTK9FBKhvcmJgr2Cf4k9RVqcvL76BL7BST4+E7OaPQ6gUz2xyTC+iabYvAbU0jzcilq8qrOePWQYFT4BwwW+8QN7PDMrFb0ERrY8ly1IPjFJxz0fcXO+odaJPYFB1b1JCFK8qIAUvrGPID46w2Q+pHWQPUWGnrwCYR++fYIdPgUJJr4nuwi+x+sivimpGz1+gie8TQYOPcNDyD12dC6+Zb4ivDSaM75Mr6K9vpsAvkz9lL09pwy8kT4xPqK6FL72lDC+9f30vR/lwD2iDDq+CbuTPXxr4D38UTy+y/22vLE9ur2E4Ws+bP2pPO9cNT7oQdU9liD1veZpZz1YdMU9B0qtPUiWwD2mR1s+nOMyvjvDfr5yzt49w09kPBmtAL4S29k8V8sFPe3OoL3856A84hT2PRYTOz6Osge9B2kjvloTHj1+jOs89RdIve7i9r2gkzM+1wcMPsJbKz6OFMu9EZI0PiCyTj6SG7w9OMKcvQZdFT40Mbu9jGhnPZHcgj1KBze+10oEvhWQ1rwW5As+xAawPe6ojj08yGQ+PqnbvHZsYr4VHzG+XiT7veQwFj5iCSs+1Oxcvlc7F760aY+8TriCPosSH7607cK9IRBgvrJCCL4y6wW+eGmMvFiQ1bviWAi+t44IPiQvDT7HzEE9FlUHvsoxUD2WfoS7mJPOPeZ8YTzpFxo9wInaPRb/gbwh1Z08OSu6vcuhCz6V4fE9h9O1vLbGgz2liBU+1n/hPCaXkj3BGBm+HVw3vifmAj765ce952kAPno+Yj2qX7W96Kp1PexDH72SA7E7ZkMPPqa4Jj3/yNA9b2ypPUIo7b3wKxG9KG7QPWBKoj1MGkc9suGlPZlqUT37BbA8w9Mnvm+WTj7C+za9cdFoPQPt5b1TWo29KN2GvZXs2j1ICV29mD2LPtj7Zb4AdHw95Pe6vfPu5L0y4Ui+QSmSvM8vsz3YJhy+YTIJPvILLr5c1UM+ycIOvnqG+T2wiYu8RfPXPQLwAD4Vi5C9RfWZvXONr72D0sI8uR8Hvp36jbzaZM+90hAevdlaIb6xi8U98ZCVvY4fIr2jwiK9Ck0APh0KRr75sOW9zBQcvVr+cjyLTRa+1Zc3vMBJIb3dOw+9OgdovdkVdjzvF6K9l7pgPf9nYr3CHmA9+p54vUIoKb7opAo+h00fPfaO4T2EZDy+VHoDPpg3irwHpy48UqGIvFUXFL4aMlu+9GmJvcAlhz2prPs808jtvW+HJ70Rmh+9rrWZvZaD0b0gYoe9JaDnPSwBEr40z9y9E6yfPShw/rqy2SS+vac6vn/TFj5EhDO+MjbDvSopjL1RD0i8b6e9Oz1f5j1mQD2+0RUDvt47BT5W04E9u08yPRurqr3C4/y9QlGTPTHQEz5dM5Q7zRYoPW/9Ar10cRC9IxaYPBg9nr3qkIU84JkDO2Bfs71gVgW9t2sQvioHvj0bw689dbW7vYFB0D2WWNa9LgumPKVwIT7sBBK+BPiMPV/YMD2V3eA9DFTSPdRFE74rEvY8LvSnvbIOS775UOC9PxKUPLxtFj5wSUg9Ba8Uvp+XM74fToC9wS4HPqv5Lb7o7qA8bXaiPR3J270RtG89Vr68PWgR0j1B4CO+bT5EPKko2b3a1h49y2jYvfe+Sr4oYR0+9roRvt1/cL29JCC+lUgLPr7kmL0ys7K9VXCvPSXawTwSCO49VFG2POOkML344488U1yIvSIhrj0tTw0+XW++vTLnXj6dSxC6wdRnvWY6zz3OIIg9bgOfvc6RLT7Dnp+9nrFkPlrvd7wLG+U8uaMTPuEGRT5PgRG9CCvvPZnoBz0YToq9yoU0PlRbHj5orMs9vKm6vQ4sCD4Db8u9tKERvqpA6L0Lf7U9PFfLPdCb2j0p/+i9A909vKliJrs+1Ew+9nqYvXjrWz7eNjo+SSPtvRwUSj78nDc+fZ29O2cvRz4JfR8+N5kEvh4FXj0onP28C0F7vVCvFr3E0PU9sveEvH4J/L3eu0U9eSG1vboxXj6wF4y7Zb5TPJBoLD2WkyC9eohePgvQszveQv681+jiPKTww73LZOW9gyELvvkbAj4nxiA+tcWWPar2oL0pOCe9bOfkvYDSwL3GbJG9LL4MPrdh6r0Bf3m84MgcvMnL+b0xGyi9PlMEvhz3Lr0kYgW+RvgWPenxVD79iE29AaLGPU1RvT2Kwm29UeQkPk6LMD5qX2c+iiC8vdxdUD5S+BQ+H5UmvkGOpL3GTZ09sq5DPZe4Fr7M7F29U2UkPYmFYTzH5ca9G5pKPkejq70zePw9PO4rvLwxLr5K2D6+EhkrvlbOjj2LKNa9jHamPXmmej3EAji+H3kDPgB/Rz66RuG9V7sTPkzmKD6avEU+IRqCveyGvjwSEG0+QPGpO388KD6gRlY+ncymPUnkG75lx8u8+7flOiTzA76HVQE9K3EsPtYNYj1Y4AQ+9cKrvf5RLD6oXeo9BOetPC/zIr7I3cU98PESPqOnar7G8TS+qQU2PeVw8bwZQIm9HiCHPobIDz7ltQQ+Yi6gvXlnyT0m4Fw+AbVivZwqLb0ppo67t+/jPGdEIr5RZF28iDAPPpgTLT089Qs+37ROvocT0zyfuJS9Nwq+vS2z0btzKQw+GvEQvu5n9r28bT4+iqOAPZKRKr6OGZw8/hdsvYeLC71lrYK92bUvPchiyL3nUYM+ZM/UvR6J/rzoJDs9Ckgdvq1aGz79ApQ8850APqfoib29F1I9seJnPamJlT1mOS0+i1AEvnHLRL2Grg0+hdhxvWcJOD5Rd/g98BR2PePTFT5Pvqq90s6Tuq3cur2u/8g9jys8Pkc0fT7WzjW9R74ePo+Ozr0BWMu9FCZNvDdjoj1pTy2+IJI/vibsTT5Tvym+ThwZPveMBz7IpUo+bDQWPjxuKj7nrQ0+k74tvsPDlz1++p49QgQcvVTXz71cUuK8C0SLvUN2cT1Xxj0+XHSbvUMHXDztKBG+m5gxPmy7Rj5Dbzi+n6OyvIm7xL12Gjy+JHQ9PnKDHT74aTY9xqrAPTgERT4DfoG+VBorPhoYrb2N/+49rfvPvJZ6cz0wC9s9fVP1OwNB+ryrFtk8aVB2vdvoQ74nfL48xfYcvB7BkTwNM7687LoIPsNuWb3Sm3k7h2ADPW+MgD3PSQ0+q6vTPSGD4b1l1gu+8OUvPgN0mz1k3bA9GsXkPO+cDz3YK5Q8/a+WvKMm8j2jt+E7g++TvbQOdbxCfda8DPYJPki46L1dEPG9PI5FvqN/wT06R0+9iIljO/h7970hhHK93gxzvXYhiL2WTSO+3pSvPauNE74s+x4+eRsCvggt7jzTVO89K8YjPoVJ9DzZ6zG+/yTqvSqY7Dyw0BI+iLesPeGZbb3ZVey9hQNwPQv07Lx87A6+mkGAPIAjNj0vLW69jpUTvfGwGD5pOd69BSgmvZJ6a7z9a589PnHFPeNJPz0wsi6+yA4yO2BLHr7F1KG90NhWvb0YKb5TsSg9VkH8vVqLZT0serM7HikMPpgFVzxjvre9GFyoPSqkgr0HLma7dkMSvrwRBb5c/EG+A2jcPQrOu73oNxY9fqDPO8sejL0grhS+yeJqPd7B9j1FXDi9IKifPecMKj77YW28SYa5Pbmthr0G3FG94jmqPK0tYb2qCJQ9e+ssvreD2boXyOc9oY/kvNQXqb3dNsI9xMvovWTdCD71I/Y90NTVvVmB1L1IwH29mkkIPkLj6rzslgI+fL8RvgE2CL1KA5S9yb6WvvFKnT2/4ci9AWWQvTbOPb0K4w0+6HEBPsXiijvUISk+Ex6XPWUAFb4+q0i9QUiKPWeZ3725Z9E9+j9lPMW3yzwOQwC+rkjsupdgY75gNsa9L0bKPewAAz7o9ZK9g9dTvjfgLz1TaNG9wS6yPC4QGD4LsqU+GJDePZFExzwz0ri9oY0RvqfjVz5QKSc98mM0Pb9aUj767Ki9y0EqPjM+tD2Bz1s7w6CVviRRET4G5oI+bbeMPt6XGz5IGKU9c96EPXKLKj4URW+9Xi5GPgPtkT0A30C+RDbNveJcKL6RguM9mbmavT5hrrtxxJk9e58tPpUP3z0Ujtq8Oy/hPajGhb1L8sY9/pAhPlXwR74gC7E9LYBzPurCmT1LYMG987EnPjukuj2y5QQ+h8CVOzlHGD6AKCi9N9ULPg8oWTwmEQ8+fbvKveb2LL4xgZq9G/yTPolHIL3DVW09RPuYPe2G1D3BTOa9hvW1vdmtPb5cYbg9r7QtPqWBVjuxmiU+ft7oPF+w7j2A0qQ9qqkpvmO3TbzZdCe9MbxTvkfnuT3PVdA74aCYvZQKIz4lyzk9crBSvRtZcz1vYUW+UtwsPT1zB711Ugc+miCQPRrbFT5wOe29neKOO0V+fb285IO9zu0WPlwMEz6nWMO9pFbFPEM1ET2UtfE9jiEsvofgdz3OvJ69cC1rPk9kRr6j6d88RopqPXD3TL5cbAU+sd6IPkbVET2rqC677hcKvUvh8j1WOg++o7N9PKzJ7TzPOx67VUmnPY2msbtXQ0K+oMLPPbttB70vHAQ+EQgWvZEISb3Z3ys+ElTevU9LC72NLEc+pfL3vHyDSr5SdaK9Ke2VPSqfu702kDe+2qMjvvgPEz04n1C+6ZpRvKqx0rwrPxq+Q38/vGdRwTzAKES+/fKMvXzk2LttAq+9UCiBvbLNMjzhy1S7x+N0PkkaJT3w/y+93tJPvj+vX76UDU6+RQygvdGHyT0zcFi9bTETPgtsJL474NM9yhy9uxH9wD0yrUA+n4MEvABuhr58Udw9y+OzvRPmmb1kjTC9iYJyPQcJjTyVp4A8heYTvpBCkbzUD9u9FGcXvALkzb3gKTG9jQkqvguQzr04OBs9qBfxvEybPr7uoeW8S/YiPts/ub20QdW9ZYFqPS99WL52IXM+k7k7vhkBKT5H8oi9Qr/wvRw9MT6S2lW9yPeJvLFR/D3D1HC95NcJvhJ1fj1FjSE+9neOPbPZsT26vQk9h4iePdFXGj7EaZS90wOUPY7A+j3OMVS9QDk6vo/bNT5hvi6+H5cHvlvqNr6YmUe+vxnpPVryOT4VNdI9ubVUvNbVmT33/L69pG6JvdmS4bwDIkc+UoWnPQ5Fi7tjWbw9AZ+BPbOMdb10sxG+oPkOvDzgkLzdwOY97UeDvTXvFr0xm3g9ZHvnPSAgAj7+NBI9QzwCvmmzJD51QRW+f6wSvo89r73Eqbw9HA5iu7LhS74m3Nm9Oo0Tvs7oEzyGFNq8cKakPM9EOr70FgU+ZiG4PaXrsjyRb8K9xoCNvTxOS77HtQo9w0crvs5TLT1JPpK8wlkhPYjMpj1Nb+A77GLrPfJ+ND0oGny9n5KEPSYhKT44wwI+HkbLvbHdbbyRhbu7sAQUvipPL73fciG+lh6PPDj9kj0IGFw8WsdtPfpnIb7TLBC9P2+evAFExLzBsQI9JNUEPqvqGb6FQUq9HqPivWjvF75U3fY9NJ6WvA687ryny0A+6SQivg37Ab4S7Fe9bCmNvU5j+L2Pazq+FyWkPUcd0r3V9wC+5xgcvnChBj5UmS8+UH/KPOCKGL5YORe+3aKivYL2ij2MqJo9q7GLPcd+872xRv49bMQwvmcbfbxqRMC9sOKmvTNWDT7m+NM9w+8Cvp2CfLwULXI9E1eJPY0/Fj2EpnY7XTudPVYVD77g0dg9hIUNvSXzoD0bKpE9EC9mPQ6bnz2wGXI9pLqhvMdEiz2WxQa9A32VvclVTb0B8ge+L7JVvQFR4r3v+me70XRzPJH7zj1dOLE7vVwIPnkTEb4GKBq9yeTuu92oA76Q8cG9LN69OxZP9705AZ49kskyvStcXj1nmce9/WQMvh+uXj1v32O9oHSvPYplQb6zmgK+FwV1PRYqjL7voH0+gNxtvP3s9z1GsEW8JYKMvM6dYL60WzA9MJRQO4hR7rzOWYi+lyLkvfLgkj2PGIM9JrpJvrySkj2HkHa7gvQOvhvZbz3/kl086bA9vmMIaL7uSV++j0qpvbR8Kj4tvu+9OWo3vnlpXr1Xyq87bHHCvZ0m8z2wdCu+N/4Bve1Pgz3cbvu907cfvjXfDD3+7Ea+xDIrvRHsgz0xXRI+zeJbvcUKMz0Z5EO+PIHdvfgTBzy4CcM9CyPYPWsscb47xjm+Xh88Pp2JL77AV4w9MwiCvZ9+Wj5Xmv29HzcIvsY4GL4lmTQ+kuQ9vvluoTxtu0e9ba0QPEG30b0ZJpQ7mRbMPTrsTb5Nd0G+ruVKvTmoBT4EwLS82qCjvWo9uT32Kp++pVGkvUBvbjzY/7y9kqHMvdBeGz41Xm49jPd/vWxI7r0IEy6+Sb0UPlF9KL0Xfce9oPnevaUYcr4qpxk9d3iVvI3uvr353M+9VY1gvj5Eij0YWjG+RIv5vGlJOL4jTp++OMFBvQi6CL2pg3a+3PsDvu8RMb058lG+GqSOvVEJWr3bf9K9eMFePTA9QD01qUs9BKtlPfve2L1Ay+U9Rc1ZPRBxPr5449C8HAXRPSz2PD5kCrG8n6vUu1Bkdby9KdC9ewvmveESOT4G/9g99UclvoEAtz1rPLW9+G+GvqacOT4PFo++bA/gvZMInj3I6fK8rYyAvEdwqD275wW+oypxvr51zb2q+Ru+O8TRPEEDXD5u3WM+ItGJvmPbrz0Tqze+jkEEvjT5QT4B2e87ua/EvVUTRD4Gc0i+noF0Pr1RXD61q8g8KEBavitxtb2qTi08WcjOvTdqR70ZETS+qD+YPS5lh7y1mEK+dgervSD3Gb4oxiU+2n75O+QXHr4oL+e9tZWCPS+Eir329SC9R7XrPePzGL7Q9TI+p/gOvl9cFb3VYvq7c1f0PKWhlTybA8G9UdpbPSOB3Lx87+g9E/TQPMJ8qjv+jZ+9Tp0JPrN0iT2P2R4+wKOoPT+tA719Jv07VWgWPktslbzwikK+oKNMPj5Iej1ftoo+v7dFvjTgY76xe689vtGTO7xTN7zXiLK65IU4PZDiYL0ukLi9vJoHPuHjZb2nd5m9a1EavtBtgT1YWS09XMjlvQu6Hj1TIo+8AQIFPrl5/T2Pm6k9mocQvjW7YT57K4W+G34+vpjVH740if27HNWlvUazc77cguo9+BIdvtimDz7Pjii+5KaNviEOKL7cmSQ99nsrPjhG6L1vu889oVM8viN+wT0PHRe+WFFKvjYQ0D29+/K9szYnvtcFTL6MzP29eYMIvTd9kT0zqxu+x5o3PG2WXD15FyY+T+nJvaPreT2s9s29N6bVPKKO3T0klH69aKZYPOHGPb5OvAA+Ab2jvJjVhj1GRmw91paKvZrzL74caxo+2E8DvvsEAz06jyU+f3/SvVDJK70vIL+9EhPePVyLET3XhEe+aezJvA7ukDwGP8Q900rZvC/1xL1Tmx6+1Bouvk4lFT3TeSu90/iHvf+gyzx71og9d8cEPUbzGb5367q9ElTWPYSXJL1Yiw2+P9ETvbtmwb08ieO7YfikvbiAmb0EGPI8omNvPMkjkj1zrSq+oY0Cvk9zsDzY3/m9uHMvPcn1kb3F2AS+loaUOnB1BD72bJI8FObYvUtrGL4TUD6+iyKAPfMqAr72a8i9A3gRvvePAb1g6BA+hiURvR/2ZbsDMhi+uXaZvBdgHb0uOS++4vngPWF3Lzz+RlA9/mdDvruCDT4BxPw52h5AvvnhAD4oLns7guiUu82jxT0vOQm+G0GvvQ7xyT2NjVG+W8IAPSi62z3uXSI+FN4DPm0eHrxDoLE9oc0Gvk8h/L0LYgG+IS6XPYbkyj26tTe9Ctcbvvax8DsmfNc9AdTzvPf+l73ejRk+yMruvYTk4Lxfk8M9wb+mveZGVL4+IQo9RHCwPcnPib5uXmu8BRJCvcw6OzwpYkg9Fow8PYSEhj6fwfY9LixavqlPFD7ROoe+5Ewwvvqyir2xwSI+1095vsED0r2G/Fw+x0QAvsk9HD620k8+oH/bO3CRI70XNjC+TcvKvfYAur0Cn2i99+WlvGDPwb1rETm+jGJhuu9tNT5ueg890MBYvMxgUz5z2ge9gM0FPnTkc76pVD0+cTQTvFjnQb0+PxY+FbBIPFh5Ej1Porw9aGC0vG1xRj4laby9aBjcO0MYsD0Lq5S9LsTYPSAVNj5EcTU+5qOoPT4DZD7EsUg+eAJWvUYBDj6N9KI9zwQ4vnyNmr0bHUG+Fw/GPUsRa773l3W+kCNoPAuZar0bDxm9YYRgvgUt4DuogQi+Bm0bvjNQoj1I2Hi9uO1uvThDBL5P7OW9GVtIPGz8Jr3Jlwy9mDjEPZGIULxxJOs8e92tvTOyIj7IooE9u756vRhMkT250T68Byp+vkI0HT7G7e89B1cLviX79zvQ+/k9NgHQPdeAjL1OWDQ+i+NDvTGBUT5ZTR8+4IV7PoToX74X1RA+7Vy1vcMZGr5/eAm+8Acovu1sBL78Iy4+9K8EPU41Yr1E8ou+Qeb1PNlDV75L5wS+l49wPLpbmb4nQiK+mQ82Pj/TwD0nzU49Dy59PZVqe75chem9OrJNPVrX7LxFzA0+KC2NPF5riz7bB7k9urorPRJJqj3pkPs8w9k6PoCUfT7e1Vy8Bc5tPqN54L2xDke+MX4nPgjSoz3/QBK+ShtDPmX/Ib52jLU6h+BzPgxE472i27q9ZZ0tPhZ1ST0nWgA+aYCdPWAaBD1Dxng+5ib/PWozfT5ndyc+VdqLvaW6Dzuisdu8W1YtvqGW1L0xd1A+H/wfPsbzSD4Hj5+9MXQZPrUx8j0KpPA7n9Alvn2Ogr2JJdG9jkRFvuvg1j0jvgi++TBivRaupj2Wsc48xVyxvRP1RT4dYAi+JEH9PUM9l70+1Us9TvuavWpRDz5rEJm7r2A+PSSL8b2jqRe+iPdLvlktzb1iwIA9cpSqPXABML6Yaey9KAQBPq0mCj534UQ+jSSOvG/Vvj1R8Am9ZZJiPdUKBT7xnms+jBpvvV2HZ7yfeQa99utHPdp+gj5wXiG+OQ4uPkCLGL5X+nw+Fm/yvX3ZSDxECtk9sj32PHTIvztbNbU70orKPOH2RL5ALk8+jJRjPKERML3YJgi+Ur1CPgVDGLzKPgU+SdeFvbxfJT0SwwO9b5W5vXlLDL7hCsa9vpwgvoO+BD4JFj2+cyOzveByVb6v/hw+HY/oPINFbb7T4Bm+8Z/GveryDL6GUfq9saUzPcAu5T3ssBG+lukePkHs5j3HS7m8KARVPs/cwz06EMI9tAsEvhUZ0j1mZHk85DSZvXClJL4nfCs+bsaVPUKYlj0p6NC9icA4Pa+tkr0X3Ae+AJMJvu2ptz3/sHW9FGJCPcZGOb2TZ6k9U0QDvpdNCr5b8wM+OddcPn4cvDzP5wm+nDQlPm/Zur0SDHk95w0evh4TlL3zByg+SlKivdyA/bz4v0c9LBOhvTCqsj0qboM9klL3uuChJL7uQJA955a6O0w23j3Hoig9OF4qPcztQb71yWU9lF/yvULlhjyhV7c7VgQLvg9/Oz46DI49Ev0YvsHBBr3ncjc99DkivpLtD77EV/O9jnDPvdaAA75d4/i8B6VwvRKjzr05PGA9pl14PFSSJr7dgeG8UxRdvcBppz0g81E+/Nb2O1TzgD1Q0as7nelDPmC96L28zxw+iQtQva9cqr1KehS+jGITvvNBhT0QPh0+e1cSPkNhyD1UGCM+0v4fPuao9j0BIw2+EwVrvWgCAD37wk49kd80PLvi9r3rFNA9CdAEPsqcY71O+ei98mjOPI1GZj3iRZ89gVOivW3ezTwNZ/i89zdYPv42rT0W5AG9yNfFPQxg4j0ZVjI+3bARPhyF0T2FkQu+wZABPkNz+zs5TAI+yMfmPduFDz5SAw++evwGvoKvgL1Xrym+2AvDPR8Zqrzjh0Y7XuENvjsJXL3x1vO9s5ICPLa86T1t3YG960THPd0wxLsGZXg9Sa/4vY6vlj2DWlA92y44vo84B71uwJA9SEMmvhmatr2Dmxq8C6veOr9bLb7f73w9xd5qPXElNT2idMy7p7efPOwg+byC9669y4c8vbka8DoQ0zo+vlR2vbjDFj4LLhM9mLGqveat6Dy4Co69qtO4veQW5LxCqZ09cKUiviU/FL4xoZc9lrn7vab85zwMFBk9rROFvOujIb4vcHc9QKhlPbqkLL7+qOk9Z96hu2h2vb0oREm+51IqPtF6lL15ayM+U2s9vkVxMz6ELDs94jQBPl39dj3nDY28J4PevLqyBj6kYCm+J6MkPQSxKb7PlBa+CjfkPSbrL76YZ4q9cP7GPakWwT0dgTA+yDOePHeVMj5QtBU+DH3aPb/Dwj0qgti8KsdFves2lz0MXf+99ST3vXFBdr6VIx6+WZrtPXaOMb6f/fU8mi9jvguULj463r29XhDzvCOfKD6/9ZA8Yx0CvsP+1r2EFaC7vRpmO7NPKL13kZQ8OkiHvJcwZr2a4D+9WK0OPrJR3j1Ugri8Oa8MPrYqYj7olm4+Sigsvlx8tjwAJ9M8owAlvoTtLL1v5cQ94iMBPZOQtr2MjEU8IJ43vg0M/ryL2ck94C0rvp3J8r0lNLG9409svA8LX71hqtO8O9wdPhsjKr7dP1A+TNjNPXgmhzyNNrO9EahNPumVBj4VSzQ+AxswvSZOSz5YUkG80ogNPgKPSrziKxq+UumpvdFMRr6k5xG+tn5+vY1IED6MCS2+6qwAPcFsdz6aY3a+KXcSPkIHzr2riuI6wjIWvi6QI76dOXo9BKfevXgT+L2uk7O9akOdvmHn4D3pjDq++4tyvrK5EDxNmw4+ufCUPTVsIL77PtY8BGnvPfY/ID5Avl68uTJAvDerDb4JRt69aNgyPiOpuj0qX0O+XBePu1CFiz1WMAg+XVgqPiMM0z3liyC99gypPE9rgz5q01o9VnFGPWDEgr0J8/U9+VefPTw/Lb29mwu+sX46vTHCd771/ds9FHQsPvm6kz3BnFK+Uzf1vV9VCb5RAE4+mhD4vVFX8Ly9YRS9MatjPG2RTT6ZSXu9fPIvvdEVhT232RC+l3cvvUUXzr2fnCA+LN9ZPhwNID69Kd49Ucv6vRyf7r1xSSW9CGfCPRKr2T2rXIK+dlnoPdTuBT2Mu6S93BYcPi+N8zxqJQI+wEoxvRgsCr7hc6C9vjRbvsqcMD5C8g09aj1SvCl/ez2cAui85RY0PfqBhD7WW9G9AxiEvYj3JL5JG0M9UoAOPRl1DT5L6dq9ypFUvmH12D3ahfM6UFBOvpOU+r08r4M9CzNHvmDyx73POUA+v0glvnxcPT3tasa9OzdXvdvzFD1dcDo8wpyHvNLKyz1lUZC9yYrBPQuxKr4yUxY+D47/uy/fwLvw74w9laQ4Ptndor3ksBQ+z2szPh+CET2/+sg9jg/Eva8fyD1O+w++jS7zPcuMAb7UROg9y1X+veBsyj1Ti/O8VUj7PHdsrr0KOdy9sv12vr3hTD0GSKM9y+gTvhwscj2UvnW9oZ7UPbYuc7uQIxC+LscovaOzIz6S0aU9C7aUvJ7fjD2ktuq9NAKOPKbQLz4Bxno8UWoovI13mT1NuVW+JTgOvqZASr2UGTK9Qm+EvZ2Sib2rAzS+AOgAPmKRzz1ANlK8KkUBPY1WOL58phe+T4ucPb791b0zNUO+ffv7PPr3IDx5tSk+sO+hvWPyUr79qeU9CoooPh1xb71W+Zs9854FvgCiEr5cOcy95lEvPsVNIb5CHfa93gygvQrAGD3Y4Ew9pEehPRdbGz7iwQk+7XGjvdou4jxzCEm+okvOvcN8Jb6hcyq+ZpuqvR9a9r1CWMC9+7hGPUSLNj0K0UK9HA6tvIeYpz1u2/69ICVBOrlOlrwizem9dNasPASQKD0Y59e9Lg0svkb6jz2GvBk+D1nqvSD4yrydMwm9RILzvccNCj6M8nc9VJu7vTB4mb1sLja++583vUoEwTxZW2C90+DuPW1vsT1fcZO948m/vEehkTxPT7w8lq0qvlce5D0Mtye+/97QPMPmmD7LxHC9D8p9vh9mAD7cxYM98dvSvYbiED7WvLG9cossvkH/1L3+77A9Ix4VvieQaj6P50g+LJpPPT66CD5+BP295kjCvenIXr5gQxs9KZboPVJI4r2lfqo9pDLeuioKI70qrbc9W3p+vtJVyLxeVOi8su92PVd/br41t7Y8Rv7JPcS7Ij5wmF89DgeuvdUw8b3XQf68sifPvYDS7TyJ+vS9MojcvGFUn72b522+Z1CwvQxfIL7UZAY9CZjZOV4IRLsPuaY9KJkrPackdD0tzu49tbkIu6R+Pb0DLwS+I6E1PluB/L1OUq28MzY4PioJwjxvLqo79qidPd5R2j1dfas8se3YvYGwDr4Uuze78mNlPHBcITxUeoY9axbaPe+L4br/aXI86/x0vZLRhb4lqsy95wHNvXAk2T24sfM9JwgIPTmaNr4FayM+Aj/nPU0hFD7KDaw89yRnviajoLx8Gho9uKojvmVmM72ouow9JaudPeje9TzIx1q8bksDPiBySz0yZWK9ZhxRPfBDTL7b6By+u5UivqotKr59f9c8ZXP9PT/IHL6745m+kGAgPi5Ic74mqqs9TNhBPaAOQr5AMoC9qYscPY/uOL5BRT6++5aSvQb6ib6QJvM92dgPPu8tXL5TGrK8emUVvasuHj2feHk8q1ZVPmnjyr3fmy48+axuPlaTUj4+gEi+58olvAIhOj4qbR2+4sMvvhYdx70BfDU+XHiRvT5bRD3NtlW+popRupcTPb51/0m9TzbWPS877bziPVc+3jFVvRtrR75JXVc+jDc/PjVWCz4SWJg+AtV2vmVpt7yy3YC+XZBJvWoXoL2HjgQ+g7iCPBz0LD6I2ia+lVYjPXMav7ur6Ia+FKmBPVToH7wsqh++AcfiPaWtGz7o0pi9pe0PPounUb7XCTg9ndK4PY5P9z0vWQM8jSYlPnNW+b1LrZg+MN8MvrGWID4QL6g8phnYvRHuLj75+RO+EGBGPmkGZb6elh+9cbxDPWSoDL7ZqHG9E5OGvZWQeb3cv/I9SwQLPlQmbb5gWW2+zQUdvpAiIz2Nkmo+FAGbPNN2vz2Vwhe+sbCmPlE4Zj7yDCW+3pShPt7qOr2TLTw7EZLkPY9FED2wg6A94n6fu6K3173bMTO+oBjpPZ5lgr7AYK08w/CVPes8jb0tANc9js3XPXSHND5u+0++YuYQPkFXv70ZqRy+UH9APksAVjtiLAU+4g65PZ6km7soD929j3PGPVHLNL1mBc46PNspvqoNsLxa+Vy8GDNQPTNMJj2cvrW9hWIOvgvDLT1qNFC+9FNEPq72QT6H/J49vSwHPpcJab1kRI892OpuvRsdFL4eR7U8bnvwvfiiET2U+6+8UD3cvcHGxLxMDpC9F9zWPLJuaT3bUdW8ARocPoI1Ur4/UHG9s/HSPRKgKL1TSZS9zENUPUHoGz17pkE9X/Z4vlxMs72AW4w9gkmPu82SsD1mOyy+sPOOO+Bo5ryvwAu89h8TPiM2vL1Puge+eEQWvuY9jbyQZ7U9qtxiOjm9gz1zVVy+4xIGvnAUyr2jS/g9EewDvUxgGz1Ya5U9ILsmO+80Cj69PgY+AqGEvSbmHL6la1C7aPyOvV/Hvj1S0CS+/6UavjH5jz3fa4e8W7Ykvt+zhD39/R8890qDPa2weT1CFAM+G3sDPT0+Lz6sgg4+giXhPLKoO740dTg+69cevUzLbz1fuRu+zLbaPaep070mJgA+ELuYvY2vIT2Bxxe9rFSIPME5AL6c7Ay+bv0hPuSCj71LcT6+ilHAPciSkDylxCU8G8c7vjaD8zyJOxu+Cp2cO0yTrD1EjJk9dlFbPXj2nb20hhq+KUESPdezL7702hy+4uObvapcKrpPSIU8f0+kPb+qFj4CUom9ASKwu1ISpD0T3z88pJpovTBpjz10BVq9zFyVvelnBb1U1gs+WJqnO2EsAT3LQzm+J3MKvJqCqb1QVk+8h8M1Pmz3AD6k5Dk9ZkdGPRqOJb7ygru8/asUPmc3mT3q3Bk+54wBPmq0gTs74FQ9ZGrJvdY9j70so4o9Y18zPs+Cnzzh+Qu+sGihPQLThz0W/Ag+joA9vq8+Pr2xSYy9+W47vifY3D1BSnc+Cmwru2uNmz66vJ+9cf6avXLhWDwIOOU9zV9MPumhIr6POy++IBsbPKDB7Tw+o1U+Lu7xvb9WlD2aXT29vaSBPZ3qrL1JK5s+p8YMPsKicT6qNXg9AvXbPSYAX72PKqy9IhDKPaBfOT6Saki9nHJzPaPgX76cyZi989sLvXwDpr0RHUg+LU1CPrlo47tMNlo+9iGwvXewET68FkE+RPBOvpkhUD5CzzS+eIcRvqItsL2dRwG+l6n3PS9+HT60Rwq+3bhnvXdF4z2oKkM7I6IBPcr4Yz15cGg8sxAXvvdvdL7cDQw+YM0jPj1Hwz2MOk69U7kHPhOsNL2k6Aa+it0RvpLxFD5kVdC8IrEevL4r0b1mIYU9eZSHvnJyBD5pjbA9vdhIPssYvL1WuJQ+yWeDPiECwLxFeUY9m+jcvG2CNj2n3gE8U3PAPU2+Gb5jzEc99DRUPhAfAr6ZkPk8wPMiPvlCab6e8te9tx2zvZa2Pj04oO062YjVvLDyHjzwPe69SALLPRrLxT0XNKg9h1R6Pi5Sg7y28HO9QG3/PavSD77/Eei9LvELPa5OCr4KNHc+3o7PPXHvYD6KA3495jPhvFMJqb3ornI8C2n+vNkXZD2RGVG9DHa9vatjHrymjCW+F5k0PvSt973vH8K9jG4NPvuvQr7oHfC93R6ePAAbZr4yaQs7/xAkPqIv0z2FMAE+l3NxvR4UUz44R3o9XUIaPUjVFr1R5S097XtCPdZiLL3610a+Gf0RPm9UFz4dWlk+olpavVd6az6tybi9Xh7tOlaRTb3Ji4O+8pgbPQR5gL3BTrI9H6h9vjHuNj7fwFq9gBsfPq5Mnb2IsA4+m+e3vYNbY74hAkC9+JYcvkyP1b3GKnE+Sz6Uvbf2Cj6br/G9+3RpPdY2Db2j7KG8VabHPamqibsclha70WWevT/qGz46KKE9ACMXvkNeZj0uR847Wk1GPS4Wk7uo68A95jaavd8xJj6pogU9x5SJPd8XsjzM9bg9wfiWPWrIhL3Fhxc+wbt6PgJbYL37GF0+mu4DPulMFr50aCE+ZBEsu++khT3D1la9CaIyPI7vsj3WQhk+Uo8DPhfalDzJyjo+Zn4nPdBDST5Sljw+TM61PCfYGL7jOt6927GfPdCSPz0tRgM+uvymPQEdt72pIRG+4J9LPTYXlD2GnkG9t+HYvbvwl7quZ2a9Sf4rPlqKHT5mIwg+CxAePku+yr1UVnG+XOgvPuX81r1CYiE+0n9EPQ+svD0VBJ89zOMbPpML8j0wQwc9TzoLPqo1/rwXLOg9o0P9vZVbzry9fRM+u7JLPQbgTz06E5u8SU2wvE/aFT3KZao9BfxUvruB+z3s98y9MBeXPRC147y9FGG9nWAYvuyDlz27/Kw9zqv4vAPz8T2xiVM9VrPePfIJCb7O7g6+pLX2vesXKr0aNYG9cr3ovaQIFr6ZIpA8mZddPR6PbzvJWM08GwuZPaIbBr7eOTE896y/PSynrL3gplI9iMYrvqViBL6a8gm9GJ4AvpCm9T1o5RE+WZNUPULXUL34/Ug+AllrPV3i3b2daog8psfXOy5RGr255Ai+wHXNPU4UOr7Y/k++Mx/OvNqsNz33vA+9zwUMvdHo1D0iChg+QpfxPbzTkjz7h2S9u0/mPZ6marwv/2+9LQcOPkqtVTz7oaU9JCH8vZbJSj3UFZU9pAcfPnx/1D1e9pI7k3riPTkhwL0s5PO9TUMmPak557znZi09lpADvmZ4071N8Ok9Icg5vR19/D0Aox++yjgYvowh1Lw6l6W9gdgUPm+H+r2r94I9MlK6PTuqxzoJdBa+CavtPT9mwb0SIWY9ju6nvXDUBb4hDha+AWPvvYqYOL0Tpvi93okePUFvXj0UgSe+yJnSvRWwA76lbr+8n2cCPn0PSL4WSWs9Haksvn2B9jxAYpE9WDBPPj+wJ738SeI9SA4PPkgv8D2GQgM+2yB5vHx2tT14jx++hBy2PeAQSz4jJH89afxnvaOD3Ds0HgW90APYvfXQGz43Jw0+MVtZvidjdL2WbTW+lhwOPDdhJj7Hn2e+FO9QvcOlHr6zp3O9J4wnPtPxO744TDa+XDNsPab0QL5Cch4++sgNPiUpBz5Pq649nMPpvMZPJL02/00+CVftvO8tFT68IRE+splbvgFVej0ysnK+9JM4vtUL8bzEEd86r8HlvAdavTspmXE8hEx6vudZwzyyqzs+rKhNvp+y1rxWo0087L5vvvQjDz7pzWq92bSLPVz+or2L7cO7xxEhvsrSQb5AKXQ9V2zwvYhj2D2IwgC+9A4AvqT3dD2fwyo9SAwMvpIsGr7InUY+kHIavWcbCr7hZHs9cUTJPU8Af733lPK9ljkivVnQSr5dsLq9mfySPPSAHj6MdUq9W4/ivLPVTL35MtU9DcvWPXIWUb4nV4+9Zhu6vco1wT2uhxo+1C5gu7n+v72E6X27zSjIPRBG4zuEkBo+1I5MPhUkVb4mqBE8i0rzvUy3ID5YnRa+mk7tvGmIKD1izBw92NcVPpcuBj5kjhK+J7UXPQ5KCT4Xuj++9McGPNe9Tr63AIO+7ZI+PnGwzbszmsM7W+0WPgMMPr06UYa7yum9PZvMY74A2SC7DmsqPqYdVbygTDM+vvNaPoTSzbx4Q/G8eX9+PlYcGD4/QJG+fdZlvVsQxDxHJqG7wbfavSUuEL5g/GU93iasvSLJIr4/53g9tySBPuA/Zb5rZfY9nPgDPnDIOrw3FyM+xl0ovQWLpT2/9wo+rhVaPt8PSj4qxr89FZJDPVBkhT0mZ5W9aC1JvkLnhD0uiVg+Z8QvPgBZlb0gtPk9nP1dvXUhJz5y1YG+Edo1vkeQZz5Iykc9fn6AvucSbT1Jjwy+4XsWPlQvR77Ybh6+A6NBvLBg+L2aGKy8XqKjPXNSYr6JLjE+x2URPhNUFr5phkk+sKdwvRaMkjuKhHc+3ypBPs95P76pm5w+5hukPZ9xOT7hi/Y78UGsvdQqxT0FCxg+6fgHPM+zD7x1sou+DL8/Pq5CLj67Izw+SH89vnGy2Ds634++KJA/Pef+bD6RMKE8rh6ePpmGtTkMhcq9ShEfPUdhGD2HHoG9jj+2vX9fZz0f2ya+iR2xOizr3r1+lE69FVBBvhYiQz4u9qi9gs9iPHQD5z1LyTy+2gyGvm6XnDxUmxu+CVPYvdiCIj1gIPQ9MdXBPV/tGr6Xax2+jhoRvXzF4L3i+oA9SAtTviNL5L2715W+RHGFPqKewzxSd06+7jUgvqIuhL3JS6o8LfRYPectbz1tqQ48LDvMPcaglb3hefQ9suXRPXQ2Kb05l7C99tzjvR2XAT5P1Em92zZWPY6zE77+Hi+9tktyPemPMj3FF/e9gtkdvrS+Z77BgM29yJ1LvdoazztC4BC+LP3hvU8Phj1UYEG+Cmq4vZIUFL6Q2im+Bf+qPetjGL47uos7RFmiPNIo5L3QuSw+ACHmPauDuLwXdWI9R+xfvTJojj2fi7g868uGvNxzIb3OPxs9mZrRPNIkZb0c+6W9y5f5vFOtOL46b7y8mU0fvjtH9b0BNpY7QL2dPdMi9D2316c9kFEAPn+b5jy55aC8XLH3vDPk1b27PdM9OStOvlVyhL27MdC9T8PJvQn/Bb4JV+Q90LkQPaS1dz0aZ3s777dPPCSk57zmoQK+uQ0ePWIPTT1hwHO90YIdPpXQg72ytDM9SJyROx9mDL5xRKc8rXKhvXlC171dbOy8eWYBPkbLjj3eQPa9ny+jPUd1J72jasY99dkovtjSCD7cCOO9kYBhvhbiAL4ofxW99f2JvYAtCbsRKyK+Hh5XvjUYobxY6Kg9DDO8PX4VzD1j43E8SNSRPYcOBj4Zx7i988ywvFGFAD42JAm+XaS7vWxsM75+bZs8u970PcvkcDtK0Ai+txGougLq0j1X75G9W69tvRJaMr261xU9EEQUvnGYgT2heS++Gr5avkFrRT3rmeA9aFRaPsMKQz086BK9q3/NPBWx5j2OQnq9KxmSPRCwpz2jk5s9djIDvmaJN70UAh++mRACvcX74zwhOMw8t3QHPtfsIT4V0eW9yx81vjuCRrxmFcm7zWhUPhjEIz7ygSG6yEjePd4r0LupcCM+QQHwPfZ6Gr52SLu7lldiPoQE+L2WVhE+gH2pvdbEnD0JH3c9eGPYvSrpjr0vGro9VqpdveIDUz4VOis9UFyvvaQo7j3ACTy+1XVJveJehT2llZi9LJmHPW2Kz73LXpI9DtAIvuXRor2ldYo9eBEHPljqEb5Estu8emF1PepiTT6vznY+sfrTPdOAhT0okTM9bTG5PeBWi73V1NS9G5nDvQr/Cb3qV9S9eFZzvPy0fLyO6ys9DwkxvkUVur1S+Dm8Q8TyOzo1+rxY+Ss9iZ1OPWiQijsyyQa+37Y1PoQZmr2yUA6+Z67lvTiQHL1oiPM9tNIqvt4esb2qdgI+JPauPQQ6PT70BHY9prD1PR/kKb5D6MU99feivd6s4ruhFzA+wu0APrNOmL1O8SU+51cYPRRhJz0VoRy+z92LPbUT9r3AspA9NO4PPslmrDxRVaU9iC+XvG02pj2NWJ29zkcuPWu1Hr10dts9jVIUPvXs0zzRXKg9eClpPJPsab30xYs9wCgEPkBYcr1116E97I46PktDg72cLZ89k48EPZYFej4Y5x4+a0qjPOC4Jz4Fwze+S8OfvcgZqj07L+G8ZZo+Pe75Db7TTgA+0YTevFewiT3nlKy9ysi3PUd9371antw92KAnPrQALT6KWOQ9gxguPviyDr5Tk1I9R0QZPro1rD2gUNc9kUEYvuc6sL0830M+RAKXvf3SWD7QPPi8WNpePTcNg7wDnAw+RWcCvg2XEj6FOhi8fm0Svmh/qj3fcCy8wiPkOxMFoT3TdTQ+nXoXvtjARzzsAmO8IuH1PAHNwT0gMzW+A5vBvZC6Gj7ZRam9EtRcPk0bvbtZxGI+ylDaPXu0tj2PVWu9R34yvir+jzthmv+9ZJnvPY7ckj3S5Vc+Ie7EvdDyRj3LtWY96qG/vS6QRz2OL/C9otm8PT6UELq0rYK7EC7Gvd4vpTwQLLC9jzREPQTHpL0ygK69bOJ0PknWwj0POnk9d36ZukWt371V5xU+h5ryOwjrCD4Hr1G+yiJnvewCar1tsf87fyAvPjlXVj3b02M+R0poPDiM+j1j3QI+DL1KvV+RDTpGoaa8rDK/PcPnAr5GPTg+7sT3u5IpfT0VL+E9c0K8vSUHsT1M7po7vh+VvU9RLT4CeK09PgCSvQYRtbyJKSq9Vvr2vaMHsT2W2aA9+Nv/vfuZzj3TIfo82zqAPgiMijwK5SA+1Nu2PX3duLyewAm9j09wvaBxrb0b2ra9fdqnPb8oTj1yOOU9frIBvpW4pj3Q6a29e/uWvHOzCr4Ru9e9O6eMPPDjcb0Vh6c7Q2bUPahX5j3Ew4s9C6pkvbcZlL09I5K9V2ayvSHaLj6uZ+E9ggy1vWcsyL1nQx2+f/mNPWvkmz0EfE48UOF1PRppTjzSd+U9SO8vvuHi0jzlCsW9OYFUPjWoyj2Yiqu9rvGPPU68UT05Ude9Y+ryPSvCyb0JfWW9LwfSvXWvjbwe63S9uowYvtO2eD3wLFY8Zdc7PjCAszx/mvm8NLdlvQt+Kr5+rxC+KyKhPdCYnDydb8i9wbPUvAWEnb0WyqS9+kZBvf8mMT6V8wi+BQ8RPEQcqDx9DrQ9pdwHvuihyz3y/nw9t2VYPkgNCT4g1gI+NjtAOg29Jr2pZU09SdilPa7NT7w5EmY+CdouvtDfAj5TI8w8Df2kvXJPMr0mzNW9jNwOvnvFYb0ot4O8P+QsPb1ad7114qy8+k3uvUOCPz2f7h8+neJuPSD/Qj4vmk49sGhnPQWTZb1zEBi+OKgkvqbzLb0oNZQ8ndzcvZ8llb3Bb687A4lZPQ0U2b3CebS9/Dv+PUkee71jmp08J175vHus8r2+c9w9T3jtPV2Sij1ISRE9SP/fvaOzDz0m6w++zvjjPWoqMb3JWZu7JiJ2PZEYmL1IW1K+2sElPg3WNb7IQae9NZ1APVeVVT7HIh0+7jkZve03FT4GWy6+9QvsvXp9Ib0KpMG96QF0vJrOC73ciTG9/H3YvZRI8z3c9Bu9hAEJPnW2nj3mmZM8W3aPve/Lyb2YWxS+zyfBva74fL0RLwc+Ib21PbIwHr4rMqA90hEQvifQVD57lgG+NocfvY4uEb3eZpo+pZktvtJigD4uBGo+o7JyvnOqJL6Sa4a85ZdAPgYupL0Gqn899lAGPk7G5zyGZA0+0RsBPSjyU77HLTW+LaFhvryPITyB8ye+m1bivT4lLz6wAra964TOudb3HL5Hgsm9te+aPSwl67zu7X8+9QJRPvtPZr7F+qo997ihvcLLkzyPb0I+7YJVvm+HXD3rTDa8gUAjvhQ/mj3fqAg+TijdPMWQub2UH/c9FHHUvdIyub0n51W+KZxTPWu2CD6uBMi7wUIwvjsqqb2Xysq9rpU8vGj+UL7G19O92AxUOzm5471rjpk9SQ9Lvu7LtDzfOqK9jNvNPVigCL1bNxm+Jq9YvWfyAL59MVs92fCXPGU5hz5TJqE9ehxKvmVi/r2spAO9WanavammLr4gbBm+wd0tvbNNp71cUkm+dtAkPlqHIT6hrH++oCUvPjDTTb53Bac9OSe5vbBiDD2oSZq9HDqIPgOlob39yS8+TmOFvVhyRD5UVCq+M6AbPoesWr7GKMW9Sp5/PqHEJL0LhAe+GtKJvYSbwT0X6Ai+1YJmvkwgVr4rx+w8b4U2vhBDp73vSEu+7KvFPDbeWTsgESO+xJ8MvXiePry6KkE+h0qrvaNdIr7mSHY+BK4QvO1mDz6csTk+bB3RuqKIBD5XhAG+hM6XvksylD0dmly9mMXiPcN12zsF9Bi+WqqqvYTHGj4LbpY9xxtAPZqNYL0Eoge+SnQQvtKbqT1jgNA9VxoSPV/ZBL4rfFA9JfWfPSARwD0NWYO95Kb0vY0XH77aXJ49KtMvPij/gL7M7jA+Iq4svuGTmL1TEwI9H2eSPSUvgL7ZtHo+HFkZPgUU5T0rLgu+uqDbuuhRV77gpgO+MAUiPgSJCb5rgfy8hyCDvQthqb0nW6U9/w1XvsNzDD1Mqki+6O6JPlrvSz7JGNY9YiILPguR5j2Jwew94EO1vYpri74ORZa9m/ZNPRZ1cT3b6Z2+2NeBvN22bb5Mliu+H6AnvhRLL75TAoi+YbxWvj2q1z0GfgQ94gJqvnWi2rwh82e+hHjBu6CUxb36yfO9BmxxvG4NGb4kIoS+kMpFvvwHjDs48Mq9tfOjvi3ce74DKTi+rHqGPqNsdbxPMF49QD83vh2rQj4/J42+zKnovEXkWz2zdWk+t88mPkUcbL1flZo98yGOvUAtrDwsmZQ8AU7uPOGcuT0Yvqg9BzIrvHZM8Tx2UgS+hGYVPjyqFz4sGGS9mhQ0PltbNT7+43S9Om6GvF1YYD6WKHw9BcsmPhivGru/Bh2+1c2aPVeL/T0D+KG9ixByvQ/svz0pxSU+p8XfPShoGD1N3vc92MaUvZrbFD45SqI9lnlBvUMu4D0hR0C+x/BPvJVdlb1oVn25+LaWPeeoGDxXobg9m1wcvsLS1D0lq7Y8AZsHvokvnj1d/py9jSUqvr6zLT3tlBk+xyQgPgUuor2IjMW919f5PS1hGL6xrks91fZ+vcjcFLyU/hC+tdlWPUVhGL5m1IY93v2EOehaPz63e2S90UjtOyqu3b2N+UA+ZQW5PYh/Fj68hNQ9zZkjPvVbaT3/MRu9oFEQvjcONb60VCQ+9RONvZu/HL7RPUQ+mU+YvZVx/r1nxfM9z0O7vdsTFT1iCRi+4WQfvvqKzbuP0t08fAMAvm3iEr6HrDU9zKLyvZZ46TwuC6Q87iv7u3s7XLv/WHQ9lQgHPvueyL1HSJ2976R/u5n9nr3btB09gm4yO4F1v72teOC7f8ILvmFrBL63/Vy9VqOPPXxvuzzQg3M9jUMCvdmrzL0/1Gc+GdhAPkUU/L0A3SA9hw8rPsBqer0MSsU9KP/6PWFRn71MTKS9oSjpvaXXUD5aW/U94Y7rPdpqsjw78PE9FRlevDCA3r0/23m8zZ1NPE6wsD0O9BI++n4yPngqMb2atK09zTI0vguamzysHOq8sQoKPtbS5b068x8+MJz3PSRoyL02RfM81+JhPrsSML53uO+9Yl/8PTBcQr1Qpn4+85sSPYBePr7WHGM8nruMPeSRYT7H1XQ7ymSBPlxTj7zi7LW9C+A/PM4+PL3gIi09J5v1PalxHD5Ez4i9WpA8PlGIdT7Wl4m9r7EfPTx/nTyngcq8j20ZPoqPGz4nk5g8VMETvhsvyDzy9hk99zcxPckqCT4MW5I8yU8VPVAxlL3QymG+VwWxPScX0ryFsOI8MTPQPXhwnDyI1RW9lwgbvmCaDT4lB1m9ntG3vE8BCT7F0TU9L9sMvkbY1z15Rge+ysVfvt2tqj3naZG9AXoqPc+gOj7eMh4+Kz1DvbALUL64E/A9YcDvPCVvUb201FY9gfnavRGXSr6P1369xiIQvm3Duj1hLY8+bvTIPTKEdTu806M76WSUvCPilD2sDOW9vNNkvsq/Ab5trgu+9MCcPRQovT3jfNo9c6cmvI9yh72pXZU9RBEuPsDweL6KO587ZxASPuJkhz2XaQ+8hQ7nvXlUaD0Jf32+rspzPiw49D2mGt+9YkxFvXMmXz7yshO+x5eRO5AZWj4FTW2+kg3XPf9flDxfA/y8DzMQvp+Z4z0+uxS9U54gvMqa/b1swSW+yHxevlPojz0G9+09W8/HPV1Mpz3ZSvM78gIXvpfieb2j8Aa+ZBpsvoVQrT0ozgm9ANAKPirK0j3M7bI9pNfPuzvREr315wG+PrJivc1id76VgcK9v6whPRkFqj1dWA89fhJLvao15r2H/a+9B4DqvU87aD4qDYG9JbgIPUbrPj4u4xu+ceIbPOD1670tfxw+MGI3vvBrDz2g6xA8220RPmJACj6z3Sa9JXSMvcKjGL6Zhl692elPPXQ4h74GoSi+eEGFPh7RNr50sxc+Z1JNPC2TrD3XfZu93C71PR7WITzXNs89jd3RuzLa9LzSI+K9YY78vC0Uwz08OZW8iGIrvsTbDL1xqoG9EtkrvsaObL6A8YQ8VsG5PKGtoj0MtAO9CbAgvRr/yTz8/dW9wbYGPmrxMr3LD30+po7yPavzhjyZPvw8+XyMPcZGCj6ET2y9yX4lPs2ltD2txkU9meoIuuD/Pz30rra7BBy6PVCdLj7je1I+A+6/PVM5Bj5vC568Om3uvIHamj1LITa+wcFIPRIROj7EtRU+tY5+PdCwwD1gKg+9HwC5vaXKi75NVPS97oKbO+Lp2T3QWxG9v2j6vabfOD5U0wU+2pySvR5WVT0NyKi99760PYgREr3dhJ08+dIPPsWFQj2znKo80Hi3PVv3jT0NGz2+jZ4qulv//L1/bjy+AmwQvpgNW70LoqS9OK0RviZOHD4i78g8nEBNvSU/pL2klRk+8JAHvmKFDz6FD1e9Zz77vKRm1r3idPo9Rq4Mvh1qLr4cyd89U3wOvj7KNr74zp89fPpLvtcHfb2qNEg96wU4PYYr0L0nNeo92jprvSlkAL4cwAu+OZD0vYfwTb2n/O+9QO3rvegEyr2LSTW+pAUHPqZc9r1erbo9QeAIvnr/8b2YACI9ry8nvrob/b3idQA+wmxevlOOCz6r06S9/F2gvTIAxD0CXMW946svvgUlAL6fZqw9k78/PY73B75PlDM9qsqavexrPr5J1i481RYAPoJyWb5R79u9iPNbvWSXPL7WvBg+BtCGPUbHC75UyKA74FQQPs6b1r0/KS0+EbwYvjTlXz28jDA9+kKuvXp2Gr0MrU2+coqwvY7yrrqskVY9zoOcveZdyzxYkwy9v4wPvtWrE73Sd+o9CVO5PU7lsL104ts8i8wgPjKZ0L2q1yu+dbgoPcDZmLxBIlQ9vDtGvoJ4S7491iG+nhotvsbw5b2iNNS9+iflvHyrGD3jDKG970LJvP/Qhr0b1g0+4vOJvTdQJb7gB3g9i9L8PLnWOryaGtu99C/ovSPWJD51eUi+KDJ4PR479TzHyRc7GYDZPbl0Aj3r+ru83XAfPmzNnzxpHZY8ptg3vfygGj4aKSC+L/I6PBUnRT1yUJC7dvyBPqH2x73gQxK9buYUvkprCz76YGM9DEV5Pj9UQz3MK428UT/1PfPT1Twcxqq9XoNmvZofFrxu3vW92kK1vXBJlr3o2kw+PyL8vXdI/j2cATg+nNyIPbKIDr6j/gy+M/PUPCKPVj7vggU+DjxQvtqHtDymlSY+N5QwvtsIuL3aRR8+Q0MIPvdnlb2Ir+G9zwJQPvmRiD1lodg98oUEO+Xr27189SO+aV7GPXJ5ijvVfeC9F126vVHpBz7nxcA9OZXUvfnOvLxLvR++C2w1Phjup72clio+6qjnPUs5gj0+hZS7kQQJPksf9j0BXmy9ba2mPT75wz2Uiym8SfrqPazyPzxic8y9tMZju+Rt772R4Oi99JDpvcZA9L0a0b69/twhPRq4Zb0Noyk+zhAUPjKpS7yJQrw9XlKgPYCAlr0Uahq8dBpzPehpID6Vg5w9IGB1va6arz2x1oO9dcQEvirJEb5IcZ296HuMvU4CED4B2yg+ae4RPjuDKz6G4ek9GQ6HPEhz/T3ngW89ut4yvhIrBr4wxxq+qO0FPnLGBT7TNCS8gZN0Pr0k0z1EZFK9xnAjPrUs8D2qDQ0+1YQvvlWvCD5P19+9iGcFPoVzGj48F909E5RSPnVU4r1CZhe9MIqTPpqkGD6sTmk9+16ZPeI0fz1oM0C9F97EvWAECD3FbiM+bubFvRk4jDwZZg++W58DPhsw973uPT++SSgnvh9zQT4TqT4+WWkmPmUSuzxQp4G8fRaTvah41L2tbFE9kWc6PE9+Gj6rIj2+hVFOvlSnKD7BDEA++ZhHvrNb3D3zNpk9TetKPWjeWT5RLk6+hJryPfC7Vz1ZhnS8AxVWvaVZ/L1xn/C9H4myPOq6Tb4tQpA9mZlNPe/KKz5OViw9A8PQvU6/AD6+CcW80u4qvdspvzkDNy0+FKbBPNo8tz3Cy0w+qTdQvjZ5iL5cEuW9bkPGvZMZ1TylZ4U9WhnHvWqUX74ijtY93DwqvgNrfb6aJzO+P+CdPVWWVr79FyU+cCyVvbbtkD34ke69mc6UPUGmCL4gwK0915wFPgkuTb3kqGw9U5g8PjBiPrzX1SE+j3Dcvc/KcD2h6n++1MHevX+icL2iNJg9AQsaPokQmb1ARAI9WdBuvWahLj5fMku+voe2vfiy370Yw9M8J5lNvqFfMDzlOgc+yYWiPTPH0j2Zhp68DzAfvaJ2UL5/iw6+IZUuvoCn8b2yQ/m9ZJPHPS0ESL6b3Bo9cTKzvYqepL0KCUy8lhjWPCyISD5PgAE+5Pi7PU7al70HGNE8PpgcPsmvhz1LJuo9N+eWvf/Q272dtXO9v2fFPcapIr6BsJY9AimJve1ON75ZeSe+dHoUvrOpqz0yw/w9ITrdvR2W4buTq/46N8sAPXSJPb5CXlC8OiibvepoZ73wBI69vTHEPevMBj5NkvG8NL71PPGm47tUXgM9eLHZvTJUzr2kA1O9J8ovvoU1mruzhhW7U2tGvO49mT357wU+7xfAPa5Szzzsjq09rN90PYICBj4LHPO9m8CvO9wXBz6siiS9mVSLvfICTb7B4zS+gjOmveo/gL3ghfm9T/38PV+HdD2rr189OHU/vjpfrz2Kt+w91AcHvjRLhT3MNPs9DO3kvb2DAj5bvye+w6FgPAJiKT7ouSm+fpdKvqoSBz5SHuU9D6eCvZXQgj1uBBM9+awvvYS11rzJvAc+AzPKPdj3QDzLwye9YjkcvoOUbb6q9dY9GX0pPjJV7rw6fAW9qDY3PJR39T2Yic69EcGxPepYgL3L7Bw9x72wPR4ajL2k3mO9xtIivn4oYb3fm2W+UPmsvEDBGD1YHa68REQQPQ8VRL5RK8m9gwGTvLDKtj3jDgO9dAdaPdm80j0HjGu8CYEaveAsOz0vUbG8QAH8PS1IF77UV/Q8wT8dvUlEyb3ctZS9nmH0veE+Ez7GQ1y9wsuwvaeLXTzJezk+mqA3Pi7D9zytjhg+rAYGPVu5Ib6/Ll68LPrcPT+JMDyvz2M8RzEEvt6MNb3ujFU9zaPnvbzNWz58i/s9LDUBPu9Ctb1S4Re9L4zWOww1ND6EzA0+C/tXPu04PL0EMA4+DdNCvF7EH757JFk+hfYgPpZ9erzkpOM9PBOmvZOJA74Pfgo+r18lvVw2tz1ulQc98g2pvVTPbT3B000+44IFPcWww7116hc8XhrwPGSIvb1JJOi9hZtyPXyxiz30v2o+cCAlvS2uA75r/G4+hIJtvV2RZ70ZhfW9G0RQu2EKRb7Puay7wFefPM8tUD4cFdu9HvJevSGpGT7HaqG9/hBtvUbO/b10I5y9SNQHvWaAZjy6KPs9phKaPStpvz0hnOs9H5+pvShpD75IVb09YeATvgkjsjwkLLS96fMFPpuWZT4FOQe+qG4zvfoRRj6M2xI8/4SvPdsllr2eLTy+wRkevpHc5j304HA+9JoFPR4SUz3RrM096bNavayrAD62nxw+pzhDPhciP70F1xi9WUIwPtClJT3EP4o92sVZvZcUqTy0Mga+nFxVPg5KY75pby6+bYeHPMYFRr1F9KY8s+cePgjGKD4onRy+V0G9vWNWwr0lIgG+wHNUPnjBVb1U2He+K+LkPbKvQD57pEW8tBKIu9+j072evjU+9jNCPhoSLL0FLok99KEdvq8LPT0SwX+9wzobvrvNyz3LWvK9Zi8LvitFg73XAoI9cmcGPiEADT6pGpM922nyPTSNkD1iHxs+ZEUYPoXx0L0fDT4+GWAuPqSTwrxXo/m9CbYDPqA9q728rCy+7kTQu5n66j2/+SQ+nLnKvZIH/TsO2G28SecwvrvRzr07H9W9K0EDPrVMyr0XMHw+IV04PtCqSz0RrJ49Yd4JvvGk771iYQ6+/PW6PAqs0T241Ki99MmtPS6YRr5LQ9Q9sqcGvuogVj1c6gC8DekkvqeRMr7+mnU9hugZvj6pFr7CZQU+cGEXPhTOur2iN909QDXovSLZbT7mBnQ9RggovsjiBj7ohsQ8Y4SFPkrZD76xQBs+2i0rvnYFdL30Yhe9t2oSvkRknr1Qz4E8ZnJ1PYlbyz3dnQO+ucZQvumuBj1SYsm9F5SDPn8/YD5UT089QnvtPZALf71pby+8dWBhu6uaE74E4629vpCRvSMBUD7xWtC8WWcIPftFCrxsy1W9vkXcPQrv6D2/N6y9Wxo5Psm2Hj70CJ09K7NgPfpLPD5pl809jkoHvUfX673EC5E9TdVRvK+QRL1fQQ8+5/8CvvaoPL67FyK914ZNvqGh1T0hGR6+e/GqvS6iTz0hWA4+nXBOPoR8BT1JGf+93mX+PMNupz2f5iQ9"}}}}, {"name": "sequential/conv2d/Conv2D/ReadVariableOp", "op": "Identity", "input": ["sequential/conv2d/Conv2D/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d/Conv2D", "op": "Conv2D", "input": ["Func/PartitionedCall/output/_2", "sequential/conv2d/Conv2D/ReadVariableOp"], "attr": {"explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "sequential/conv2d/BiasAdd/ReadVariableOp/resource", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}, "tensorContent": "jFKdvFX9hLxYQMS7Ih8Ru9FsQL0jzFq8BRLuOluw1rx8LJI8ZZiSvLAtm7zOHwe8FhcBPD8157uMLZa6vLLNOyjjCD2hQKm7Ddu4PMpFCjuADDG9vDMNvIo5Orw/Xem8gQmVPFneLLz3PAK7OXRavGJcZDxRQ4u89BxjvI/chTwTBeu5ps9PPHUrZrwvWKC8wy7nPA6ulrwl/Se8U+OePEmFK71efhe9UwtDvEoRbbxfI+q72mQKvF1zQLyygM+8TqtnOsOtlbu+1b071YlsPEJ+kLxMuCO8VIhpPM5ejDsRerS8UYrBvNavGLuI3sw6RPoDvYtHk7t2PxE8Pyt9PKMfwjt9x2w8j2yAPKYXjbyGoSg8nyUxPInPmDxJRGm9LZGyvISbRr17EDU8j1xiuoYLl7z56VE9UDrbvE8yHzxgcE280dL0POKUyLyRoJe9yFa9vLnmHr1xcre8OnYgPdQSArwTspW82M8zu1e4UjpWqa+6BCkZvapCOTzv8/+8GkAmO+RwjLp9EJi82ncnvL4dn7wouDW9WxDDvAZhnbuq5SM8ptuluWBuxbfJ4dS8S4eUPN6HhrwSorE8mio6vOoPybw1aMw8gQ3+O+ksg7syioG8LK5pvJhDdTw7mck6ZkuduQjPLbzbEZi78gbAPDYKrzt0CT69KtF0PBQ9oLw="}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d/BiasAdd/ReadVariableOp", "op": "Identity", "input": ["sequential/conv2d/BiasAdd/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d/BiasAdd", "op": "BiasAdd", "input": ["sequential/conv2d/Conv2D", "sequential/conv2d/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d/Relu", "op": "Relu", "input": ["sequential/conv2d/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d_1/Conv2D/ReadVariableOp/resource", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "16"}]}, "tensorContent": 