{"format": "graph-model", "modelTopology": {"node": [{"name": "x", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "16"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "fire_rate", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "angle", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {}}}}, {"name": "step_size", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {}}}}, {"name": "strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAwAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAABAAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AQAAAAEAAAABAAAAAQAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice", "op": "StridedSlice", "input": ["x", "strided_slice/stack", "strided_slice/stack_1", "strided_slice/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "end_mask": {"i": "7"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "begin_mask": {"i": "7"}}}, {"name": "MaxPool2d", "op": "MaxPool", "input": ["strided_slice"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "ksize": {"list": {"i": ["1", "3", "3", "1"]}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "Greater/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}, "floatVal": [0.1]}}}}, {"name": "Greater", "op": "Greater", "input": ["MaxPool2d", "Greater/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/PartitionedCall/input/_0", "op": "Identity", "input": ["x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/stack_1/values_0", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAAAAgD8AAAAAAAAAAAAAAAAAAAAA"}}}}, {"name": "Func/PartitionedCall/input/_1", "op": "Identity", "input": ["angle"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Cos", "op": "Cos", "input": ["Func/PartitionedCall/input/_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAAAAAAAA+AACAvgAAAAAAAIA+AAAAvgAAAAAAAAA+"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul", "op": "Mul", "input": ["PartitionedCall/Cos", "PartitionedCall/mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Sin", "op": "Sin", "input": ["Func/PartitionedCall/input/_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_1/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAgL4AAAC+AAAAAAAAAAAAAAAAAAAAPgAAgD4AAAA+"}}}}, {"name": "PartitionedCall/mul_1", "op": "Mul", "input": ["PartitionedCall/Sin", "PartitionedCall/mul_1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/sub", "op": "Sub", "input": ["PartitionedCall/mul", "PartitionedCall/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_2/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAAAAAAAA+AACAvgAAAAAAAIA+AAAAvgAAAAAAAAA+"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_2", "op": "Mul", "input": ["PartitionedCall/Sin", "PartitionedCall/mul_2/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_3/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAgL4AAAC+AAAAAAAAAAAAAAAAAAAAPgAAgD4AAAA+"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_3", "op": "Mul", "input": ["PartitionedCall/Cos", "PartitionedCall/mul_3/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add", "op": "AddV2", "input": ["PartitionedCall/mul_2", "PartitionedCall/mul_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/stack_1", "op": "Pack", "input": ["PartitionedCall/stack_1/values_0", "PartitionedCall/sub", "PartitionedCall/add"], "attr": {"axis": {"i": "-1"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "3"}}}, {"name": "PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAA=="}}}}, {"name": "PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AQAAAAEAAAABAAAAAQAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["PartitionedCall/stack_1", "PartitionedCall/strided_slice/stack", "PartitionedCall/strided_slice/stack_1", "PartitionedCall/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "4"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "11"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "11"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Repeat/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [3]}}}}, {"name": "PartitionedCall/Repeat/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/strided_slice", "PartitionedCall/Repeat/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/repeats", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [16]}}}}, {"name": "PartitionedCall/Repeat/Cast", "op": "Cast", "input": ["PartitionedCall/Repeat/repeats"], "attr": {"Truncate": {"b": false}, "SrcT": {"type": "DT_INT32"}, "DstT": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}}}, {"name": "PartitionedCall/Repeat/Reshape", "op": "Reshape", "input": ["PartitionedCall/Repeat/Cast", "PartitionedCall/Repeat/Reshape/shape"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/4", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/Tile/multiples", "op": "Pack", "input": ["PartitionedCall/Repeat/Tile/multiples/0", "PartitionedCall/Repeat/Tile/multiples/1", "PartitionedCall/Repeat/Tile/multiples/2", "PartitionedCall/Repeat/Reshape", "PartitionedCall/Repeat/Tile/multiples/4"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "5"}}}, {"name": "PartitionedCall/Repeat/Tile", "op": "Tile", "input": ["PartitionedCall/Repeat/ExpandDims", "PartitionedCall/Repeat/Tile/multiples"], "attr": {"T": {"type": "DT_FLOAT"}, "Tmultiples": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AwAAAAMAAAABAAAAAwAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [0]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [2]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/strided_slice", "op": "StridedSlice", "input": ["PartitionedCall/Repeat/Shape", "PartitionedCall/Repeat/strided_slice/stack", "PartitionedCall/Repeat/strided_slice/stack_1", "PartitionedCall/Repeat/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "begin_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [2]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [3]}}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/strided_slice_1", "op": "StridedSlice", "input": ["PartitionedCall/Repeat/Shape", "PartitionedCall/Repeat/strided_slice_1/stack", "PartitionedCall/Repeat/strided_slice_1/stack_1", "PartitionedCall/Repeat/strided_slice_1/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "PartitionedCall/Repeat/mul", "op": "Mul", "input": ["PartitionedCall/Repeat/Reshape", "PartitionedCall/Repeat/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/concat/values_1", "op": "Pack", "input": ["PartitionedCall/Repeat/mul"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "1"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [3]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [0]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2", "op": "StridedSlice", "input": ["PartitionedCall/Repeat/Shape", "PartitionedCall/Repeat/strided_slice_2/stack", "PartitionedCall/Repeat/strided_slice_2/stack_1", "PartitionedCall/Repeat/strided_slice_2/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [0]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/concat", "op": "ConcatV2", "input": ["PartitionedCall/Repeat/strided_slice", "PartitionedCall/Repeat/concat/values_1", "PartitionedCall/Repeat/strided_slice_2", "PartitionedCall/Repeat/concat/axis"], "attr": {"N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Reshape_1", "op": "Reshape", "input": ["PartitionedCall/Repeat/Tile", "PartitionedCall/Repeat/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/depthwise", "op": "DepthwiseConv2dNative", "input": ["Func/PartitionedCall/input/_0", "PartitionedCall/Repeat/Reshape_1"], "attr": {"explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/Identity", "op": "Identity", "input": ["PartitionedCall/depthwise"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/PartitionedCall/output/_2", "op": "Identity", "input": ["PartitionedCall/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d/Conv2D/ReadVariableOp/resource", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "128"}]}, "tensorContent": "GlV+vUbt4zzKBK891PGevaZN0j1MNpS82pqfPd8lSrwHHwW9WVOdvWCa6D1RvsQ9AOD2Nc6nVT3EnyI98IT+PNEQW70rMg4+/OaIPLMN/LxmGz09GTEcvRjNFb0ZBsE949MuPRZ3Cj5exie+5xUPvaESLL5T9iW9rihguefoH70joRS+pSmVPCCOhT2Jpii+ePoVPeFD+T0ctRY+WwgJvpr31L1Knes9wMlfvL9ri721oBY9zMGePTp9UL7xleU88td7PW+gcj2hVRU+zMspveDv+D13hco9JQgNPR2RT77idyi+sunrvRXQHb2URNk77nfMPQ6HJ71RFqi9meSEvWATMz4F+Uy9sInKvRxbgb2r4cA9+rJWPXH4vjwbRaW92h0nvVkFmrwmPOW9foNAvo+F5j1goCC9x/xbvlTz6j0xYDC+k9/evd8qCT5eNSm+uUTIPBXSP74r2aY9pThUvtK3nL0nuTS+8IW1vAZcGD56woW8tKaFva0SETyV7GO+EjI4vUtpsLxHocG9E0ZNPU+GRr5Uq3i+WuXUPbVt+70yRLK9ESU8vq63+T1szhI9mECRPc8avb23hLO8RQI5vtXzJr1t5x2+XrnTvYG7mL2Zau69DvnsPYIYEr3CKcG9bm/nvfONqr2lsAK+3JnnvRvL4L05JAo9YkcYvvhO5D2EAw4+x14NPezIHT7o1zQ+u45iPuOk5b3atBK+4DJaPjOmd711sCw++Q8gvqYTXT6uu868Qh+yPW78H7xAf7Q8HhR0vG2VmT36SX6+OI0ivlKqhj7K5le8kEXcvNPzdr0Qp6M8pnQ9Prjdhb1mFiE+oZI4PnBIHD6VWgW+3TgsPiwa9T0/3lI9Nq3OPSlZILsZDuQ93VNHvUeQHb1SADa9i9BYPhIaHb3XiGY+VlnFPUFfQD7dM4q9i00uvpP0+jz7vAi+HuecPa/mDb10OgI+c+dEPhv2Er4GRpS6gOMBvgCGg72Tafg8ScMJvbTQCj0AzT68kzDWPb6iNz7Ok1s+wa4IvjsxQT4KZ0e8pCM2vbTFJj6MY9s8i/7mvL7mNz6h3Nw9QMnePTN9cb1MAEm+IVgZvYlE1L12vJk+gdMiPrbIHD7uRK29hgAxPn734b118Jq9IusqPTXAGD7qO3e8h+foPSVvyj0IiKc9teUCPpF17T12yEg+LZxIPRjAD74Ukyi+G+Pvu1xErrxZdTI80uMevleX8L2TyNu9OW2YPkex871sjBK+niEoPXrllbz/mCe9z/5jPjewGL7qjpg90rNBPluHMT6G2eo9FVBvvcAqRz5xZhC+CdSbvYCCwL3eT32+ZDDpvQQV/r2eRgi+rsfZPYLfA75CbwI+X+nWvUqPwT3gNRs838ofPEr3tr2rOKY92bLxvY2ddb4l9U2+lkHKPCPmVj6bWTQ+IAJMPgh9tL3mVyo9/SFBPsBlFD72+lA+tgF+vAQ6C75+JTk+5R+fPTlHcz124w49jhfGPWKJBL0JWsK9ZLEQPsfc8DyUs/29fkUXvtWVUj6PpVy9gU/jvZz+Pj6Z6UO+g6MVPY3GFzv0ZG49T3ROPGaYcr7G9Rk+uGZPvvge570EJA6+Cf1bvn/iMD7Xqow9rVZDvgqLML3FBQc+1x/svGKOCD7p2VQ+NiojvpOGXb0pyVW+/clHvmZwqr1Poj6+AbGJvhwpDr7KcaO9dM8jOpQ5sLxRxEs9BtaRPUv4Ej758PO9jSOpO4p43r38eFM+0YAjPNagLD59NDM+wa9fPBUfBT6RQx8+/9yzPaECcL3iBUK+dzmAu7oGt7yTKrQ8+0OkOyHH9T2HNAy+u2CCuwrV8L14YKu9M4mbvesThL3QZGE6sc0ZvgunGT6EBfw9QoQkPpvX4DwEqg095+tIPi+q7L2cBs09g7MfPkyueT2neEs+ugOAvYYNg72R2wQ+1wVFPvyen70sqwE+/Z79PTW1Ir7cKBU+pO56PZXANz3DlU+9O/Z/vY/K/j0ZOrm9ZRq8PYmCCbxkI6c9cse9vQhd0TzB/YS+YJEWPkQ/9jsMkzc+wV0UvQ1hjjz1A2I9JfpVPNjpeL4QjB++lPdYvU/HhL0yzS89Go2DvL9+Nj7jhBa+sibOPSyoGj2pbxO+2G2PvQub+L1Dvro9zeEUvuAsRb7JM6A9RTYGvmMcmDvTrnq9asJwO82vQz30Yw++yZsfvpBR/71klCo9zxVYvlR4UL3ZG3a+wLrJvb+Nhj25lC095hsBPfbuKD7MzL89I68gvk9fsz1Drw+9b+efPd3ELj7KdHi6shO+POFwBb7e6JA59mwSvgQbgT1pBfM9DYAivl7RLz0yfAU+xUnRPXmbRb41/9097Ty7PbAImDx1X4U9Md3+PR1PHr5XdQA+L0L9PFnDoj39Mqo9HFr5vZQQ3L1Rxde929UtvlOUjL23jra69xzSPbU8pz1FrDy+uoVkvvTA5L0cGRS9iVELPWsl1b3c07o8+odUPqRix73XPjq9faETvsX7Ozxz3P09K+U1vtd5K77YSWI9IPfqvdwOg7zbst29ClkePkV8qj3JJq+88UKkvdme0j2o47Y9iHKmPC9sE75J/TK9ZAucvdNeAr5EWvA9AAARPdd42L3uJXO+YIyWvaIGG7ywalw99a8ivd34s72d2oe9FxUzPWPq1L0PYJE7HDQCvo+BDT7NKZg923MSvcewHT4m7+897CzdvZrh+DxH0pw98H+JvEMCL73wMRi+Y0yHPlGM0j1ZRiQ9ESSAvUIYFb5opMK88A3BvCpsmjwJnlG8U8WHPXNNez5h0R4+l5JUPC3X1739ZFE+uGAaPtM5Xj6gOR++OvufvK2JGz56SMk9rLYdvcJROj7rMZs9nQoIvXpAPj6MR2A+RbYQvcO7VLwspfQ9YFefPSCEJb5U+tY99en7PUq47rwlEDE9wY4wPp+hq7w+ipA+8UMEPTcXTzyWBEQ+/FVfvqLoMb2AZ/I9tPLQvQ4qHL6lx2U+XNGKPfFHH75A7qI9C6GEvcoy+b3fzE0+qKxCvNAyRT3DEQU+9OwXPhjMH76Xxlk+G8KnPQiNlLxPdPi8Xz8avhx+IT5ygAm+BNC8PSK/hL0gTD+8FdjTvYZjsTwJ37A9zbD8vGz9Mb5lR0i+hhT/vDVMF756n/49z9rbPeVEPD4K1Vq9zQoAvdREJ71eEdg8GsjfPJLUET4oKvo86QIBPlb9a7yA2CU9X/FkvdQK9r2TEoc8iCbTPS4elj15D7m9o7x5Psuu9j3+i1k86SU/vn8XJr5jm/49n0SYPSr+0z05Gw2+LFhDPiimk7u/1g++FM42Pk02u7vi2pM9k2oAvd56rT37tro9wP9AvlQTqbxxqlE9R8m4PVBkhjyFV8y9er0Jvko9Cz6d4B6+eaeGvdlw471qcJk90JSyPYiazb0AcVc+7pEgPu1L1TzjCm49ZQPzvSJwN7y5Zmm8Kf+uPJjHHT6+TR6+eDVNPgnrqDwTY8Q94B+MPSX2B74w1y299B/rPRlTO77tlzk+AiEuPgrXYb6h5Y09h9YJvhZwMT46yRM85EkxPk2cOz11r9Y8s5QaPtmDxrxyNww9yQ55PGO4KT5bG0E9+f5dvmPpKr6+ymc+6AVCvFRwI77gCU4+Sl0Xvu0KDD3apYo9RmHCumFsQD5lzCQ9v0CEPR6i/72caWU9dZ2wvQU5Kzzjz/e9t2IHPl4vSr7v3yq+MjywvXOHEj4PzyS+IYdrvjUsaT1zvYa9bx/Ava7EDjyA0ci8ZLj2vaxRCT4YMys+RGEIPl2gjr3mzC8+EHSPvVN+t7uFaSi+YVs3vk2DT7sLmI092mb1PbXiPD7LaL29v2Vovjd88j105gg+0fFWvjNVHL6hcUE+b7wEvvoCLb0SKkG+nKc1Ps1STb41Ago+2rnVvIm9Lb3Sj0Y+DfQ+vM9J/jsiYQC9Sj0hPNQrv70Iv0I8qSmMPeu3p7xEYOa9vvlRPsmo8jwfESU85HcvPl8M7zwA+DA+Hq6+vU+E4L1pQ5e9h+CrvdnXKD4Vjym+mcNhPaYFaT4N9Ce94WUnPfxDZzxaJjo9+dtdPbY+V70kgVO8JvmGPTjgVr3zPjW+fMCXvWWqLr3G9Qy+arazvBnM5r1EQ4U6rsNAvR4OHz2I87I9uiiZPS6oED5PosE9noNYPTsfML7ZESg+IKCnPTOscT3+HT2+9+3Hu7J8ur29G449r30yvhGasDwTpd09WA4lPJMwqT2JB4Y9sMIEPkZIQr5TnRM9EGKWvTTPBD6kdNS9D3civgOG771Kn4Y9yGsnPhuyIL7WowK8S5kePhvybr7Yahy9MPlmPQlsBT5wdzm9GOr9PSJswj1HjYg8CU1UvjSXTb6N6uA8WXhHPhhvCj5CI1G+MS02vS7evD1ifxg+4f44vkNJ5L0MfCS+g2WgPMlBCz59i2I+y2tLvk4CAr4ijOS8tyCpPX+IsD24FRc+OQCoPBrxjT0dexs++HzBPFeA+L0gJqS9jwtxvnYMr71WweK9NrlmPR8sPr1qkRk+1+uNPW2HWL6vATO72QvNPHe1DLsKUrA994w7PrPI5LuwMiU+hTQWvTc0lr36c/S9sWZsPc92v72yPhA+DK2NvQcDuL3WS4C9SonSvURr270XEkW9J/vnPTyoGD7cldY8aYUwvmuN0rxQuIG9Ir3RPSDkvb0H9iI+ECQrPluO4z3Rjca9DJujPRj5Rry197E9IywFvldFBb4+Hk09zbJSvQ6DsD0rqi8+7TP0PRTPH74F1hm+geu/PXRjz71Ddk4+ccxjPjpZ87t54kM+FSQGPYi5Y77Bb/O8XcYAviIY7j3NPcM92JYIPfTMMD1coos9ZIcAvlOSND0jB5w9e/9lPdBcID6unh2+Hyadvfhmer23XQu+mmxWPtZT4b3SDIw+WAFrPdcYDr4qztm84G0zPqOjED06QgO+kctfPpz/2j1PIuO9/ytcveweQT1Ck5A9cdGNPJjJcD4R4k28LqUmPgB6HzxP4jO972U5vitfPj5i8sY8MzN+PJ5LEzyr1is+CWk1PkRYOb5yhmQ9d10fvPy/eb1rhsI9TJtdPTevmrz5S+A9HIqevaRW0zzCC8Y80JfcvG+aOD4w+l8+7ldYPqkbfD2SGnK9dZfKvW1YfL2qa3A9hGy+vDiSDr7wwTA+csiCPdnlAj3S6Ea+MQXKvGfYdDztOU88I+6WPSRiJT73ogS+C+3UPKaz17zI/7w8OCtsPps2qz2slGm+nXaoPQwj3b0nsqQ79mggvs7aKD6gz1w+FPeQPZE7vbxqNTO+lZM/PuKVIL4hxAm+0P41vt73Hz2Ifpy8qb4xPUK+1T3y2Ry+mA3Xu+08Q76IeJS9dyfavemU9b0pfZ+66w0xPrCvB74CNT6+ztUPvlcr8T0Rd0a+hqiKPdX93D2CyT2+eeUIvUmrrr03zVA+tRS7PP9oPD7RWc8998kXvn01ez26Fas95ZPLPcvytz0xD1A+IXk4vt/zgb59O+M9rbsOvJOWD77jn+g87uiVPGOkur2okj48DdzrPYiMPD7BxgK98gAtvqbwQj3jt+I8+XeWvfu9/L0AnCI+xBIKPmoALz76XLO9NHVmPrBDTz52+LA9I3qDvTe2Dz75/tq99V11PUL2fT38tiW+870TvidonryqrwE+BY+NPQqrcT062nw+UoqqvBHocr7tAx6++wMEvt0uQj4usiQ+zA5evnIoSb6q6fu8yN2PPlN6G77iEr69+hZevlKgC74PyQm+ZLp5vJvHKDyiRF++t7X+PZ6fEz751oY9q6YHvoFCPT2aDKW8Q/HVPT7YkTsYuzM9lxS9PTS+kDsg8wo9JgCgvRXQET6NSOo917GRvB9Grj3Vlho+24iEPVFDdT1+9B2+pgY3vnvmHz592L29lZrKPaMwFzxi1Da9wP5lPU/GibywdGM78koaPnZ2pjwLdNs9jgWxPUjW4r15wEy98+nYPdBqxT1vWQ897PeoPUEBZj3sWRA91mcpvtkmVj5tA429xie7PcDuxL2VcVm9gO7jO5yRBz4VRXS9RDuNPlOiXr7RHYM98/zlvZiI2r0uvEe+lvXOvELu0T1i6iG++18UPp9gO74rM1I+tlAavjFGDT4UU6y8HiHQPaPgBD6LwAm+ShmEvYoytb0xFyQ8ox0BvrB3qrx8x9u99TgqvQIjJb5rkbs9FQeRvXwEAr3JACu9PLHzPT9eUL5j3PW9XCkLvUZi2zvrExy+BVekvJRkQb0AXPu8+z2BvWxCmTyhWLC9UU1sPVO6YL277yQ9M9ZZvQHsLr5wjQA+kJASPWZf0z1pyjW+nWDnPUsTOrwrBQ88m0v5vIIBFr7DgGO+WuebvXO0gz2a2c48GhEEvpVEKr1UqSO9fbujvdtf6r2ce4K937ncPYn9Fr7Qwfm9kcOsPT/uebsUBCe+Eac/vjzCEz584De+QoXIvQ4sa71SQGg7WVSsOyHr4j0FFD2+4+0DvvDX8D1WVE09P4EhPeCbpr34vh2+AUmFPceZED46oXU8E1ssPYjzmLzXnhO9ToxePLAXpb2tBBc8v53IPMTwv71AhA+9R/YVvq9trj2lgs89dYalvdfx0z0nkdu9sqj7O86QKT4AbRW+1dKAPY7oHj2+bcg9KLHKPSgkJL68OgQ9eSuxvQOSWb4mSfS9KwmjPAwDGD4kEko9Cy0YvnQlLL4Afqa9gUkSPupGNL7F4kA8kLOcPZdt370ELDg9ohCwPVmg2z1YFiO+Sr+XPBIS073vVjI9npjdveVBUL6KSiA+FhQYvjkQd70TVCW+8qcHPsGmp71vOre9V3qaPbIW9jwe2NU9AeObPFXjA70SIz89DwyKvSQzjz2DCxQ+DPmPvczXRD7OxvC4thCpvSVwwj33g6o9Fg+xvcB7Pz4/0pa9gEBtPnSt5rtAvyO8SBMZPiq3RD7gbuK85k/NPW7bxjwWCH69tD8vPjwTLD7cO+A9xNW7vU4dDT5BGbS9NrkJvuisBb5o6Kk9SXO2PYbr0T2QgNO9BJejvBVbFbyxAkg+8blKvbTYXT4w0zQ+gjkSvkKOTD5vnjY+N97aO2UhWz4Bnhs+ccMBvuSRSD3ZBx29w4AjvXQNO731pPw9DPFsvCEOCL4Vv0A9iJblvXD6Yz48jc47TAMYPTiIEz3+1RK9NF1UPu5WKzxF3Wm9jlqRPNzLy73bFOW9BjAQvk2N7D1dFyA+XiCHPSjp1L3UQGa9n4zxva9b2b13MX69okQNPiuFyL09Rn87C38su12y7L1Xx0m9Fg7evYUaUb0NKsa9lUk0PVhaVj5zCQO9IjDXPXpvzj0cV469IvElPts4MD4zCF0+N3RyvS2QVD7GCA4+3h05vqBaor0igHM9gmYvPZa/Hb7WNQy9kB0qPQXSqrzV9ZO9m0lXPqZ75b2ekAc+UGxyvEIEL77x2VK+OhRCvrM6uj2DbPK9f92lPexzgD3EDT++T4T1PYtjTD6Ssxe+ggoZPqTSLT51UUI+pevCvT3bHz32JnM+khLwPDiPJz6qmU8+tTCjPQKyIL6eT968/+eFuruqAr5LqCU94DAlPu51ej02dQU+oPW2vaV7Mj5FnMM9fhRwPOe+F744xcg96xYMPhaqab6A5Uq+QW1EPWmvA72gjm+9HzedPgfQGT6tjwU+uYqsvSAW1z1VBls+ST99vRl3Dr3Z1Kc70VkxPI0pLb7KWtC7xcEWPoLoMT3XAxU+sF9Gvjb1oDwHW029cG3TvU+p1LrTFgo+4ZAOvnGHCr405zY+zz1nPWEhEr6kH6E8YQxnvYQuB70K8YS9VCQ8PZCBo72tZl8+PUoIvjoCpryHGi093dUhvhW5HD7UmIo5WIEIPhs0lr3mu289qjJFPWBJgz2Wpy0+fYbxvTp3Gb3TtAw+1INHvYsxRj7MPgA+RVuAPf8jDj7MHau9TSFdO+wmv73LaOM9TXMwPlr5aj60NTG9/g0fPh/FvL1/6q69M+UIu+wKkD3vWju+PtQ4vnJSUz6VFDK+wT8bPlEmFj5zpUQ+UcYZPi6+LT6gLh4+iEQwvmDMqz1Du5Y9yDoQvBx8xr3pwYW8oGSquFIMhz3Udz4+E4K3vYjAxjyNTA2+D70hPqg6Wj6eTzi+YQTLvAKpqb1eaz2+c6FSPgiIET77mVo9Lfy7PYv3VD4khoK+I4IzPurMqb3EytI9XbHqvM93bj1ppbo96JumPFi92Ly3Xe08Ii1rvb3ISb4OzNg8/nFou0UWYzzqtWm81hcEPuvfKb2Zc0E7yS+yPD8Wkz1OIAo+ZbLLPTwnwb0nBhK+zN0pPuiagz2UK7A9Y1fqPPULIT1uKsE87BabvO189D1q8jg7xKiHvXoEn7zVkry63AP7PeH39L0COe69DXk+vmOVwj3xHT29K8Z0O8ME+L07yaK9czyDvW6Cob1bSx2+V8W6Pe+5BL40Qxc+RA33vYrA9zxPkgE+eTIZPlVZCD3dxjq+ONLlvdO0rDxgkQ8+ua6gPdviRr1t98C996BSPXvw+LzavQ++okdOPNaiND2D5Wy9RW6QvNhqCz5Q59e9nXEOvdQF3bslD5I9JM/bPaIAWj0EhjK+ogFePOdhKr6yYKS9UVvUvPP/IL7LNxY9ZAz6vQgjLz2rjzs6X2EPPgjIH7whk7m9Ii+ePUopgb2lRx68IzMgvlwC+r3a41S+RAvZPYetZb0neQ49WLVOvKXAgL06Phu+4fVzPQYo/D2N7ja9POSRPW/hJz4GCK28XhW/PfokiL0ZcUK9bA6TPN3cEb1qBqs9A1M3vqImNLtNQec9+/0+vBKZmL01isA93bHlvSBjAz4YhwA+D/nUvZQb472aMoC9CjkIPsYCJbxvQQY+PvwMvsZjq7zjasa9pKikvmsJaT3Ob5+9LEBzvW+QRL1uKQw+PM4CPsK9kbs41is+yiUqPcS3B75CIqu9JLXOPeVd472V6b09VVMiPfvUGj2RFBu+Ks+FvH/EgL7r7b29xRlQPO0uET716bu96PRcvjG0gz0MS9W9+bwDPXjYEz4t46E+5kLyPYFlozzw08C99t5EvsamST57wm89m/FHPewvST4Fyc29QghMPsPp5j0ymlo6ByC3vkjTIz5AXJI+YbmVPkR+CT7vUtY9dJOePQhZMz6qrru9us1EPjvgiT2TCTC+n82ovYLOMb7HReA9QBWjvV6gBL0E8qY981QwPgOJ0z179Iy8e70VPkESi72UpgU+FLb9Pas1TL5Yzvc9R8R3Pt4X0zyev9y9Pe48Pkuu/T2o6+89ebevPFLzTj5kJMS8QkUKPlrv3TyzcB8+/g62vZa0Qb6Sh9e9IJC0PokhOr2wva89zPNBu8EAtD2xmKa9m3xwvamhSL6nV649S/c7Prlq6jqxFS8+xJ+7PCSz2D0p56A9938/vstfjrxqBYC9IsCGvl4dwD01z7m8E95jvROWOz5l7oo9AZtsvXxppT2riE2+B9ZyPOX82zrXzvs9rB2tPayqGD7LaAi+65oZu4EMw70Hyoa9LzgePoN12T38U/29cLgovGpIQD2n5Qc+tcdgvq8PoD3Mw629ds56PoE4Tb6SeI48APaIPTnqV76+wv09cE2GPnI1yjxlOpo8GhBSvSaGEz7swB++DEegO7S0Fz1EAgY9FCptPUPkqDxbuD2+ESS/PdIeGL21Nw4+92kGvY/9L73iyjc+wRnovVYufL0egVc+YFHwu/e8S75lecy9KyZ8PeD6xr0RZRm+OAYHvsha2TwhM0++GzaKPCx3u7zaiDK+AyrGu77sUTxY+hm+hf5FvenGxbxZytO9fXmCvTlmdDzXm/m89otgPvhvnz3omzW9g9FLvgk7WL4Hwji+eYSsvV2R5j2avZu9iSIqPiRfJb78VnU94+0jvSt6oj2JQT0+RJHDusL4jr6U/7091pBfvc5Rr717IF290/GbPb+63TwveLQ8iTkivhtMkLw5ZLu9LBtiO9e20r2NywS9EREqvjqMyb0GKus886AqvG3cOb4L+0W9X1UpPhqHzL0915i96fUtPdfxY74O3UE+hHo4vkyuKT5a1Jq9i2kDvsrKLz67yVq9U+0Uvfe0+D14PE69mBEEvjAZbz3Gtio+bk2bPajo1z2zK/48t7lwPXLOBz4CkKm9McWSPZpbAT7/9Ce9eJgZvi4kQD5csi++GtwCvs4RJb6R+jy+Q3XQPdzLNj7Zqus9eZFCvc500T3ob6q9Y7+PvTNogbz5Wlw+lXbuPSJpCrs6Ybg9kONYPWHSc70PdwK+AnvmuxjjIL32eQs+dR6DvSN/1btrlXs9zWHcPUeT7z2IFQY9xw8Cvqh/OD4P5Ra+wbQAvlv2qr2yUaw9yqIXOmK2SL50dsu9lT4LvvmT8jwm+e68VqOkPMAdOL6zFvU9zhO6PQZEXjyxvM29fD2jvfqeOL5wkQM9s+Ufvt9X9DwtXXq8AWElPX9unT3+8r48inzWPeiGAz3Na4u9q/uJPeF5Iz7FLOk9DL/MvW8+ibyXCWe8/eIZvpYcIb2uhxq+G4QZPUhYcT1gpM47kzpaPX9AG74+b7y8K0egvAFoBr2wzVg9EJYHPrsbG77UmYG9E7fgvWUjGb7c8ck9pY3EvMMdCb04AlI+IMIkvmvJ171R6u28TVxIvZqj170L8z2+dKPMPaBYlL0LM969ANoSviTK3T2NBjo+TV7MPFQqIL7oPwa+O8S+vW0EkD1Q55s9LD2HPTg5+73dWcQ9IXMivpjQAb2fDr+9jnSkvdrLAT4k8cE9aSUCvmEOZby5ZnM9OAh+PewuDT3vJR69RFykPVcyEb5gbMM97BESvfwzoD13vIk9aOJvPbhrkj0RTYM9Lf20vEmjnz2LX5a8Qi9YvSCPW73eMAa+/2YSvbFy070Hlh+8A+8xPW3AzD0JK427e7AAPmKjB77PxwW9ddYTvKKbKL4q3h+9GZYaO9Np371j7Js9hyBHPBI9nD2jxeW9fd0SvmCyQj3z0cS9LzjFPaYMOL6j3RC+KBcOPj5lj77dY3I+CfFLvWs8Ez6oQsu8wiE7vWU6Vr7NnKE9JvFeO48fjLz2MI++soTcvafYaz19e3A9gqYvvpTU8TyC2MC7kXUBvhGWiz35wR09sjRPvtAenb43ImW+cJ+3vcFEMT6nOfi9K3JrvrwVUb2dVzw8pdMDvvhtAz52elW+Ut5UvRpCrD1cGD6+9SwOvo8jFT1D52S+F/ehvJ86az2enxE++NBpvdXesz1rVkC+VkPwvXpVjjrbFJw9A2nxPdTeg77aEXa+ERosPlxnQr6yd7g9K2WfvW0fWj5jagu+y/8ZvuI8XL48Yjc+N+1fvovIZD02EqG9j1Xxu6ig4r3Wjxy7d+bOPRDTcr4nNk++6XYovZsLHD6Cn7g8izyDveHJxD0ZMrG+to5tvegI3TzBcNC9A537vW6cGj6Terc9LVWGvd4L9r05PzC+nRsNPk/vEb3XlKi9kcvlvXUulL7/yWI9gDuyOMkCEL7JgpS9zwxivjSKnj1fJy2+P17QvIcKNr6f2La+aVwevRgacrzpVoa++iIPvmtoWb3Wuoi+QxMSvYjYmr21euS928bKPZDUwDx2GRI9i3C6PLz55r1d8aA9cOJhPQYdTr7lJAi97FkAPtW3aD4Qc9W88g3yvLGb5bysq++9muHSvV76JD7C8OY9pgApvtIBuT0QSI29y0h/vn0zLz7Y/5K+DMEevsxQxj1ERhG9k/6FvIU8+T3bRxW+Qltgvkn7yL1dRA++CEU7PU0ATj7c6mk+7gObvr7JtT2Ga0i+WREkvnn0WT41eiK8IlyTvc1DQj6K+zi+SxFmPl6vWj7YVMY8VfFJvg1Bnr0lRZM8r5GEvYnNm72xGyu+KOOkPUY8err0002+QSatvWUMEL782TA+8Z8GPc6ONb58Kgy+Dq8FPdCYir25ojG9p+7VPRNEE75L2R4+tJMUvuNHGr1+vyO9IIAXPTzPibtvWMO9pDIHPcT58bu6X9Q9ejscPd4L/7v08L69zTMPPn7EVz1EqS0+ETz1PZm4nT3dNx49KecNPh3YGL1y0FW+4O5MPhIK1T2kcmU+V4o3vt+Har6Ddvk9159nPNkyfLwzyQ88pyUqPYfGpb02KMa9xYUQPkUlg704D7y9Bpsbvrl3cD17fEw8u8QBvpzHlj3CpiI8+OUyPlGKHj4714U9NuUkvnBEbD7YF5C+gypbvhdyIb4ksR47dAWJvV5fiL7epfM9w8MsvmBz8D2Qyj++KhqBvrIkN75MrDQ9xxkqPkuz7714w009sMcxvt5quD26Zg6+Ok5NvvaByj1j1uu9oTgjvno6Ur5D7AO+AcYfvUN1rj0fhyG+R1KQPJIvPz0QKio+7FSdvU8BvjxNttW9fTqRPHDIxz1602i9qckGPAGNMr7dzfs90fwFvWkLdD3NNGA9UoyDvS1hMr7hERs+gVYKvpEy3zy60CM+rYPevQrvjrwcksa9s9u8PfCBAD179kK+1/wFvemU/DvXiu49MR/hvNOvjL020ye+C8VDvkxQojweqLm8UQlyvcR1mDwoS2A9rwYmPSRGGb5TXri9ScLaPbvx8Lzx8gm+6MX9vPUqv71nEje6pTOHvWWsor1w7+I83GnbO6hvbz1/7zC+q/AOvttIhTx1NQy+z4kMPaZXs71GjPu92AUjPG3IBz5gW+S46CfhvQp9B74QaUa+deAnPYiBBr4QLKG9TWsXvvmbvbxPvw8+FfIevdeCfDxUiBq+iNCrvHXZ7bwhcjW+TKTbPWn0PjoXTFw9H1tJvroI/j13Qdk7MKtDvr4RAj4xJgA8TEpAuyxCxT0EZgu+P7ymvXTk0T3pCD2+tvv7PCdl1D38cBU+/ksDPkVTvrwDb489ar8DvmTF/r15H/G9oTWePd85wz2Sg1O9JKMavrFWLDxnUtA97z4/vYEhkL1jWxA+Ds74vcWe+LztFrk9t3fVvS4TXL7Rh8c8gIWrPQUqj75pfIs8KDx0vX5lbjypIBe8hD8QPdZPiT73Ntg9pVdhvixJCj7/MIu+NbcsvmOeU72jxzY+4v56vt6S6b2yGUw+8+LkvVHoIz4kDz0+vg46PYrjNb2+ePi9YKi2vaz7tb0tvke9EIm9vLv3+b1E8T6+SULKu2T3Lj6nayg914sEOsN6Sj6GRku9B6HoPf+afr7qiTw+RASwvDu9fb3UhBM+Vh1gPPwUvTy+V5I9F9gQvApLLT5sRfi9RaKZvN4v2j23O2e9NdbhPfcrQz4DQjw+SY1wPTwWZj6HVTw+i+aLvSviCj5SSq49S0Quvuz1qr3b60S+bAa8PUkEhL5c43++VoXiPHHHf71WmSK93+5lvvspzTxw2we+m384vkCwnD1pYje9iFkSvp18EL4z1ve91lBmPD1pa70sRhq9GY2gPTBvkbyNTes8Oo/DvRP5ID6FcWI9Uq8pvRhtyT0I1Py6mXqEvshHLD6TqPQ9pWsOvrOOZTzEcAA+OyrrPQxFTL1D7D4+BfgUvd6yUD7/IiM+W7SJPkbrf77rbxo+CfubvaheSb6zrgy+WI8TvqsGA74GWDI+1qHWPGZIhb1PEI6+98ByPWcNhL5+Rgq+RD/GOyRGkr6tzTu+ebk3PhMD0D164YY9oGmSPfbOhL4zN769cuNaPZKSI70W6CI+CbShPKEQkj7jxLM9ZchiPcJ4yD25n1A7oEFgPhPGgz6IptO8WuhtPim/BL6fCC6+/4AqPhYbpD1h9UC+hLZQPiQGJr5EZHC7SF5/Ph/A071BNLS9gfM1Pra3JT35gAA+TqC6Pa/wST3xgHg+xAO7PU4+gz6UEz8+xk+UvVVpLD2T10G9ZhY5vghbub11h1Q+/UsMPludUT5mjYS9hPAjPto9Gz6tcba8+vM9vkeFeb08l8a973xLvo1Zxz3Tr+m9wZlXvSPtgD0AIvg8qWirvTXEUD7WWRW+HWsOPpLhwr0PUZg9qKu9veq9Dz4FAsA8ZF5uPTxF0L1xThy+w8xLvuBAxb0Oeq49QfSGPTf0N75T+wO+s5H/PchBDT4My0Q+u9hRPS6TzD0sgU+9s9EoPUuuCD4osHE+ZJpavWCp27xdrxm9N4PcPMHGhj6NCRW+6us0PmxgE75xQHs+I1XhvZ4x1zxebOU91tzcPJqmvTzABti4VIkIPX4KPr6rLk8+Qa7SPIHtEr21Ng6+qc03PuSVozv19fk9KsyKvbti9DxeCFG9/LzBvXUFDr4LHse9Jlwyvhqz/j3axz6+4R0LvqriXr5iMCc+zjCOPIDOgb7hmRa+O7O4vcfNCr5v+v2917GTPboexj2DNye+8rgkPi8Blj1aNK68AOhGPr8d4D1fmOY9a40Fvvxl0T3LkoQ8Dx2Ovc/THr5HiCE+sPCaPe79Uj2btwK+Xo5iPUB2h716QAe+AIkIvn2Gtz1oh1a9NQz3PLqu1rwaKpo9FIP4ve0W/b2EofQ9X4hiPn54kDvlGM69SME2PmDGxb0HRpY9zPQBvuQveL39qh8+6iA5vR19Fb1R/jU9F5eovVfxwj23OYs9beQjPIsnGr43ikU9y2QSPNZdyD1XWhU9pihKPdyuI75gNV89CQMkvkBenTxD7tg85v0DvkbYQj63PqU9tHwZvopLBb20f2Q9B0UmvtSYLb7MVQW++2fPvaHf0L3Gwye934uSvcyGvL0BK5A9H4sKPSb4Gb4wdKG8S9NNvemgrD39ylg+oYuzPH9DSz1rXC48KoxpPuq+8L2hAgk+jTY6vSm8ob3OQgy+yuoGvl1Xgz1xVy8+STE8PuExwD34UB4+rjw9Pv91DT7Il/69WD+KvcyjHz0foJs99ZsfPPKf8b0Xrdk9REYHPn56YL13asy9QLDNPMbmXD0Vz5496hWyvdim1zsuARy8qIdWPpAzwz2PnhK9C73GPSU7CT7/Nyg+2KMTPt8Znj36eie+p6oHPkh8mTzmHfc9mD/dPdoQBT5GkgG+eDb/vYhde72VaxG+AnTbPWUDPbwtFIQ8GqoRvqQvcr0tyQm+gk2IO70oLT5+Le296LXBPZebhrucoZ497kwIvsSonT3G4Xo9lD83vmz1A71nq7I9/0gZvoo8sL3Sp3q8KQTovbLlHb6EJf492pNxPS2FFDzIcaU8rxjDOyjs1rzMiDO+HdZtveVRVDx95EU++9xWvQd4KT4ssrW5DDPAvZiebz3x5EO95nDQvaP7b71iB689tmskvqKi8L0ICpI9Ga7OvXe23jw8gII9td49O3TEG75hVUo97OM/PTm8Mb4NZPA9N5KGPLamrr07E0q+Ob4uPjECRL3fPEg+tGBbvjhfbz7qpJc9M5f5PYgQRj2xG9u8iGLKOs0KAz56zgu+CZVrPYuo8b2p4gC+rjkHPmktIL6x4VW9pL/LPblvmT1odDM+wAsKPe6Ifz6vmh4+b3gcPmv9sj219ga9mi2pvB0XlT3/ouC9QK0svkknhr5zdFC+wSEUPlgLML6c6OM8QImCvsqDOD7WxjG9A1m3u1EFPT5CH/A83y7jvaRsxb3hlCc7FDYVu4uKF70zGrU8Ez0lO3/yiL20BhK9MiQHPiWiQz5xfeu8R4b+Pe+FrD79Gn0+H0g5vgOrRzxhnTA9Yk8yvt83mb1AL9A9ZrTFPPs43b3AIYU9BxdBvrhRrryjWjk+2LMvvirfuL1byZK9NndxvehcT72liiW9NoMbPo0jI767HDo+AZW8PZbanzs2+cu980ZPPtFwHT4Mky0+MzGQvKajYz7LcSM9pwMqPjvFgDzYuA2+7zidvfV9Rr4KrFO+JOB1vcJOIj73GC2+2eUIPct5ej4zEoS++14CPoxJe73So5O827IavvQnIb5uCYQ96bKtvSc52b2mcJS9yfSVvoAS1j3uPVK+tc51vn2URD0Kbhs+Z0CYPUT4Hr4Ylm09BbX/PSuSTT4ke1a74I3jufL4Vb50CwO+IyBNPjmtsT0zXB++AC02PDxFzT3+0Qo+2RErPoXtxj3cMU+9JeToPAughz6Ei6E9MyYVPbx3gL0sjhc+JUXYPUdDbLyzUgS+3E0xvZkDkL65NMo9t/4zPl5O0j0QkE6+c9YHvqiKCr6tWFg+iTOZveldCr0HzOG8/s33u0U2Pj5eGnG9DxsGvaydTTmD58y9INKVvRHj6L0Cuxo+D+hYPlTGHD582Jw9Ky3gvWIL5L0iSzY9InDJPYUm2D15rne+GrbNPYM24DzPxqG9n60cPsE46Tzx5w8+i2hHvQSs9L11hUC9IpdTvjNOQj4P3kw9PUlUvbTvyD1QTB+9Ff4OPMosij68QJ+9I3aLvRjWK74A9bk8mzFpPW0GEz5ZSv29voE5vrA6DT4Rw2S88QdEvkVhDb7BS7E9F45OvuYvs71PbU4+18ocvlSjHD0EUZW9j7uSvbM/CD1pMeI8lOqxvG3itT2Yd6G9pJ+4PabgMb5bIg4+GTSROwJeUrxfX4U9YUg8PmVXtr2RsxE+xYQqPmcnAT0Z0789KLy0vcsk9z3a4hK+YmPePSln7r12ydY9hwoHvtOuzj2/efG8pXWUPPrXob2PF929AzR0vjCQpj2fH5c9BngnvvGkUD3usii9PeDCPXe4irtbPfW9b8FIvdlzMz7G84k9pjS8vEVebD1xl9G9noP6PISAKT4/qwM8emElu0HopD2njlS+tNsEvnnlU72Qlze9Bp+Avccjj71ffiS+QtoIPnJ/xD1zGri8AGTxPLKWMb72cRW+4oSOPa4itr0Vs0u+hIq0PCyBkzvguTg++36Zva97U760+9w9GrgpPhRyOr1ROZg9S3wRvhNiEr5Y1bq925E7PuTsHL6xZNm9DTuQvW1QWD1FAF49ktCNPQ4fJD6UmQM+piOYvSXb+Dw6RDC+CSnZvagVQr6pJCW+tG7AvXoa/L34I7u9i5FPPX/HMD2gBUe9iG2vvCF8pz1gDQu+TtA3ulbNj7wJ+gG+gzS4PK+I4jxsZO+9JJsbvvx7mD3IIxw+RxCxvTTF+rzW2P68FV7svVAkCD4OoHY989PCvQk+ib3/fEC+jq4ivc0ARjwPJ3y9j9faPYqZuT05Pta93b+VvEICnDzXkGs9VtIvvvb86z2BF0m+jrldPa/Hpj4hd3W9UF1+vvbABz6bSIM9BpfPvc3mET4BUJ294+owvmNX2L1LXLc9k2kVvhxdhD5HgUs+xMuMPTpUFT6adsm9uQegvRxyMr4lSF09Y7LsPVOx+r13Jbs9ozuLPE3+cr3Udd89in+Cvq08UL06jtq8/EaJPfm7eL5/q6c814TMPdUFFz7s22s9Pe3FvXNkAr532/+8Gmu8vWx0bDzKtxa+fwA2vbHSNL3gana+Wq+pvW1EDr5jLzU92yybvL2E9DzGD5M9djYQPWmVlT18rgE+qVelPHlZLr16mQ6+Foc6PsVg673P7iu9iYJNPlCoBj1fm/c85J2LPdD18j0GfJQ8U/cMvgvT9r1RAXg7OZFkvUMlhDz3EYI9F5b0PYBri7xcXRW8Ge+5vQppmb4HrOy9Ohu7vfUz7j1e3P09ApUhPVqTE76oGDE+q1bpPSHcKj5q0Ak9a9t4viZPUbxJlD49CE0EvspAwry6k7E96GSsPRSZAz043LQ7fe8dPpwDHT0SIyi9tWFIPdYXcb6IvxK+f9QOvqqvOr5l4SA9pF4CPgpiOL4jkKW+qNxFPtnMh77KA609xHUIPZBPKb5Pc7q9MXI5PbZuFr4DRUu+YCGWvY2xjL7A7gE+v4wgPmGff77+Lru8YwUVvQTeNT2za4E7a7F2Pnw5wr0+bkA8pCqFPgERYD6c5WC+AvSZvJL0Hj4tLAi+pVMrvtuK4b34ACU+zbY+vdVAujwLJGa+yGTYOJeNPr7MYne942jgPcsOMz1T+UM+FSsgvdJAP75Y1Vk+EO8YPnkBED5vaaM+u5+BvvHRBDwyT4++ag2OvaIKJL3/sgQ++q4ZPKVdNT4Xbxa+tllIPcvgqzwFNKa+0KAWPZ4EALyL6Re+az22PWm2ED5+k1a9rEAkPqFmfb6OCVQ9A9bEPUxV6D0/ppe8rEQrPixWGr7SDqg+xTUjvrzaGT756m89IozYvar4Oz5/hQ6+nztMPvdgVb4lBL68H9raPBb9A768pXS9VeamvUZTpb3fOus9hcEgPlM7ZL6wmYK+/EgcvpMnCD1kPmY+UjlrPL4k1z0R7yK+PGusPnNkfz4pKBG+/SOpPoUBxLziS4e6sWD8PXAe/DzzKtI9K0uBvEKDwr1zQjy+0uniPQ0Ag77HfSs8vl6vPUsGfL3HD9I9c57SPdSHTT6I6Wy+JSwEPlXiw73CRR++Fi4VPuBZmzyvb+w9Ca2ZPeSs0bwgwQa+FrkpPQZ3sL3qCpm8mc0zvjUkQ71NXYa8gNp7PULjET1YMtS9+hQCvp3BlTzE2WW+tmxNPtAwNj5TWZc9r+MMPpyfib0u9YM9uWVkvXmlGL72ehk8qKUAvgMJUj24Y8W86bztvScGDL0X5Ja9Avq3PKOgPj1yVdu8tV4ePlUQbb6KXYm9AwHgPS5JXb1PbY693pksPRJb+zxBciU92i+EvmcwyL0nhkc90VrjumNwrT0I0zi+RF95uzHBBL0oWAi5NvDoPYtLs70JVA++2hwfvr90n7xMyJ09jHUlvD+vgD0mLFS+kQsNvnC3nb16Wuc9yCQ8va4uTzzbn6E9j99ZOh+w/D16K/49VBGAvRJ5Fr4EJmu8ATiwvVlVxD0u9y2+8GgRvlJTlj1WgU28xPIcvhlQcT1Y1IS8del3PXbTTT1GvOg9fgrEusIMNj6uAe891nvOPI90Q763gTw+ua0qvZuIdT3HVC++TWPGPfmF2L1jNv09Lf3AvQ3zsjwELlS9wZgnO6Wn3r2H6ha+iZoaPsiBJb30Oj+++Iy5PT2UtzzB8hk8YVNQvj8Ryjxi7hq+9m5zvOOkgD1YgaQ9ZRM3PRAOqr0b+BS+o+gaPRpSL74Vrhy+dcKXveHpgjvfJSY89TCqPYZ9Ez6/jaK99p5MOrL+ij0A+Nc6hItyvSwMkz0q0ku9Tc53vfWAUb2Bgwg+rFMiuUanED2J5UG+6LgcvEN/vL0gRAS9GRwnPgn93z2ajxE9xgACPaLEK75mzJi8YH0oPsXPLz1DGEg+HnkAPrT/gru5uaQ9WRq2vUsUn71MAYA91uovPsQSmjvniya+WSGWPXulqj25tiM+Q2tEvjJ7M72/zbS9RE0hvtqDDj76pXI+Wc0BPdt9nj7SP5K962GYvUzznLtOWhU+2dxJPrfATb6yCii+ufKFvKr1rDs6L08+On/fvYRbvD0AjKi9f4SSPeK22r1Iep4+dd3ePUBDcD468GI9xh0BPnYJfb3+LtO9428HPngxWj5mlFq98ZA/PTdcg75/9TG9/ROHva16l73R4FQ+0NB4PqAXRzztaTw+EGmgvZ/FDD4Mw2s+yGBVvi0TQz4Dsz2+41MuvvMIv73uCdq9bwXyPdTkFz7DliW+GLusvRxbEz4+i9c7tSThO2BBlT2b9308YSY3vv4djr463h0+/vIpPpJ0/j04Z1S94qs6Ps4PmzxVlcC9Prkbvh7FEz7A1Hu9NJFBPSY11L1Z8dc9cDalvq/BBT6sfJg9w9FWPp9Atb1jX5E+bQCQPnwtb7zSbIc9T+HivLH0Oj08sbC7lScBPjMjG763tEo9CiJHPvvOGb6/nfS8a008PgMRkb41lL+9a2Q6vVfIkz0TwMA8G9oAvLIcZD2hev69PZfdPe3Qsz1ojmI9D8l3PqeplzsuNvG9YDkgPmuhAL4nzdm90ZcxPRQWG770j3s+GNTwPRJHaD52F289Fo28vIN/6r3F3/I7o0pcvIO6bT3KHpC9K1HivaoIN72QjSO+YBk7Poif/b3DzDO9rPMIPgVVUb4sC/m9qbERPNfAar4lQmy8zmkfPqM13j2fDQo+0oXQvDIFYT4JP3s9bhlWvHmJJb2BqF49jWdiPa9blbxTGka+xi0LPg8lIT4aqlg+lczJvakhbT7wFpC9ya5FO9Bkcb0+aY2+X5hdPHolGzzAoa097gqJvkD1Mz7oBmO9zngiPujeA774EAA+yY2jves8cb6I93W9OJAYvl7W3L0jjGw+jE5ivaORED5Lh9q9Xv3sPMYC0bzsV828+43gPZCBlTuMNqE8Sqq2vQcOIT4KGLw9NBMPvkakejyJ/4q7SvcwPZOKvzzZ3J8984tbvUdcDT4DGm88Ig4rPZuAGD2YTKA9qFidPeM2kL1IxTY+Frx7PkDEPL1QqnA+smwIPrABHL4t5ho+N4c/O5PMtT1H4IO9jISlPObMvT3QJRA+lv8HPu9/9Dz7y0U+TXAiPbnVYD49yB8+cEnlPMACM77yI9W9NudAPQxsIj2ahQM+0za1PfDzzr3EDCK+vxtiPVRegz3+L1a9gBkCvnhYELxvukm9PxItPkZ6FD41zys+ZHAhPtLYq718Fnm+hBM0PhZLZb2i6+w9F6RGPdnXkD2KOaY9XzMZPut57D1+DQw9aaIBPvlTFr1FBdk9cAUJvku+3Lx4gxc+pqN6PaUoUD3jusa8Q3zMvERo1bmPBJ89ZbFjvnDh6D1CJ9q9h1SAPVXkG71L6oG9LdArvkRtlz2UE489bakqvb0k8T00MHQ962ndPXByC74Vdw2+6DAYvh+bML0nKIW9wt4VvoIlHL4a3iY92I8zPSCODDzLdcg8A4OOPf082r0x77k7uQW2PXXk0706jmc9Qcgkvn+4Eb6jsCK9aMvwvVhS6j1/AQw+Y4AlPc9xPL23mj8+Ph5lPcSJ6r1x4xA8Vw5GPHbOQL0gahy+T/rOPa5YRr68nVS+k5sOvZkaSz1ASPu8XG8KvZ8I2T3Epxg+A/7sPS0CYzyS6mm9r1/WPQJmxrz2T1K9Mg/zPUeQGzlb5YM9C5/qvUCJhj3YcKs9RtQePkS56T0xsio7PfXSPTxNuL01L/a9v2sgPW5M3LyyZVQ9SLYTvhRc1b2+De49bhN5vUPy9z3vBBO+3YQavuy0vbzRI6W9YoofPjJN9L2PzHE9Mc23PXHqGzw86gG+YRP5PU3x6r30/FY92XenvXtXCL7vdwq+e6vCvf46Zr1vbfW9y1MCPeiWWz2QWSm+uIfuvcmvCL6YmjK98EroPcTJVL7w2lQ94owpvs4KBj0wtXY9uDJPPtjagb0I0hE+DukFPm6Yzj3EguM9rtDmObcr1z1lISu+s/KaPW+mTz6ayYE9A/lUvc8M0ruOKdW8VwuxvesQHz4wQ6g9SztQvkXkFr238UW+Z5buPFXqJD5XgT6+OtIqvZtUHb6EfRG9Z40oPu/fOr5MHiG+rV55PSR6Vb4gIyI+Znr1PdKNCT7TZpE9LrsmvWzFN73NrEo+WVmIvGpkEj7hmgs+DBlWvmqcdz2/zmm+jqcXvjPWlrwGpR48hw0NvQ41Pzwn83k9r2OGvtrGnzz3wkI+R+Y+voB0HL36t4u7PjOAvvRlEj5yXO28MJCWPRKXn718trm7/eojvtQ4Qb4BSXU9jY3wveYgAT4cuAS+SDUHvmdYkj2wcFg914gvvlemF763/0M+dUqCvX7tJL7N+Mc9UiXZPQouer0YcQq+lG5CvNufUb6xcJ29fGvOOw99Hz6UPHq9xs7RvOSzHb1GY/I9MJifPfmtTL7RIIa9plWuvQkcxj2RhhY+2+CgPN3Tnr2YdkS6x8qXPVhABjws2g4+FD9RPh+ec75ob5w8hS33veoosT3dLS2+GFy0O3km+TtAOC09RHAiPidtFz7tKxC+SOJyPdHQIT7+G1S+ymhKPLvoRr4vTY2+KvY+PgdZbjzoO8G8bH0QPooSNb1S55s8sdEFPpYiib6/UaY6xG0yPqw7Hbp5viU+12htPmr2Z71sM/68y8iHPmLRDz7V/Jy+I0m8vQbsDLxrnAS8gePHvSv/IL5QMBc+50mVvVxfL76g7kI9566EPpavcL6qJvE9TtoGPslaXj2hqC8+CGusvBOShT036As+7lM0Pk8vQT6qHeI9djauPMAjrz1U0ne94rlRvilqgj0eiVY+d4gdPma5hb2Mbs89gOwSvYDWKz53xJC+AkNHvprsjT4IlTQ9rRqQvkRdtD0v2Re+rbUtPlLXdL5HzBm+Cm66u/+t9r0GLCi9rguYPQUnZ74EqzM+KEQbPmcPFr6e+1c+tPtivbZ3Art12IY+4JNRPhrpJb6BWKU+WuB/PQn2SD6T8xk8DeqOvWjVpj3MfxM+9FGxvDsbJDxLPpm+IH9nPlTMEz5jVTw+ordSvuchKT0moKG+MpSUPZareD5yuZc92bmkPvAmjbgY4ZW9in0mPMjx/jzsKKG9m3DLvQQ7nT1VRze+vfDFOz1P3L0iVoy9f3U+vg8PZT7R0cW9RSxMPIM2Cz7v706+KqCIvpfuT7uBVRq+X3VVvqVuwjzMucQ9BvP9PVcWLL6Okyq+X7OuvHKRIb5cnII9ltdhvhiT9r1uU5G+l7SFPsEOF7znvUu+rzcvvhJfNL0xhNc7pIVOPfiKsj2Jm0m81wIOPvNhi73cg/I98dzKPa8qOL1IMaK9f/PPvUhI2z07G0G9AYpSPZ+V6L2kvEm9KSR/PaBU5jzIJv29SCYYvk2dcL6sHs29RRvpvJ2oGLyR1AW+1Dm6vbuItj0vV0C+stbUvdnMC76KTDe+qE6zPdeFF7621sE7UQQQPJl36L2fDTI+ORLHPRX4hLukAGE9G8+DvX6Dkz2cjio89DTNvKmfIL30jJU9L0V2PPkEVr0NPq69X6ovvfAyS74U7YU70CEXvuJhAb5bZxe89JSZPUfN8T1CdKQ9ECv8ParzFz31Eci843ujvNezx72b4dw9g/xJvlTokb0HR/e9DwG/vfUmDr4V7M49mScOPSncKD0IfcW8pD6BOwfBE71NPKi9r0lgPaO2ZD2gwGO9ETwhPithurxSkBc9hteoO2vEAb5TkQc9QkCnvcSl2L3Jcnm8iIz4PfKbqD08+um93EaFPT9S7LxYNrU9Imcjvvk4Az71M+u9OPtkvrHQEL7OSxW9Nb6jvR1/d7zKQyW+xVpWvtl5qrwVA6k9eheuPbzjyD3Iyxm857CcPWTQAz4J1re9YsrMvNEv4z0XIBq+nwacvfD2Jb5ZbQI9s/LwPSYcAjsIjc29QhTVOiZc0T1p5529GRczvczRJL2whLU83rIfvkDwkz2oYzO+4b9vvmb3Wj32A+U9K/VhPuzuwj1DgAg76aqGPBNk+T1Xkle9h6SFPYsHZj0Agac94S9AvhXxjr26oQC+1jl5vCZD/jynsy89O38GPp+0MD4SFSW+P84mvhhNvrp6cAm8jYJaPqoOHz52nLI7xlr6PU59WLzAdi4+mdbwPbfoF77FIwC7PSt3PgtCCb6+oAI+zmbcvZj1wj3rFLs9h+ccvkmrc71z9bw9EmWevWLHWz73Bt48nBIkvoBp4D3IiUC+MEZ1vadWkz06OFO9Maz4PD8p4718JOo8kZrNvRxWp70UA0k9xhnoPcWmFr7wnxy9IEe6PeS1YD5InIM+ZrqtPTPI/z0ONsw8R/KjPUoDlr14mBa+c/fPvf1G+ju8uA++dN4CvQmUiLyqXDE9FxBcvmziKL6ABvC8qD8/vcKfFb0OEsc6pediPZVgnDxTaZS97LspPnM4ur3Trty9TSEdvqbMHb3/vAY+8M3mvbmLfb1mJgE+89lNPX74Pz4A4S49+fUePj6NKr6V78c9nm8YvbxwSzz0hiw+cTn+Pa5Sjr0UkiI+M65ePSsWELx3XQa+4IKSPR1IPL4lzVs91LwvPv4kXTx/cqE9/buOvPADGz03McG9GOrNOyqqq7siosY9je41Psj6MT0UTOc8G+sUPeSFB70fGKo8asknPillfr2e/Ec9JSM7PnoxkL1ABao9cPDFO+Oyhz67viE+GSivPN8iIz7a7TK+o719vSVurD0PSkO9V54oPcXkSr4T+Ao+sYe9vFMioD2c3HS96JbIPVID/71qF9I9RtwgPpadNj5zw/A9Ff4vPgPYCL7K1Cs9chElPrBw0j2yJt09pqk+vkBMor3dw0w+MxnyvZXTcT62qFO9nebxPLJJTr0S9A0+ojQqvlVqGj4F9hK8vmsfvoYelD17cDO9jj20vGBO9T3Qumg+oJ0YvqM7CL1w1Ju85jG7PIbD9TyDXkS+qLS6vVIQCT6FG5C9yOV2PrkopbxRk2U+mlevPfrSwD1SoVK9Qvz4vWwOCDx9Uhq+TxfSPV7+0z1tj10+PVcBvkrMujxAsLQ9jlC+vYADET0LkAW+B1+0PTRPtTset+a8Aqq4veqypzycmOC9PKNdPdD36bxERay9kcF4Pg084D3Eds48M8WCugBNhb1tCx0++S4OvIlSGz58CVy+vXYFvQvkOb0q8047WsEyPpemgj0aeGY+bIjVPFNiBz6rWgk+y4ZVveAR2TyOlDu94FitPawCDr79sjo+eKwwPRimLj2cYgE+h7bdvQaOtz3r6I66DMS/vSLQMT5Lm/s9M++qvaFDIL38xQG9a4f8vRsEqD27CLM9vlfLvUfKiD3YMJU8OEKHPvD/0TwcVtY9SrXDPbRQzrzh8ia9FhxYvbCloL3bq7C9aoGkPa5Mtz0tUuY9TQEAvr0unj03YWy9QcwHutbDBr6PKN+9on6LPOAuor3mb5U5xya2Pcz5+z2j4fg9VvR9vWJAyb3e4oi9tpHKvbZkMD5Ft8k9BNDEvf7fwL0Wagu+qgywPSR/sj1IbMA8Tw8VPNBCvzspEfE99mo8vrFj8jwDMpy93Kk/Pn1O1D09E8e9um5sPYRS/TzXXNy9ah3yPZNPvL1xwEO9NUuHvSXhprxfKUu9jEIxvnhZlT2n0ok7k/g0Pm5tczrrBSO9HmGCvdvvEb7yow++0VGsPQZ5BT0OdZu9CoqUvI3Pnb2xq5q9ayZtvfseMz6ng/a9YbbAPPlAHz3Ds6o9xVcYvl7Fxz2HY3U94RlQPmyt7z2idxQ+KAGhPNBjXr1nvis9DB2VPegwl7xtHn4+WpQWvv/5Cz6K1+E8SM/AvdvOzLwJYN+9visLvv/MGr08egu9WB7yPOPPWL2RFpi8a3kKvuIJRj1BFBk+8+VhPSvZQT5Yv1Q9+iyDPfZkWb0IVB6+OvUjvgIVB72ff8c88L3LvTSLjr3lPDw8XMNaPXDK1L2Amb69DMYAPv7bl70+dec8RSIdveUADr523e49l9/oPWcrhT1eaw89zwr3vSMeLDwdsgW+O9iiPZtcCr2IO6e8VTkGPW4mu737GlW+QDwhPpu5Qr4c04+9Och/PfE9WT79rhs+YK6TveSTDj4HbDq+OuTmvREPV71Exse9VQaIvLLPwLwPe6C9arbbvWT2wD162C+9dUjLPUfjrj2sREW8LGKcvXHEqL2PrwS+y8iyvcJWTL3EmQM+vOydPbvJIb6e7JA9WrsxvqQRQz67h/G9r5VAvXTSVr1YcJQ+rqcEvutkiD7OUGU+sLCIvn09Hb603548gItLPvEEib2q3nY9lU0QPse6UT2gPP09lNKTPMGfUr56Nim+Yoxlvh53+TvkCii+Fzn2vZFxNT5IFpS9YuH3PH1xBL7Wham9XmHQPVZN2bzWn48+mN9LPp20Xb50ZsU9azGSvW3Qh7uuUEk+S69Qvu6qyT2Md1m86XgavkcOpD0F7B0+OiQ7PeI5qL2LRS8+ILDkvcjB4r1MtHK+AVC7PetoCT6ZQ5I8I1VTvkWztb3oT2u9x26ZPLWsSb7ehtO9dJV8PH5w3b3+mI49zBREviVmqzzNKru9VsWfPQ0OFb2hazW+XsryvTucAr5N03A9iNuLuAOrhT4tgcA927FCviYO8L3Cn/+8kLACvlhaFr46vCG+QJUSvXJ+Tr3kKFa+NzcpPkPVBD6Efnu+vuUwPhmDPr4pY0g9/zb6vXHiJD2CZF69nXB4PuA2uL1YHk0+lSFpvVtCXT48uy++wh8pPocieb4UX8a94gmFPlG6GL05wte9dQKnvbKgtz3PKge+cFJlvkDAYb7xwLw9QMY7vpDSlL3LbFG+PNiFPQvR6LvCSx++PuH2vMjMKzy1TUQ+Hse+vcjpJr5+0Xo+by+qvOaqBT6yXUM+xE3rvPdoET5CQcu9Ka6RvhV3AD2JvAi9+tQIPjwnYTw8p0W+HMCMvZG3Fj7Z1MA9DNxQPfhfqb3/tAi+cpQivogA3T0/zsM98ilkPL36z725GFw9TeiwPULC1D3d32+9B2gFviZwGL6H4bY9Yr8zPsBCgb4sMws+B4E/viIJpb2TM/s8fJLGPZ+7db5HRoQ+BkQvPh72yD21xA++dkWhPDkFOr7f0/u9sTPyPbgVEL41LvG89tx6vazRxr2Rx689u/VpvtFEWz2tZUi+PU+XPnlFbz4OWaY9hAQYPkIsvj0VZSA+kri5vWGEkb6OhAK+qT81PQK+fz1KN6O+9yePvIXqe745ji2+RVcrvlIKNL6fR4y+TExUvrnJ6z1Uy189m2NjviAiJ72i6nK+kAoBvRYH872SehC+C+gavCONEr62dHW+5iwhvtvgyDvo8L29W/Wmvl4Pbb52GTC+auKFPjGatLxWc4E9ypZHvtwZYz6SeYi+dUfrvIp0lj0feIA+tfgkPlkpbr1Mz7Q9Kht0vU0XrTy4Ttg6xAoGPS2VxD3QT5Q9bk66u9+3jDwwzwe+KG4YPgMREz4p2D69nbc2PveNPD6iUVq9dGr2ur0ndz7P6DI9QBofPobQDTzpSSe+9NSaPUqyDj4za3S9GVdyvYz1uT3a5yo+UODnPdSy0DycHwI++dQ9vavCJD6md6E9FVEDvdmT8z1PcEq+44J6u3jphL3OjGu7FcWbPcMqjjsLB809JjILvu4DAT4O5i08kHESvuk+oT0hlHu951QovhilHj0RGxg+jaAfPpsoib2wWba9funxPSNQG74NwnQ9ZfSLveiyWzt3TBm+xeFBPYcVCr7Hvp49IglLPK5TWz4Z9d28ry1jPBaNzb0a1kU+fE3YPU4CGz5bpe09U1c7PizpPT3kNkG9Y7QTvm0LPr6LViw+fC6EvXOSA77tCTk+WhCcvcN/Ar71fd09msaLvbLRGj0eDRO+sDcbvlvo0zucpVc967vtvcyLDr5AaEg9M9HYvbPZJT39O808sU0RvHzlYju4Qm89n1X9Paxq3b2Qd0m9UfonvIP2pL198kM99g03O5V5or3ETQM8FQUNvsTIDL50sWK98KqkPVN2Kz3RLgo9FibyvMRHv73Kv2U+KX86PgQCBr5yqlM9rJY1PiGiLb0bTcs9PBEePv1Zqb0KtSy9AGfGvXCzbT7QAYQ9gb3wPZ7pEj2k3ec92OdcvZeJ070uSKQ6RaUDPWIdrz27EDU+u7IjPlc4q73jMqI9D9UqvmHvdDztyAA92w4HPt6V4r2cuSM+JYs6Pu+uw70MJbC8M7VmPs4rOr57DQq+S6gAPurK1Lz+R40+bb4IPZAmQb6f8YQ8iE3QPcc/kj4j0wW93/CQPu/Vgrxerae9xecXu05eK71fjUk9mpYpPnjHGz71p0u9K8FIPm1NXT40PoW9iMIbPa5P6DvJFtu8QxAAPoqAJj4NXJ88Jwj6vWeHqzyMuQY98wZzPTBBBj6ULRw6HB6yuryR2r2PO3G+1h6rPTRh4LyV1KQ9vtHDPT8AgLy8w3K9JTcRvqa6OD6RCzq9mnUGusA4WD4eJFc9lwYCvgPqAT6zBvO9J2BqviqSjz0eN7291XOZPXaNUj6Uoyw++dmevR8sSb5XSaQ9DK5PPfELgr3U5I083cP6vcMgU77lqkm9MjEkvg27wz2Ln50+1MuPPUxf17zObvA8fPk+Oy26jz0cReW9RuNrvlaS/71eLBW+c5JdPTFyPz7EjMQ95zcivb35Cb3TUYQ9xas6Puuab76nFls9/psJPqeQOD39A8W76JfPvVt9xT007Xi+ZdyMPosAzj0ja4a90PiBvRDJXz4LdyG+/f8RPcJKXD4D1nW+mTmbPT2UzzvqGPu8TaEQvt6m7T3ydM28w0kUvdmS+71VvEq+zsZNvryZpj1LDs49Yi+8PfjizT0ggyY8szkhvrL5V72dSAy+/4B1vvPOsj3AbjC9DXkRPjDAiD1WfMU9RTKXvAuJUL0pbvS98bAyvbume77GIOu9qeBVPdgMPz128bg8UtYivU005r0L27K9EBn7vfusZj4YU4u9sr7CPBH+Mj7Dwx6+zxCQPK/k5L3MXAQ+0MFGvsj3AD3qZN+68ogOPvIM1z1gFC+9IzqOvQ3cDr7IwPK81QdDPd9Hmr73GSy+xl+SPkNrQb6Dh/k9RyZYuhl9qj0p5Ky9Kb/YPbgawbxCXqQ9J7yEPPy5MLxvBuq9hMf+vAY5nT1Z66O8p1Ejvhw2D71LyqS9EgYavqgfar4yqZM8CjSaPFpLmD1+vZC9tNRbvOf7nzzj5uK94VwJPoPhDL0Z+5I+uGUAPlBtgTzawiQ99WYjPae59T1xgZK9JEAhPnnqoz1eyjs9ztGdvOhCRD3werC7pkPIPUcLHD4uikM+R3hpPWmQ8T1cFa47KxgCve2unD1oiCu+7ppSPdgcOT4uIQs+a9e3PUlXsz1jHBq9k+O8vbj3k75ymf69VCNtvFWzyD18yfC8Nv0ovhO/LD4LDws+gKqRvbDdiD0/XZq9m9rjPVTVD71XP1s8G0wGPutZOz2w37w8u3jCPf9WMj0mQkG+8nRFu+LBw72Vizu+SWUQvutXg739PLO9uNsOvk3hEz4qMqA8Bng7vTvgo73Qhhk+67AAvsiYHj6TOFG95RYUvcWL2r2kFeI922sFvltsL74VMtg92JD3vbNIR77XOKw9I89evrYYML0Xy2k9OiMJPbvy4b1jBfM9mdRqvZYqC775Pge+9ZkCvkyZCr1JKv29wQj9vbxr3L2sxyi+AA/7PZDmAb4AlZ4948XfvZGQ8L1xth09ZBQsvjpa+r0yt/g9FhVgvni2Cj6eHpG9luWivUL+vj2f2Mq98mozvl6ZDr4K85Y9LiwqPb76Gr6CpHE8aHWqvTOeRL5ue+o8LZ4MPiMpYb7o6rK9zg1UvRqBNr6m9gk+qcqgPRKGAb6p05s8M1ISPh5F670IvDo+T0QUvvRERj0UwEI9UXTUvXTr7byBE1G+Jq7FvYWRELxiBiA9zo6mvb7tqDyAdBG9L9EevifgS70ku9s9EKO7PfdzqL1cRN08dmUcPgpHx72gFUO+8W5DPdiEtLwPbTs96tpLvgUFTr5zni6+SYkkvq9e5r1r9tG95vWBvN9yRT3NGlu98NGJvJttjb05HBM+JeZ/vTvpIb5waFw9otvkPCFqZbyEUfC9X6YEvmNpMT558Fu+Unl2PevyuLtYeoM9qaHdPWliCT2jDKy8CQVTPiolCjxC/6Q8EFinvZ4GFT4c2UK+b3KuPCZhhD3RbuE58b2EPsyGuL1Q14m9XWgOvnNUIT6JS4A9JtRUPg9UgT2fkDq7PBbuPW4W7DzqCoi9Kv49vSnvD718pwG+KxSDvQ75n72dSU0+QtEWvhB55T1q9jY+uX6UPYTZKL7KZBe+AqfqPKIiTT7Bx/4917l1vg2jBD3yJRY+nxwrvmAotr20xg8+LxIKPoActr3wqgO+q1pePuv+iz0FNgc+SK40PG721L30oCi+NIPRPa+tmDukCLm93helvbMzAj5WYso9M+XlvTEh6bz+yS2+bGwhPh8Cqb3v8jI+zRjJPUE7Hj0b+8W71tQDPhNIDT4xklC9YCGOPSqw5T2Mhli83RbtPYyeAz2MyLK9StSLuytc8r0owfq9x+azveCLAb5hNKa9OTYJPdh6D73wEF4+fbcOPgZMLbsLMao9gxXSPd6Clb2EB927utOcPXj8Hj7j3aY9qL2dvdQlrT22/aS9UnsFvq3lD74a7LS9sYM0vS4l1z2UFTA+MyUkPjc+Bj4MJv89f/zqPDH86D3iABk9oMknvolR7L2ZnSe+Fs3jPYmABj4Odoy8a41zPtylFz4FGLu9ldAbPlKZ/z19OA4+1Hxsvl5vCT7rYPu9f+ILPnHJFD7eILk9AVFUPrIc8r26iiW9fzWUPoWaEj6xyVE9VwFJPfkzFz1oRX29WEmmvV3DJT0+4xo+E/mqvdX/ozzCiRO+5lDGPYMo/r3DLFG+64gmvmN9ST7FCU0+YP9RPsdvijw12Ku7D//avdPPBL70zlE9TAaEvJ+zKD4X0Tm+TEpovka8RD4f4DE+UShkvknP8D30DJw9no2fPS8IYT56nmi+H1rzPbcXhz0lobW8lyR3vZWmMr7gFQi+2yiMPFc1Zb5Lw2o9/r1ZPbmFKT54ARE9d1+2vRrXAD4otg69zZ3Gu46StbqzeCg+PRAbPRJ3tj0cZ0A+VKlUvkTIjL6vcdi9C2TuvdBTuzyrf4E9o6fHvV6oVL7OSdM9ofwpvmhEZ74rgUa+Pi7oPWIdhL59ySw+fveZvUtKAD4REAK+7+ZNPWKPJb5f0Z49cCENPg+9jrxUNmc9GbI4PshBALwNeh8+YUzNvU9UmT09kIC+UqXdvaAfG72Q4oc9RN8fPtNbkr3e4u48fwh3vSuoPj48C1W+nn/dvBFM2r2GrxU9JfiEvuIMlzxBVe49TnKBPXaI2j1uJ9286v+WvY11Yr7zKw++SNA3vuH4AL52He+9XQ3cPcA3VL5ETGA9mBqUvauPlL0mVNy871GiPNndUT56nsg94g+wPcQCr70bDDQ8srAoPlI5fz26E+Q9bG+KvQn/yb3a0Ji9vKewPYqlI76paI49RISlvdIGP77NQR6+maMNvtNOoT108/Q9DWD4vQ8wiLx9hUW67YujPPoHSL5NO6e8DxydvYZIfL32vKK9LVLJPSHRAj61kSW9ga2aPCmY2rynkQs9Gp8DvkP1z73Hfku9mEI9vp12PLzfiKG6NCiUvDjDhz2Xc/o94quvPbSPVzyNaK89FqBgPS9N7z2bXfC9DV8uu1VWAz5gNjS9qq2ivcyBTb6Ytjy+gbK2veNmab3+yvm9ssX2PbG0dD3CcUU9yo0+vpWRrT28s9A9+oESvmesSD1HQto9f530veVUAz5u7TW+H1FmPJ8PIT5TNzO+7vVNvg5AEj5S1b09VWSKvSPMhT0bqhs9q39zvTC8Ib3kpv89Q8atPQJDozym0T+90UkfvjYwYr5GVMc92pQzPnhtJr0DaCO983EUOyHR7D2AmNu9n5miPcJbhr3nkS491AOyPZcUkL10k2i9FQ0jvhdVS71F/Ga+M3aVvP5nHj2Zfeq89OD1PEzCRr4pstm9OJqLvGrNoz3sOhu9vKowPQ5r0j3tygC8JWlHvVpTPz3qgbW8zjPyPfojEr7uloo8BaNCvZUs0L3elbS9LQoNvvzsJD5uRnC936qxvdY7brtPPD4+N1E6PpE9Lj2SpBk+09rSPPbXLr50Yia8QYqGPdF+Zjv0PS88NiofvtCTa72Y66Q9bsHZvYuHZj5aeBE+5F4KPkKtqr2CMq6957+VPNSaOz6+Xhw+UcBnPpsAb72Qrwg+Rfu2vF5jK778dWk+4rAdPj0m2LpssfM9dCChvctnCr7t4QU+wzwyvSei2T1QLaE83LivvTAxoz2K+lA+uvTGPHVf2r3X5EU7gSjePC9iw71AYfy9hMKfPYU0qD3/cF8+hkJGvQw06L00XI0+mwtBvT3li71aMe+9nNVbOzgSZr7TYB+8WVEPvOH9RD7KVLW9GDp/vXtL5T3hU5u9kTiOvYZUC77ss4a9hhEZvTF3DruYyqU9cc+VPXYNyj0a4+M9h57gvYDoGb5ql689RQorvltrrro5DVy9fXQEPnAYgT7oiLG9FaMSvAqVZz68P8c8IR9dPbLxqb0V2Ue+7E4LvlJ/8j2Jl2k+3Oh7OU9fTD3pvLA96HcTvfugAz6jNxU+2qFUPvpfOr2lixm9qk8qPlMvLz2qqTo903ZKvVUqnDvghdW9e1ZgPvNjYr4HQTy+G4MnPctpPL0tKLc8eDMUPi+CKT5KeRK+MrXAva9Alb0yRgy+JRFdPnaGKb0bS4C+CMrpPUwlNz6Rd+28RGVYO0gOzL3mRz4+ncI/PhXYRrx8VrE9PWsXvtrubz1SO3i9aq4cvsW0wj1fsA6+Ylf2vcMlhr1Bzqg9PGsCPgFJDz56j509XWvnPaaslT3v5Ko9U4wLPhXbtL3IJjw+/+oyPm3Qqrx2POe9w/wAPrUBCL5E9SK+JTKFPCwBCD4eWSM+vTD0vXQuzjwkAKS7HxA5vltqr70DLsO9Pz0UPllUBL4E74A+bDskPhCtRT1Fdqo9Rs3/va2y3r2IK8y9BruxOzls0j2KvoK9Doy8PWJAOb6Bctk93LofvgJKwz1NEom7T6sjvtoBLr6a2Ww96BsQvq5VDL4UmAI+G0IRPrcGrr3MIfs9djTgveh8ej5Bc1I9/9EnvmjkDj5xD049DaN9PothJb6gSRQ+fgcHvjlJNL1O2hi9VSgAvlDSnr3VHCM745ZHPYXQvz1ENQK+l6lJvqdCNzt/GNC9nw17PnrZYz6wxCc9g83jPahETr0q09K6bzKTu7WH+b2x0OS9eveBvZ4YXj5N2Aa9OuMnPWZ6Jbsnq0q9M2blPdmh7j1O3Zq9BaIzPjofJD6kFqc9ZiukPRbjPz6PELg9v/KMPOVWCr4/PLE99xoFvQ58I7370Cs+r/sevif6KL4NGXq8PhtRvoMt1D0wMhS+lCh8vVFxQT1Iuiw+CT1gPhIfXj0J3QC+OI0mPSqVZj09FmM9"}}}}, {"name": "sequential/conv2d/Conv2D/ReadVariableOp", "op": "Identity", "input": ["sequential/conv2d/Conv2D/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d/Conv2D", "op": "Conv2D", "input": ["Func/PartitionedCall/output/_2", "sequential/conv2d/Conv2D/ReadVariableOp"], "attr": {"use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}}}, {"name": "sequential/conv2d/BiasAdd/ReadVariableOp/resource", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}, "tensorContent": "1eWdvJ9x2rx34eK8xUKqPIrSO73BMou8gDs6t4XxWL0NMp48ST4ZvIgK2Lyu3kS8HoXPu65xk7yCBgs6mYTXPEUeTz3Q2067Gxl/PJTTozvZeYi995dAvLXD27wH4ya9r3wLPbaY87vY4hk87gHpu37vMzxcrPS8xf7TvGJxPjsd/R28dWTPPPq6lLzUNQi9Vcj9POrtsLxECN68ymC2PMUfh73GOCO9ggt+vMx87LwXE5y7hJbNOxK/zbsPESO929PqO2aZJbvSyXG7vSPrOltr27yQO7S77ZvlPP1nGDzSoem8fiHXvGAezDzNtpk7fIgIvRdpo7yLdZ87nuSSPNv78bshXJe7X0T4PNV1A70jJJC8Y3buOzRuYjwsa5i9TnTSvH2ezbxGBLc7YiHQuzHIjjrHET89jZShvI5tjTzQWnS8xcNwPXMXKL1yds69Ach5vP2gI73I6P285uYsPR2sOLzDI868xwy5u+Q6qrzL/dG7iYERvZ3kBjzIcta8NDxfPDwmcDv6f5q8iwIQuscTm7w3qje9NNPIvC7HgLtkrao8VPHruRVWYbywMuu87Eh4PAtxQbyLZLk8wJiuvMiXTb0FTQg96RfAur+ubjw7+dq8pMPYu3gxiDy785q6tFzUODfwjrwvUNi7nPHsPL1hwzx3Rji9gBPtPAWuFr0="}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d/BiasAdd/ReadVariableOp", "op": "Identity", "input": ["sequential/conv2d/BiasAdd/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d/BiasAdd", "op": "BiasAdd", "input": ["sequential/conv2d/Conv2D", "sequential/conv2d/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d/Relu", "op": "Relu", "input": ["sequential/conv2d/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d_1/Conv2D/ReadVariableOp/resource", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "16"}]}, "tensorContent": 