{"format": "graph-model", "modelTopology": {"node": [{"name": "x", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "16"}]}}}}, {"name": "angle", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "step_size", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "fire_rate", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {}}}}, {"name": "strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAwAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAABAAAAA=="}}}}, {"name": "strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AQAAAAEAAAABAAAAAQAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice", "op": "StridedSlice", "input": ["x", "strided_slice/stack", "strided_slice/stack_1", "strided_slice/stack_2"], "attr": {"end_mask": {"i": "7"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "7"}}}, {"name": "MaxPool2d", "op": "MaxPool", "input": ["strided_slice"], "attr": {"ksize": {"list": {"i": ["1", "3", "3", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}}}, {"name": "Greater/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}, "floatVal": [0.1]}}}}, {"name": "Greater", "op": "Greater", "input": ["MaxPool2d", "Greater/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/PartitionedCall/input/_0", "op": "Identity", "input": ["x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/stack_1/values_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAAAAgD8AAAAAAAAAAAAAAAAAAAAA"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/PartitionedCall/input/_1", "op": "Identity", "input": ["angle"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Cos", "op": "Cos", "input": ["Func/PartitionedCall/input/_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAAAAAAAA+AACAvgAAAAAAAIA+AAAAvgAAAAAAAAA+"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul", "op": "Mul", "input": ["PartitionedCall/Cos", "PartitionedCall/mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Sin", "op": "Sin", "input": ["Func/PartitionedCall/input/_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAgL4AAAC+AAAAAAAAAAAAAAAAAAAAPgAAgD4AAAA+"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_1", "op": "Mul", "input": ["PartitionedCall/Sin", "PartitionedCall/mul_1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/sub", "op": "Sub", "input": ["PartitionedCall/mul", "PartitionedCall/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_2/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAAAAAAAA+AACAvgAAAAAAAIA+AAAAvgAAAAAAAAA+"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_2", "op": "Mul", "input": ["PartitionedCall/Sin", "PartitionedCall/mul_2/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_3/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAgL4AAAC+AAAAAAAAAAAAAAAAAAAAPgAAgD4AAAA+"}}}}, {"name": "PartitionedCall/mul_3", "op": "Mul", "input": ["PartitionedCall/Cos", "PartitionedCall/mul_3/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add", "op": "AddV2", "input": ["PartitionedCall/mul_2", "PartitionedCall/mul_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/stack_1", "op": "Pack", "input": ["PartitionedCall/stack_1/values_0", "PartitionedCall/sub", "PartitionedCall/add"], "attr": {"axis": {"i": "-1"}, "N": {"i": "3"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAA=="}}}}, {"name": "PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AQAAAAEAAAABAAAAAQAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["PartitionedCall/stack_1", "PartitionedCall/strided_slice/stack", "PartitionedCall/strided_slice/stack_1", "PartitionedCall/strided_slice/stack_2"], "attr": {"end_mask": {"i": "11"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "11"}, "shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "4"}}}, {"name": "PartitionedCall/Repeat/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [3]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/strided_slice", "PartitionedCall/Repeat/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/0", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/repeats", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [16]}}}}, {"name": "PartitionedCall/Repeat/Cast", "op": "Cast", "input": ["PartitionedCall/Repeat/repeats"], "attr": {"SrcT": {"type": "DT_INT32"}, "DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "PartitionedCall/Repeat/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Reshape", "op": "Reshape", "input": ["PartitionedCall/Repeat/Cast", "PartitionedCall/Repeat/Reshape/shape"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/4", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/Tile/multiples", "op": "Pack", "input": ["PartitionedCall/Repeat/Tile/multiples/0", "PartitionedCall/Repeat/Tile/multiples/1", "PartitionedCall/Repeat/Tile/multiples/2", "PartitionedCall/Repeat/Reshape", "PartitionedCall/Repeat/Tile/multiples/4"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "5"}}}, {"name": "PartitionedCall/Repeat/Tile", "op": "Tile", "input": ["PartitionedCall/Repeat/ExpandDims", "PartitionedCall/Repeat/Tile/multiples"], "attr": {"Tmultiples": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Repeat/Shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AwAAAAMAAAABAAAAAwAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [0]}}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [2]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/strided_slice", "op": "StridedSlice", "input": ["PartitionedCall/Repeat/Shape", "PartitionedCall/Repeat/strided_slice/stack", "PartitionedCall/Repeat/strided_slice/stack_1", "PartitionedCall/Repeat/strided_slice/stack_2"], "attr": {"begin_mask": {"i": "1"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [2]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [3]}}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_1", "op": "StridedSlice", "input": ["PartitionedCall/Repeat/Shape", "PartitionedCall/Repeat/strided_slice_1/stack", "PartitionedCall/Repeat/strided_slice_1/stack_1", "PartitionedCall/Repeat/strided_slice_1/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}}}, {"name": "PartitionedCall/Repeat/mul", "op": "Mul", "input": ["PartitionedCall/Repeat/Reshape", "PartitionedCall/Repeat/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/concat/values_1", "op": "Pack", "input": ["PartitionedCall/Repeat/mul"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "1"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [3]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [0]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2", "op": "StridedSlice", "input": ["PartitionedCall/Repeat/Shape", "PartitionedCall/Repeat/strided_slice_2/stack", "PartitionedCall/Repeat/strided_slice_2/stack_1", "PartitionedCall/Repeat/strided_slice_2/stack_2"], "attr": {"end_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [0]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/concat", "op": "ConcatV2", "input": ["PartitionedCall/Repeat/strided_slice", "PartitionedCall/Repeat/concat/values_1", "PartitionedCall/Repeat/strided_slice_2", "PartitionedCall/Repeat/concat/axis"], "attr": {"N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Reshape_1", "op": "Reshape", "input": ["PartitionedCall/Repeat/Tile", "PartitionedCall/Repeat/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/depthwise", "op": "DepthwiseConv2dNative", "input": ["Func/PartitionedCall/input/_0", "PartitionedCall/Repeat/Reshape_1"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}}}, {"name": "PartitionedCall/Identity", "op": "Identity", "input": ["PartitionedCall/depthwise"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/PartitionedCall/output/_2", "op": "Identity", "input": ["PartitionedCall/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d/Conv2D/ReadVariableOp/resource", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "128"}]}, "tensorContent": "vLiLvWf43DzdIK098QWdvUDwzT20mbG8JuWaPQUwhLvpFQy9icmUvfBAvz3RLbU99Y02vDqocT3ZXuw8Wv3zPHd8TL3H+Q0+CsuYPMPeDb370RI9dQ4WvT+H/bx02MM9zFdWPb0DCT7jkzG+U8EnvTOwML75UUC9rZlpu8tQdL21USG+Nb2KOxTVjz17pCu+/jMqPU429j0uzxo+77EMvhVw3L15IOc9cgOEvLTMoL3QuyA9gSGtPUUuX75ortM8FouZPRwzgz17dxo+T91GvWeM/z31aMY9hfEJPXbNV75LXiy+T2MFvoIFDr2IpDY89r2/Pb4W9Lxwz4+9vXKPvSePMz5CnIe9pqDNvfRfQr3uRMM94U2CPW2uwzzHDaC9wqAUvbGplLzJGeu9a7M+voaCvD2ngR+9Kmddvgar7j3mXjK+GF7SvQqsAD42Tzm+jRrKPE43Or6AhJ89OiFXvn2hsr11Wjq+AVTJvO8THD4gMW+8u+ybvQ5sbTubx2a+W9JCvbGbl7wU/K+9q2RAPdy6SL5RSnW+jhT5PdJB9r2Wnse9pUxBvhgDAz5gtZc8FYKPPWSpvr2TMa28iSZAviSoU70t/xe+V0HgvXSTZ710fuy9rQnlPW++C70ufsu9pxnqvfdcvb26mAi+lKAAvpbf273pqrM80KEdvmAp3z0nlAY+ekPGPDFG5z1vmEE+ylRhPjNs7L2Y7ge+qDpiPmr1dr3jIBg+Ex4vviSLWz4VcIi9uh+8PUI4VTyP1708CntWvQL4kz3up4a+hMAdvuFReD7ZNk68b9yHvSkHbL3kmRi8YSc0Pv2WAb1Qpho+gAw8PsesBT6Rrfy9G7sePhfdDT4u4B49mUisPWNLCbz3H7E9yc6BvbGlqL2DUWm9wm6CPrJOHL2IyXA+gKaLPc1kRD5gQpO94NoCviioIz1J6Q6+u4edPcjKUb2RMKQ9YE1YPoHaGL5qeY06E0D3vTb8sr0tWwM9Oz2DvX/fvjyFaW28XRbxPcwTOT7Wjl8+e00Bvh+kOT7911c8MFk9vZZhCj4nppI8xmiNvJbhED5SDtA9A4TzPZ1jl71PWEq+BdPOvGk99b2GJp8+O/MdPoRTIj6GyLe93MUnPj3P4r00Ase9F8OnPcKoDT52GwE8lQbEPZoXpD3iIr09I0MMPghFBD4k/kU+Q09nPZgvF74TXDK+XVGkPLFAyLxXgx084SQWvvBk+b034uG9lwmUPj7IvL1rPTq+AWSJPdNXizsYsZi8zmhmPgavL74u7qA9D5c0PhRbFT6fqLg9tmYKvbX3ST6Qhx6+tqujvTGmzL1le3a+dCH4veS+Br66Qgu+7nedPSIV8L2mfdM9eqsZvrVGxT1jhQA8M09DPcaxtL2gPYY9i1j0vdvZcr4wDGC+E/QXPWVGUz7voFA+6JhJPgLv57xpDUM9EG45PjkyFj625js+BLhivP0eD766Qj8++RClPRISZj3c/VE8+C26PbyQk7woqsu946UaPtftMj17Jvi9eqYLvqmfXj53Yl+9FALUvTdEPj5zN0W+09YYPa0srTx7YY89CRXIPHphcr6nLh8+3XJAvsAfCL4uMdW9elxKvk6Q8j2crZs9lVk5vobzNb2u5gQ+YOH4vFbvKT4FF10+aPwnvhtPZb3MA1W+71hDvhpTjL1N3Eq+zsSTvrU0Gr4adMm9knAuPLzZVrztIzg9TzqsPSd9BT7yaw2+MR3FPDdb8r31UUE+kLXzO2yJKj5SyS8+VH1tPIBPEj5YVRs+5ejCPZajkb1D30m+6wYHO4N9Fb2q6Pk8pL0wvHgZwD2VmBq+DuCNvMDE4L2Kj7e9VV13vRd1dL2qwUg8L7kXvsgoED7SUfE91ccbPmQF0jz4rAs9Jj1YPmhC5b0/G989LdkIPvvpgz0HbE0+F7PXvP6tUL0CCRo+JDhhPo2mCL2TdfM9KMTOPTQpIL7uGy8+tXDuPKTUHD0uTkm9bMKJvVGFAj461sa9NLq7PfMluLzgz5o9Wp/RvRwUAD1buYi+p78SPn9muDw+STk+Z1MpvZ3mmjygN1k9onJiPAtxfb5aVSW+MLFdvXlwfb2Ugw4945EbvPmgKj6CTiG+4ZLGPcETOj38gCK+LiiRvYaKAL4XmLs9MRsSvrhkSL66opQ9PvkEvltAjDzI9XG9iA7BO0swOD3Hoxm+Qi4lvt8dB75YRwc9j49dvtGJkr3IrIW+7CLmvTYUjz30sSA978foPItsJz52h8U9qZQjvj2dsj3n0TK9PGOdPS/PLT7Kuu46bZnNPGI6Br7Gdrw6UDgUvh+QjD22ifY9jn8kvjYqKz0RHwQ+qi7LPeHLR75Zzds9FTusPbALwDyqSW89pWXyPZN8Gb67sRc+Y//OPFvNnD2Gp4s9zT/qvfWKvb0l8d29Nds2vqZLi73x8B87GN7fPRfltT343Tq+6WtkvvrxBL7PMyC9Y2VDPaui1L3SqrQ853R3Pvhx071Y2XW9gpsRvv4hVjwWpPc9W2c4vtDHNr5snjo9b+npvU6kgbw1ide9NYcUPvE7nz2Ca628FYStvTh23z0Ewcs9ApqZPE+fE74DpS29B2ODvS1c/720HPY9IZchPd5G3r2/bHS+qaObvWGLDbzTDlU9MBMzvbe5wb0/1nK9VVA4PdKTxr0qGBU8KokDvqmvEj5+6pI9HUoMvfE1FD4wefg9Caj0vZz69TyLhoo9/l3TvC1FM73Zewq+ANaBPgDKjj1ZEDU9t0GEvWWIGL7dsnE7kzgAvPp1rzySYAO9nmaIPYXIfz6aJQU+5ox6PP7Qo70UFVQ+HaPmPauOWj7ayCm+vT6DvFD/BT507Nk9zwWQvd6cPT7MIYI9fNM5vZioVj7ga1U+3XoFvU0O7rzvCA4+AiufPXCUC74d1sQ9R3/mPQ80C717LdI8HyYoPgUxe70FxIw+BFxsPf6TsTwIn1E+T6B1vte+H73+QLc9RMGqvbEZA77boWY+JwmLPeNjQr5tXTg9zLowvSMU/72S5FQ++SGRu3Sr3zyJUwo+SiAMPkRYLr6PqVU+UXW0PUqFVLy1J6K8z88Vvgh9Hj6i8AS+OWmdPYA0qb0EUBm9l5zIvSc2h7xKaqE9cw2zvBzfTL7MGUS+quguvFPsJ74V9fw9dLDbPYUoRj5aMoG9GFYIvXJOL724AtA7SfRnPZVlBz6rekw9IBD7PW9TCr1Yv0c9ZatSvYx73r3OC1k8pf/yPX+xhT3UoMe9MEmJPisN8T0dmGo8B5I1vjNZLL5LJfk9Bt+RPUTN/D1oxjW+t39PPqhQaTwAbem9vhI0PtPOM71BNqM9xy0CvetTMj0P0Y09mdU6vkGmALx1ozM9Vaq7PX0X3zuC2Le9dF0Nvu0/Aj4M6Bm+NAq3vSbyyr0dKXM9kUFGPUv7zb3D6VY+OU9LPsV1Oz07ATE91S32vcJp5Lt1KJS8dP8APQvsGT5ghQS+fmVSPp5toj1GfsY9fiyDPdZ3Bb4CeIW95Kj3PUFPPr6bEz4+O68uPh+cZL4v5RU9wgYPvmzqOz6Agsw7Y2NDPqP1bj1F9Ng8m7swPta9VrsfCxg9LX+OPLU2KD78SDE93a1gvortE77OmHI+j+6TuxBxJr6hH2E+mLwGvr0FpTwqls49Z22KPCHNEz4IPSA9nRSZPWIiD758K2A9AXizvbEpHT3NL+q91I4CPhq1TL5OIS2+NQWqvRz9JD7oyEW+Ix6EvogAOz06y3+9tMCbvcP/Qjzm+Sm9s2bbvYuL5T3x6Rg+N6sjPkjljr1Lyx4+Jt+fvUlgl7tryCi+wRg3vq9GXzyAvI09lWEFPqznNj7wbdC9UmdhvuIGyT1IZhI+pR16viqLRr6frzw+My4RvpRaCb2CWUq+dolFPvq4T74vsxs+N3HEvAwFVb05U0I+eNaovBwvyjvfqPm86sXDPImDxL1/1bA8ApIuPVM297vjPuq97kBxPnluNz3rfxg9e8lFPjvkmj0hiSs+Nd7uvSj43b08/ky9JlvxvRaVIT5nPCS+0RlhPSoNbz59ck29fSYgPRYP5zreyyo9ZaUtPfalPb1mHIq8ov51PehtCb0RIUW+I5mpvSSqLr3fUQm+0TzYvJlp871TE7e7cKtUvS6LAz0E76s9N5ezPT1LCD7Si6U9+utPPcMoMb4GXhg+MjinPTUIZz2Uh0G+pt4Tu1J5xb22Cos9kjsyvlxq/jyV5Oo9MweBPDJWpz3P0Xg9alj5PaTYSr4oZxM90jVxvQ+34z0axAq+qHA3vvl88r3tCH09vUMqPttfJb7krHY7SksaPpUIb75zqzy9JeRQPUzZAz72aSu9fI8FPiUgvT2xNmw8MJ5ivr7uS76VRBw9mtxSPsOuDD7QWVK+LSlRvdkzwD1qJhc+UBxGvupP770axTG+TNJfPO3jKD7oRYY+oMRXvh3qA77fIhG9HwihPRkf1T0Lxx0+FpHQPI0flj28iSE+6i30PLdp4b2QFp+9juVsvqDi4r0ajPe97MetPQmYUb29rRk+85S1PfCSZr7Oxpu8T03WPKOZJDs+pKM9ibI9Ph2BlLz6oyY+GvdJvQkafr1oEvW9KlFJPXqC272h0xI+WxmQvbv50r2ckWC9aVrdvU+83r2Yxji9JqYGPhhEGD5AOrI88rg4vnVZz7wRypS9dhPWPUw3wr0SkCQ+q8wmPum62j2tC8S9lFWoPZn7DbwvFbI915wJvt2sBr7LgEw9X6xevW7doj0h3zQ+zpznPcnDKb4/5ia+Nz+tPVwT1L1sGFs+LX9XPrVY97zW1Sw+e6IEPWKIaL6+0Zy8xAXUvb8yAD737qo9MUYqPfUnRD3DD409dagGvi2QgD0Enp49ECyYPJmNGD5f6Ci+C6uZvby6ir3pnAW+wbRKPtP90L0WSoU+o3M3PccSBr4RER691s00Pk6rEDy2awO+XYJZPomW/z2Pkv+9P6BzvUddOz2/VUc9YHT+O5NwWD6kJfa8peVDPj/3izwBphG9UEBBvumMRD559ZS82ucoPT0s5zy2Qzo+L+c6PvzNTb6mLkA9j6qpO+SEh72/qso9gyxrPb9ZK70N1uw9YKGmvffhkjyTE648HPmNvFEsPT5N3Wo++jtlPgd+eT25jXi9kw7eva4BnL00ruw8HZzevLplHr50zSU+5kuSPRR9djz67US+4XdLu+Yyo7yInn48mnGEPeK2Lj62pxG+WdiFPP9kO7wXkhE86vGCPgl9jz23c16+mGCdPYliE76nYFc8PTcYvrz5Lj6hG1k+e4KaPSqi2rz1Hji+gBNMPjDUJr6i5we+hdwsvqXKBD0WRPK8fETEPPweBz4sfTS+JAV4OxLMH74L4z29WjnWvUToGr7uIqY7PBc4PlyrOr4SOlC+SVwhvgZ69T1Tl1K+iSiCPbKLyz07ajm+CgL3vMyHu737MFo+VIriuxhYSD5lE6g9Q+QZvhWVbT0H3p8992X6PR/H8D1Ekz0+IWY6vtz7gL7EMuw9EcbauzAmFL5TwAQ9/J5HPNHzo70/Bzc87UzgPRYeQj5rEGG9gXYovljGOz3cFQI9qBmkvTez/L2Kq+k9Hi0FPuBsQz66E7q9X4l4Pn34Vj7Sg7E9sdnpvFbuIz6iVdC9o8t5PVXvfj3fhCm+NiETvjAkNjyYRQc+Rno0PQveaj070oI+QhrZu9Mneb7yVQ6+EgLqvYSIOD4Acx4+/MpZvjG1cr6qYw29prWLPk0tHr49nam9HH5kvmIaDr5BXwi+DZ1JvAxKxzxeLoK+sd/rPVMMED7v9XI9sYL7vZvqRT2y9xu9yljuPY86vryAet48BNrdPT/A9zzBxc88dn2tvXqCED7S2uk9jZKwvAw7zz3BYxo+Lf3APV5LIz2Yiii+KfY0vmlKGz76h8G9KracPbnsIr0hS5m8X0xPPUsPi7uG+/e7v6czPnhtDTxNMfc9kW+3PS2Q9r17BHm9Y2/MPfmWzz0rIQQ9bsi/PfgdVz1i/TI9BSY/vp24Tj7o05u91ZX5PVoztb1usES85mx6O//sMD6eXYu98v+DPsFEYb43uZc9zUAfvv66+r3sCDS+rQsGvVbL4j1+HCu+RLsMPvjwN772IFI+o38svotoFz4yzay8+Iu/PUywHD7Slzq+hAeLvSOItL18PfQ7SDYEvshN07xSfui9t1stvZ2PIb4LHq09MLuEvWnwT725bGO9fFjnPWU6Tb4pdgq+2ogHvYOzPjv+dBy+s26JvKGSUb0WFRm9NXpyvSZe6TwcJKy9HiN/Pfh3br1jEQQ9I61ovSfrNL4l0/o99ssTPQrIrD3pij6+CFfKPZyerbuld+E7Hp8EvX1BGL7+Hmi+EoihvS6pdz1sHKA81i4Hvvq+PL3uFBa9wROZvREC+b09Z4O9pVD1PfDgEr75Ufq9ItmoPawif7sc1Si+elFBvgqcEj4h0zm+RaDcvZXzT70o15I6SFOBOaMe/T3QXzG+mgcJviSd6z2ryww9hKc2PexIjr03RSC+Qy6LPRSoEj5HXqw8yFRFPTLUb7zEJQK9Ura6PNHd1L1DCwA8KhUPPU7DvL07FhC9e1cJvsfBpz3vdr49C1OYvbVC2z1WwuW9dwrFO9P+Ij55mBu+QY6EPWCYKD02fc096cKzPYobKL5wkv48vXy8vfoaWb4uFd29huWJPFJzGD4PK1E9uDoNvimpKb7/R7O95K8YPpj6NL7ab407zuaUPQhP4L2TvDA9rnimParnzD1stR++wyqDPJxou72MjkQ9hZDivWyrTr65WR8+4o0WvtKJk73E/ya+QSb3PcP5qb0XLMu94D2IPYWP5TzWoeM95zsCOi1akL2P5BU9IMGQvZp2hT3cly4+HuhWvQ8FPD4c9eO8O2y7vSBavD1wS4A9qkuqvTqnVz7mwYy9AZNEPn5OHrz4Uqy8zKIfPpWKJT5fvMy8jCadPX20+jyMvaG9agwfPglPOz4Yy889x0OxvVjpAD5TmrC9Bo4RvlHj5L1cv4k91ZiUPbIv0j3EvwC+b6kIvW9Ndr31UTo+Eqiyu2MyaD5lMT0+yX0qvsPxVD6dRh8+YeEiPT0ldT4tiR8+5PX8vezX9zxEua698WdOvOocUb0+igE+BEJju9JyHr51qUQ9/7AdvlDxXD7ksWk7ZulOPVizJT3Gqv+8I3BgPtO2YTlDEUm9XTb8O8SC9b1df/a92QAEvvKMwD2pPx0+CHuvPcKdEL7dDlS9nV7Vvcxe9r1e4XK91m0JPl2nsr2qElI871Gdu34H7L3IB6K9dXquvaXtgb20ipK9tu3+PMowQD4hN5S8Z4ABPgfn5z2gupe9r3c2PkbzKT5Wmlg+2DMVvQvGUD4ggww+nwEvvnnRrL2VPzQ95oriPCN2C77aYoy9A6eJPdhLBTx0Jue8QR1cPod6EL6o5w0+VnSgvP6gWb6C3W6+wbQ4vlfT1z3pIge+GtSnPTXdgj2jCzu+QI7xPa03Qj6KUiG+UxUEPk8NOD5Griw+YUn3vUUPST1l03A+gq91ParQIz7BeD4+DWakPe/6G74bq9i8e+nSO6YfAr5Eq4M9iV4kPkb84j1mqww+hfa9vSRQOj4nIIw9dwaMPPeKF763ZdY97UAKPhO8ab7Rtma+WGhCPZ1hkLzi2oO9P3OhPtXYLT4RKQ0+fDCjvQw78T1NK14+Gx14vdW8A70inc66nCT5O+frH76n+/s7pDsZPmBeNj3TThE+tDI0vuItDTwk8Mu8Z96nvYQhXL13Dg8+RbkCvoYYCr5aLTc+cnIMPTlO+r2MTuQ8Jfx7vaYvBL19JIa9M6xOPQ/QiL18x1g+iDkTvujd4bw9lwg9qO4OvlDYJz7tM8u7ArEYPi29vr3eCxI9Oi2FPXAlJD0gbhk+Zc72vduhAb3Yegs+RPpGvVlJTD7/O/s9p7uJPVZS8D3dw7m9W0o/PIwJ1L3H0us9wN4fPjc8Tz5D8oW9EIEUPiBWpb2Ihb292KkkPMf6iD2VoTi+FP02viOBRz6nuS++dqURPhR3ET796Ec+Z7svPviCKj53ISg+5jVFviAgnz246os93RG4PNTuqL3N9lE8v+ynPHd+zT0RWjc+0wL4vStR2zyJleS9KFr4Pf8NSz4RWjC+PaHivI95ob0pJUS+8nJOPp8r/z25Dkg92eGjPZMTWT4v84K+BRc0Pj3DgL3Mo9A9htkWvR7JUz3S6J897y5FPOcm6rxzSuM8FiNUvYjNXb4xgro8PDstu9/Im7uQIDK8eUEGPiYZMr3jm/K7Yt2XOXvWkz1Giwc+3DnOPbQYrr0evBy+OgcmPvruRT1rxq09huurPD4dMT2fP7M8RdOTvMwY/T2mRk48MtN9vTLsk7zdi5o82q8IPjEuAb6Pzu29Sy1UvnAjyz02Hye99tZFvGcs471ILcO9IMVevW5LnL1rySW+g+3JPQAX8b0CCRE+Yd7UvVae+zz/jgU+WGIEPsao6jzzujm+uBuyvYzwrzxa+gs+xOaRPS2MHb2+/LS9Z0p5PYw2ubxB3Pa90446PHc3RD13RVm95rJ5uinpCz5C9c69cezXvOXi3LvBIl89oPXVPS+qSz2iOyK+5RscPQebGb7MBam9SDvHvP30GL4+ufw8rlXyveJuND22PgI8a+UNPgy42brH+7u9sbOAPV+LWL10hgq964QVvraA872QSFi+K6rpPS8SPb04kxg96U3svMTlj72VsR6+kQt1PbcT/j0zyj29bXqFPbgaKT4UA/A7e5/APfrOi71SY5O8Q46UPB7XCb1pb7Y9ZacxvrU6Vrxs5N49gp4+vFjks73cbbs9pE/nverp+z2bTAg+XRfVvdbg171Ta4C9UOUKPrZwfLzEOAs+jC8Ovo9GD7wXB+O9U1esvjJVSD3npZ29eOUtveQ9Lb3B7tk954kiPiObB71x3zo+CYLLvO8L9L3Apeu9RVUGPgGkor1dG4Q9wrDiPGw7YT0txx2+elbbvF0+ir4lmbG9to8zvdVAFD4Ib8q9a71cvoZS0T1I3Mu98F00PWtPGD5ojp0+Li7tPePQPjyjCsq9rNOBvphCPT60UKw95JEiPZRfDT41V/a9Ozl6Pg6ABT5J0R88w2XGvqv6MD71D5Y+iUqWPp9i5z2nUo492j3UPceeKj57wxu+UMRIPuD5gj2ivim+kt6mvVS3Lr6sG/I9YETSvSFxFr17yRA+OMQmPiMjDD649ru8/dUhPh6JjL03cBQ+1IP3PRRTbb7QVB4+Ej1zPuvMzruZjdS9/b5CPqdsBT6AxN091ECYPKJZTD78RWq8NugNPuSENj1nnvc98CLRvV3EUr6lOxe+HxPFPpehPr1oJKw93edvvUuIzz0m/4e9SRY/vdIJWr4+9qg9HOcrPm9vpzzSLTg+/W0HPeXeuz10Rrw931Q0vm1srLyOso29cRyWvjrkxT3wXlK9qEE4vZFqHT4C04g9y4pyvS3s3j3jllC+AZGuvG7JAz0Ecfk9UCWuPYpWEz6jfRK+nNLBOkf46L0BN4+9jVYkPlyLtD3xYAm+H14vvGg4QT1yDgA+E2N0vmbHqD3ODKa9YoB3PhvVWr5j6OE7hCWZPfJ9aL5QFMk9VR9+PlHj2TzGYQY9FcuRvS5UEj5+JCq+MhpSvOkp1TxgnYQ8Z6kpPYW7Lz134UC+/922PX7/vby/Zwg+G/20vC4WK72zRzc+pkrjvUbBnb2UuF0+VIm8PFa2R764DMu9XI9WPfDFzr2sHwy+Q0r/vUbBaju2+0++B85SPbJtv7xrGTy+JzoVvF8Mmjw0Pw++HS9SvbylqbzUbum9RxKKvQAFljwpsh69uzdUPpv8uj1Z3Um9P51RvnXSX77NcCa+yJatvatS9D0hODy9aoMlPjQ2Mb7BEls9xCpFvQC6UT3TBTU+zH6jO85Gjb5aC5k99zpKvSFX072A9i29UrudPZVvtzyBXSo9AP8kvgdqkLzBULS9R36EPKpp472jaba84aEcvubq0r0Zu/Y8ZEShO7ToHr62jTy9rHcuPiKRxb0su3q9LytAPaZ3X776LCs+9a4rvirkIz55AIG9kSD0vYoHLT74CoK9dH1TvTU02z0qazq9XGS+vZsCEz2qfD0+noOhPQkF6D1GGbM8ioWaPYnZ9j0Pzq+93r6oPawu8T1Uh269v3P1vUykRj4mtje+KQL2vZCnEb4ymD6+6UnnPWf9QD6vquo9FopMvQNp5z3QZpi9B9tKvW5no7yvqlw+Y+cAPs09MDyP2MY9nts5PZoldb0XC+a9HdQLvIYZ07wQBwo+n79uvQ+PD70QlEk9FgLbPcLn8z3xFqI8zvIHvtbFNT7DIw2+KSHbvQEcvL0OYaY9q9vfPDMvQr4KJqG9z/cEvhEA3DzjSiy9MOrSPFzaL76EygE+v867PRe/zruBDNC91iTWvcwfMb6VXec8tI4Uvv6U5zyXtgG8B01bPcZCij2ulow8b9m3PS3e4zwAf4O9RSSbPdO4HD6uwuk9ySKqvQd/dLykiGS84VAevvG2D73hESW+zAbzPBumJD3xzdE7UQ1xPQXSEL5W+Uy8kGoCvUVewrxF7kI9m9H4Pft/Gb7B2qy94XzHvWTiHb6qy889YJ9IvIEaGr04kV0+biMgviVanb00vA28qwTSvCRa9L3OZEe+i7mqPRzrL706UqW9e28Mvitr3j1gAj0+DeHNPIpSLL7YbvO9UKf1vSnNjj2r2ac9CxOhPfPu/b2jRrs9tEEvvox/A73qFMW9ri+1vQSA9z0TRdI98PEJvliQRrzf+nY93/+ePTOzHT1PWUS9iwG+PeO2Ab493sM9rpgRvXM/mT2RLo895WFHPRNJij2RgIs9AP0GvSMExT3clNi7nX9jvAvGSL3MRvS97jb6O1+9770FuzC88YMpPckfxz2kuwC9zQrtPRlb/b0Iwh69p+feu1ckX77kXy28nsbCvHBXzr1uS8Q989LFO+TU1j15Whm+rWsPvvpnazzR8/69ZSPGPaHILr7+Qxe+zVz+Pa+Klr4Zzm8+bm8yvTkdJT58bDm9LA+LvXf+OL5dgXI96AWwO5s0P7yDxZW+70DKvfZZaj1W2TE9ANMwvkkacjxalwC9N4YhvtBouz2VlFg8Lf5Fvs5w2L72IHa+jQiovYmZND6qgwS+wbOIvtgvJL2kOSA8rqvcvUUKBj5+3V2+ZPyXvbpa6j20Q4G+EkcKvoIA7Dw01YC+H3fsPP+A3Tz5icg91miivU4xzz2Dz1S+CUAEviuBnrvxVoE94oUEPqvwiL5Wz3S+SDNBPrr5LL5rrQU+ObaJvTdDVz6PSRK+KcETvpehib6yiUQ+UOhvvn0vjz1IoA6+hJP+vNknBL5h/C+8JgurPbsojL40eIC+vLN6vKVUJT7lEVk9U3pzvfMevz2njLC+DuZkvAxJ+TypSM69o97svWazFz4s2QE+keyIvQ0M3L1HTUC+wIwFPjC9M71EKo69bEPvvfmfir5BjH093mWGPQ2gJL49ZEO8MbJXvlq/iz13qTa+kOc0vHzEUr5+R8++5arnPJx/rDsLSJe+am8Cvuv2YrzJtp++NFXkvObl2r0PvAu+1bcHPmhQRDw/+xk8wqGVPH2a473M8nE9qXSgPXnlb775bTW9ztQRPnHsgz4HrIG8CbUxvRxBtrw+Uuy9jk3ivbCCGT50ig4+adRUvp6b2j07lZW9wLyIvvqoLD50P4u+xmMkvsHqwj2l8I29b35Pu6h/Ij6ksSK+nrdwvhmppr3r7vG9yC5gPfTIbD7X6mw+aAWavo/ByT11B2a+M586vi3+ij6VLJe8pyIivZD8SD7ddjK+tftbPgSAYj7ZJQk6J1kdvnemo73aXUo91mAkvTyvL71N4y++Vx25Pf4olbw5TVa+fJOWvU6U4L14AjE+KN8ePa3rPL4dqdu9hF4XPVO1nb3qW1G97/C/PcEQ8L024Ao+yy7qveWMkbw0/Xa9I853PaiIfTzOSA++sVMWurD1ZjxpVQw+o3LBu7gcCL0yifS9z1DrPYvIHT19yC0+p8sWPpMqgj2PU7Y8Dy31PZExXL0SDTq+uMpTPlxZBT5H+j8+27cvvtdgib51NCI+t4kmvGnIubwi78E6C38pPQde3L19Sgi+suMpPud6fL0wDta9v85WvmzejD0Fddc8EzTXvQCp1D39i3I9MoAlPswuWj54ngA98Z5Kvnnaiz5djYy+WPp7vkQxLL7h6DK8i5tLvaHIjL4yuAE+FsBGvroijT3/60q+OamLvtwoPb7azyw92rwjPm+X4b1C/9s7WUsqviVBwT3ZZ+29EmNPvrS5vT2yfua9A7orvozaQb72vOW99/grvY4e2D3/Uya+i4jyPD02JT0KCiw+MumYvRagrTq9/NW9xOLBPOQ8uT2PwDS9mo0NPINIIL4EB/w9QOLjvDF/MT3Pymw9rWWVvdS1Mr6VKBM+EO8OvvVaEj3oTyI+yhXhvXrHxDr0Aq+94/q9PVYHAj2FDEC+d4gAvWrSf7uS/Nk9yS6uvIc2Rb1i4Se+An1dvsJ8ubp98JW8eIZevWWBsTzYrF09RJR3Pbo8Er417Ly9XF/DPak1jLz54Ae+CrGcvCyXwL3aC1W8QKKivZxCtb0Aw8M8YVb8u1aTgz0b9iG+SAE2vvkLrzyvavG9tMapPHBCw7125u29dLNQPJ0e9z2DgGq9fRrXvdJwAL6hKD++gTT0PFFbBr5i96O9ZRUtvoZZLr1ycg0+iXX/vAS9TjyvaRq+N22zvFX1mbwpkiq+1L7nPemczbsPYpM94FJMvrhV+T0vZUg84iVIvnV0CD4RCl88NCuTuxvSxz3JFxe+ujGSvbVa1D1DoUC+bigFPZSv1T24KPE9ia70Pdv6ubxKyWo9mjUGvqbVt72xKN29tLG5PQWMwz1mceG9hOoVvo5NvTxeqco9sWFGvZuHkb2qMBU+dkjHvekjh7zQZKs9F4XqvcwrU74dmmO7knSyPUapnr4X9SA9h6SUvbGqejxhpm+91Mqcu+i0kT7MBsE9z5lxvvLsED5rwp++sQopvoyNgr1B6Tk+RYosvqu+BL7I2UQ+l0rwvRuGMz4gWU0+piiFPWlXNb1fdqK9Ze+NvUKPv70e1C+9CBvIvIMgE77Xdk++EId0u7ECDz5jz2M9xKKYPAKPRz4Jklm9byzsPduTh759L0A+SRBVvQ3Vm73ItxQ+oPnBvHWaLjw+C4I9jGVdu1c6ED7agOu9V4YrvRma5j17W1W88Yy0PRyXQT4Wuk4+wPWzPV0nfj7XYiE+ub84vXSGFT7JEb49NhAgvis1bb39B0m+3catPVe2mL4IyH++o3TdPM/xQ73v8Dq9R+BwvryjAT1oBRe+CsddvnNBFj5YuTK9GpUuvkVqAr7Rkva9xHtuPP4wub2oLKa8+cSqPVkelLwIUAo96DPQvT8iID7W06I9M0/dvAL12j0jgi09t0SLviOoRT41mQA+EP0GvpHh1DxZRwg+Bl76PSuTR70YyEQ+HIG/vPdNND5NPC8+p8SJPkr4k75diC0+kAajvTRIbb4LeR++1xkFvpjfAr6J6jM+SXkNPRsNV71oBZm+wa/OPSaEmb4uawe+nN2dvPNKnr4uU0a+auQ5PsN3AD5qfCI8xBK4PQj1hr64BSa9FyhYPSFxF73vQjM+DW1EPUjWnT66fKw904+NPSia4j0yDN86ZhZ3PhQohT6EGBm93YpxPnG2B753tyC+gFg9PvWxlT1cSh++QWJsPiO5O76bIgy8hZeBPn482L3iPJm9lcgvPhmIkz1Gjf893jXDPeMmSz3gZYM+0mEsPTclhD7DCVY+bC2NvfR7hz3FNVK9qM42vjYSlr2Ug1Y+iWL6PVTcXT6WsGe93vMlPgjVKD4Y3B29eRpCviIgq71iM/29IIZPvkIPpD1/MM29KHJ1vTN7fz3+fSs9faKevXcsbT5VFQ++t+QCPjEtyb2T/nU9byemvUqg+z31WLU8fw88Pd5XSr2ZCxW+1aFGvvL9871gwLo9YTmOPZ3MQb6Jzhe+KukCPsdiBT6SqjE+AJ7qPdNivT0Wbn+9gPiTPKSGFz6ap4E+EMNevbat+7z+4Nm8eQo5PBKdhT4YqRG++kM0Pj3QHr5n14M+QdG8vW0mUD3wU9w9w9vxPMgs7jxiRlO8gHaYPII9QL4cb10+Pd5uPD/neLyt2gW+06Y2PjD7Hz1iPdg9YerUvTYTCT24R3u9WEQJvj4qIr7waLq9AedCvhCv4j2jmC++Op4RvsmlRr4E4yc+AJtNPMJYjr64Fw6+eqzMvZdXAb40a/m9HlGTPQfJsT3xeiK+27QWPm6ORD2zpLK8ZZpNPmh8sj2GYd89OgcDvhRyvz0mSXk8oreCvftaK76RnTc+egmGPaZaUj0Tf/a9gwYvPaRder0rCPi9ZmMJvt/VAz6iVHG9kSMFPNuiVLwUGwg9OKYCvtaKA74faP89J7Z1PvDNV7wdhbS9MggpPnNlxb1hbkM9qmT3vRbEHb2J6h4+GE8HvQm4QL1SsFQ9JPTUvbS2xz3BzJU9MDtnOwhiEr6ZiVA9BedxPHSNoj2tWSM9LnEzPeipEb4qAng9jb4kvmZ1rTx5MNA8L2kLvvfxQD6tlLg9GbUSvhk3z7wupls9+K0lvoiWR74fuwe+IOzpvYIFyr2vE0y9MvN0vWyewL3006g9LYEWPZvGGL4CL6u8gGJzvcZOsD2xRVQ+z5sbu82bQT0hF387HbdmPuf34b3YC+s9oeISvVmVtr1x8gq+7EUHvn2TiT2FCzY+/jc4Pp7Ivz1skBc+Yo1TPlO2ED64uwa+5LqqvcMCKD0h36I9Qw/lPM05/b1DFu49ckXbPRHuf72+Y/O9okwTPaLscD0d3JE9xPTAvTDkw7imfH28SAVFPvEj1j1vTfe83a3fPTIhDz7SXBs+wPEQPrObpD18P0K+kg4NPkld6Tx+XOU9o7TDPe+w8T0fUw2+TtABvpxaYb2njA2+tT0VPhhjI71nc648FSsDvhW7k70sDwi+4TQYuypeRz4O/Q2+Yf/XPS4mYDuHlqI9LoYDvoXfnj29zog9HfdDvsjo9rxbDbg9LpUNvuvYmL1DVy+8CvcRvt7HEr4Ytw0+Y10hPaS4W7yxHBs9C4TGO5Acu7x2vSq+85WDvcRQgjyOIDk+oDJQvReJKD740Nc8pQiYvcHPnT1mCl+8p9n1vbv+jr1fRLc970Anvslw0L1SHbM9aCu/vVak2DwolKA9xceMPMG9Ib7ttiw9p3NcPTAfPL4nPq49i3wCPfX/zr0u3EC+k7kyPgzf5LxXNGQ+FLJ0vpmTkz5UWus9zOTxPVc7cT2OJeG8fWOwO/ri/T3CSQ6+DOKcPam/4b0K3/O91nQOPp1WL76WC4K9Eg2yPUDvhD3i8S8+K+4oPRbBlT4UfBY+9jonPrQ+pz1MpL28fRi5O7Ifqz2+99a9HpRAvkjYiL4SBWy+Ke0bPuqaJ756F4Q8IYGMvpVHRT7P8qO8w/eqvCfDRz7GwyA9Em/JvbFwmL3xfS47x4lOOsg8ML0aQTg9WeNOPPzcvb1XTLO8XJgLPuwXVj5hrDC9Ni3sPdPEvj5j9Wg+81dIvt/Ekzt7W1Y9r1Exvn1Cu703FtY9waRoPPkP+70+OsE9WM46voLTAr151m4+cnMivt7Tor1hv0S9QoWivZ8Rab0EnyS9uOoMPl3wG77ATDM+0ODLPVruhjzAI9K9xTZWPoL/Ij4kOxM+c799vGRXdD6es4Q97nhIPlDmRT0lgxW+x8Z6vZ1BQb4+qk++BupdvYzRMT7VxTa+RouaPHyYhj59coi+G+38Pd+mIr1suyq83hYdvv++Pb7utZA9UTZMvYI4ob1iFCK93rCUvkHG4D3JB2y+L+CAvpY0aD2zqCI+apmoPQoEI76OI549zvULPnOYYT6F76486brdvNxucr6PrBm+kcZSPlSpiz2GeBO+n3obOmpABj7l2ws+nTc2PhYb4z0WkSq9LiQcPTj8kT4518s9MqOuO6P5F72310Y+sY08PoA6Azyx2gW+ijVHvdyBpL616bs9uyRNPqtyzj1Gs0y+hIAUvrBzEr6N91s+Qx1oPafROL2+pi68BSqFu5P8ZT6Qsli98AXtvP5pXDyKrnq9dW6qvbiV+73lwhk++9dXPgWvGz6z9p09AZWQvWaGjL0arpY9L6P0Pc+EuT2SoF++FEvGPc4R4TzmUYq9oW8NPr4kGT1b3xg+9hadvMPG672hSUa8BCdWvo3hLD45iSs9S3rdu0sD2z3q3y29FKXqu5HVjz7tfCa9ubivvYC3Hb6c4K+8BYKpPTPlGj6sgxm+N40KvintEz5Bpt+7JxFHvrIXEb6Vzt89plJTvgqzvb2e51k+DBobvoFcKD15ykO9uyudvcA96jzzK+08FCbmvNc7zj0ROIS9r1DDPTLLL75L8w0+asXZO4C6nLzPy3491joqPgwXvr3LxBE+qZ40PooU7DwuGcw93+K2vSiyED678Ae+zzLfPbsH+r0xD9M9s/8Ovlqhyz0i6Eu9jsarOQvLlr1GI9697Nd4vmVWAz4YbaA9fycevvPnWj1wbZK83IrLPT/S/Ltmu/q9dbU8vY7CMT6O+HY99q8EvXmAPz1h/9m9FWdVPTWmKj79b3w7u82yPCbXsz0yVlG+ggoSvl03SL2bNiW9qLdyvedGib20aCW+NtbnPUI5uT2S1Vu9o5KRPBtYI75S3Qm+KChtPfpnl73N5zW+wKAiPCaMMTvwwzk+MniNvc0XWr7Q6Ko9s10wPsj4PL3Pxow9DjIZvt2NE77uLse9FS8qPpv1L75Zesy9yixPvRiGSj3eh2I9mUB5PUYNLj5iU/s98maavUf8vDyWgCO+a3/OvTveS76LwxK+yNzEvRLD9r0VS729u8tKPek6Lz2mqVK9vvOEvPczpz2EbBO+N7DXuwsCo7w5sAi+6ORkPPre2Dwpkvu9+j8ivuJeyD0Amhw+1cVbvcMnx7zVhpm9LC+5vQ0FDz69z3E9dcOgvRhjiL3scDa+QQE9vHEsIDwbQZa9ubbYPc7izD2zmRO+vd8AvHm3b7zRlJU92HE4vn9M6D1m7WS+50VrPVY5vD4AZY+9RZRzvvCDDz51Znk8W8nDvV0K8j34CXO9p/8avjaiBb5hrPU9m3UOvn+clz5f8WU+CGaqPe6bLT7tGb+9qVhyvewCK76pU4E92x74PfO0Cb7pI3492u3QPPVZk70aYvw9hG6BvjJff71t3yC9KKeWPa+cjb7r4O08StlyPS+XCD4qUYQ9pr8IvpuPAb5QHgK9VCyVvd5Itbv6RRS+kilgveBIfL2QYGG+/gXqvfKnB7413Y49ld+6ukjqQD0rYGQ94s7APa+4tT2mI+A9S1oLPaMkprsiOwG+U7A1PkNTCb6ryzq9wGtUPktJLD21ucw8BLdlPcBn3D28DyA7URkgvspoOb3xoge7UaSuvYgtLj3IHUA9z+kCPoarAr1NJfy8aIPPva5Vpb7Uywu+qGnWvZH3+T3QQRs+uCAgPbidAr5sDGc+EWqhPYDgSD5R4TE9Xb1nvkukX7nzAnk9MvbBvXvgfrwEmrw9fYW2PaJ40LspCvE8sCAqPgvx9DzE1+m8tp8APW7Rg77O6hG+e6UHvkNWTL7Ubj09uL0vPj6iRr5yAri+BwN1Pmv8l74Dobs9Cr4DPOFjJb60rui9JqNuPf8QAr4drWe+85qYvT8sjL60RwE+g3QiPjicgr7q+uG8no2tvDLxbD26CwS8SHKBPpvZmb1Aoho9EG+KPlgKbT4mgHa+cCPpvA9vDD4A3fO9vxwbvtFd6r1MQkY+sfQIvVc/sLtrXGO+OKIXvKxrRL5PpIS926LQPWdqFT4c8jc+BCAXvQFKR74WW2E+uAzLPfaxFT63ebA+CEeBviGnAj0aGpu+mc+PveLhcDybDQQ+PhzYu7jNOz44Hwm+zHtUPT+1VDyuF7i+aEZXPUa70bzgHCm+68SxPW29Az52rxy9tvsnPkkvhr7E8Zg9TqzLPeB7Cz6sdFu8duIjPoJjIb6gi64+lTUavt1CLT4jwpA9Pzv6vbrLZz78SAW+yONYPkH9ab5H0HK8hFCsPDPk6L0gQZe93uyuvZfWzL1/bwY+HZo0PpTqcb44H4q+A6srvnqzHj1uCWQ+DXV4PPeVAT6bERy+8NOjPmL5gT6TpgO+n4GpPuP7obxQ1mk6NYHDPSEtnzxJKAM+OffpvIgCsL21pEe+XdHdPdvMhr7jPxs8bm6ePd6OJL145cg9wfysPbCLcD78hX++l6YGPniH0L3a/xa+yU+RPaiAED3fw9o99+BqPSt/hLzmkgi+XdXku5qxkr3MCm29Lpwvvs6SnL3EI1i8ExJEPc83HD1K59S9ebQKvj1rdDzVclm+H9BCPtK6Fj5qiUM9oxISPnLEib3hq5U9ZaVzvSIcG74lr5A7ixD2vQwdez3oCUW8noTwvSUokLyFSaK9vPYUPaMBHD1EOBO9ctIiPu7hgr6HMpO9Jy35PTvUdb0iS3W9QicIPabjQj1XORY9zJ6FvjfA072FLB090RiCu0uQmz3yuz6+Ob5NPDf/9rw0xD87/GS8PfmXh71wWQO+70AYvppEo7zMHIk9P7s+vF18Pj3UT1S+tbAXvpy2Or1Tvd49eEGCvZUDOzsbNqw9wlSeO1Pt9j0USgA+v/w9vXwLBr7SDqK8ctO8vVQ6zj3e+y6+EO0SvmB+uz2wrw29L7cXvkBldD3tvKs7dupbPShHbz0v+/k93qoFvWVSPD4exPY9FX1pPDqbQr6q90w+2tL/vApJST0c3l6++5PXPYR9zb0lVgs+S9PQvWl8cTwQ0H29ihR/uxLp4L2egxa+my8mPklEHr2udUG+1ta9PV2p4DzcC2E8tIxWvteL1zx5phm+jkAQvfHjcz29CaY9PqlUPRq3mb0gAgG+TYYnPU5OM77+jBy+4ayOvV7oTrsOUAI6CSy5PZGLDj5M7ra9PXT+umk6hj0+WQ28X/RLvaOjqz2jSVi9RpI0vQsKhr0RGQk+WMPhOaSlJT39zT6+rhdvvH4ks70i1eu8B7kfPvxU3j1QSgI96W4GO90RIr5UBv46I9I0PhNoA7zPR0c+uvb5PdHPCrzFDdk9aLpzvXeDer17U3I9Ti0/PrKEfzw+zUa+NU6OPYKypj102Ck+jh4evnwXSL1hfMO9+DkNvnVfJT5stHA+WJfmPEmHnT6maPS9JNGdvbhFUrzpGCM+dtFKPk1Egr6XBCu+CEIdvaj0+LpZKEQ+iG7tvTS/0T0yd+290MuqPVRBCr5Uw5k+xbe+PVZgej4Uy4o9yPPUPSzzZ72wUgG+vxsYPgSAjz6LTa28r6MvPRVajL757wG9oUiuvawshb1T5Hg+5AeSPnSxijwe2C8+z6x7vQ23ED4Vk4E+iNpGvlm6Vz4FsDK+mmovvv4U7L3+sOe90QrJPXB2Fj7F2S6+B4bdvUuiHT5YD8Y7t+CDvE9I1j158ME8BUU7vicik741Gyo+L4szPsd0CT7nepC9GwZnPhFD9jy1O6W9Qn8nvjgfDz7CLEO9lLqWPa3kHr5y6/g9oW2gvhkTGz6hZ4I9+w5nPmXw0b3pZow+JIydPps2M72ZaXs9x9L1vNtxVz0CUTU6uZAOPun+M76hOok8HU80PtZqKr5JeCS9OCdGPq05n76Ejai9+RBYvH6f5D3qymU8vtaePKPp2T0jvgy+7KDGPeNABT3Lvgw9Fgd0PmMhbDwq7hq+7PoyPpnj6L2JwJ+9chVwPeWtGr624oM+ZyoOPuWOgT50p0o9A2mQvIPOEL7RW5c88R0QPdXZej15t7+9Arfive7ugr3JZCu+ZTNOPlqgAb6+nGq7MeoPPoHBZr6W6fO9FyANPIGwdr4Swsu8uvAcPhl9vz2Iggs+F0ZZvAKoaD4Ph4Q933iPvUg3Yb0G42Y9TTeAPUe6aLyMI0m+dVcJPqcNPj7lMF4+xiDsvfxBeT5sloe9m2F4O4zHf71Lu5u+f6nSPMtTkzuUyIs91IyNvqCfTj6mLk+9yvccPqtVDr4OquA9kQ+xvWLcgL5Mnoq9wHMlvpHu5b37+Wg+nXSYvAr96z18C/O91KiSOs+RS7z93KC7XC0DPjW10rwhONU8Bs6pvUHhDj5Hn5w9ypkJvs0sx7op3v28o90mPdMWEj1l1H49H1lpvTGa5D0y+ec7xnvTPDCPAz0cDV09UbulPf2ej70hERk+E4h5PqjgTb3tenQ+wpwLPrJ5IL6ZnwM+r65mvDtZ/z2iA6W9y7aIPJ/Uoz1X+xE+6fwMPvnbAz1iTE4+X9YPPUkMZj4SXQQ+056OPNV1ML48Ic69x1+kuzszuzx20QM+lbOmPTC4Ab7PPCi+tW+sPUSBZz3joF287FoevpRT6rxGGCS9RY0BPt89GD7rPSg+n08mPus7hb3ImYC+JiQuPrNq8jtSoPU9TVIwPWFdbz1Sq8M9XPEPPrJg3D2nnQs96gnnPVDQSL2TRNc9xyYWvoGFX7wkWg8+AvuLPaDv4DzykuC8IfwdvW44jbwe55s9MTdZvkmg2j0K3969WvhpPTIRAb0P3oy9bRM8vrIaoD3soYA94AdYvUMF6z3IM4w9mav3Pdm1C76dYQO+2BUavpda17zfu2m9ElwRvlE6Ir5ItUc9QgUwPczyoTkiuEA8uxGfPebsoL3lSXy8wg3BPeYi6b2bM0w9eK4ovrhlF77ZMxq96NLVvSrh2T1Ozwg+358VPV3GRb0CFTw+/zdhPdU54L3MDgu88xmYPDBjgr1MyB6+wRm2PZoYRr7jmka+xYgnvTSgWj3Aep28toU9vSOx7D0xcx0+x7TyPV3/hLwyHkm9LQLhPVoglrz/WBC9fqraPdm5qbv5l0A9eTL2vQKGZD1JcMY9vlw9PhId8D0A9Es6b3DIPcRrtL3MbdC9ClQHPTwy+LxMToE91RYVvjKD0r3hw/c9MwdxvVVa8D1H1he+q+gavjLa2bwYT6G9z8gUPhPw8b3tcZ49zjqpPfHR6DuvEdK9HWfkPZa2772Q20g9+qKYvZs5Cb6Z/Oy9I9iZvWvphb100AK+aaccPdT8ZD0f2i2+QEH0vQMwB75MggO9ZYT9PZCzTb4R50I99BIxvnnaBT14bhY9VgpdPmv70r04qiE+zzkDPq02vj3Y3Ko9Vs+iO8KGDT6RyTW+KiTGPRbsWj7Nb0Q9pHD6vPJMobwMTZ28xQ+vvMweHT69Mp89us9MvsEdHjsS/E6+guCDPadTJT4zhEW+7w6xvCFXFr6AfCi8S5wtPvJpTb5TfiC+1zEcPZ1uZr6wIyM+q/UBPo9PBz6G5AA9A+fnvJR7ab2WDkQ+OG+ovCuS/j31cQo+ewJXvhuuYD3fDFW+t7vyvajMtbqWYzU9vHIWvd4T8Dx4RLo9WWiXvg7wPjzJOE0+PP41vm7ST72JoAe8TYpzvlozET4/mhi8iN2SPV+qgb0Yf6s7xoQxvkD0Y778lzw957T3vVa9Ij7sUh2+QJ4KvrD6uz3TvVc9PNdnvqo0Eb7O0kE+9Vu8vdfIIr69Af495qftPejhmb2KICS+lmqYPNLVVb4YFJK9o/hHvD9HIj4Ajz69umUhvKBH2roBvRU+dFMzPXa4O74/Vm29hmjnvYCrvj3iARc+fpI0PWHMv71A2OA7GC+lPYhEJTw3QAc+IGBfPo3CoL5K3zI97AkdvuvEQD3NBD2+pnBgPTbnhjtVXEg9unc3PjrqPD715R2++5GcPU+WHz57G2K+BrilOdYIa744n52+T2k9Puc+ej34OUa9uhEMPmnbUr2gako99Yo0PsGAm76LgYG7MfEqPlzAz7vuZB4+I6FxPlGPib3SCo87qQ2JPtTjAj4jYrO+H3sKvnJIVL1SHAC8skqivdTRNr5zPWA+iChIvZu8RL5sPC4966yBPn9geL7swBI+h/v1PdOP8D0M6jc+RHaqvGdpLj3c1BM+AcoAPhODKj6LQ+I9ucfIu/awmD2qzlq9wclGvv95oT2xK04+r9T7PU7kXr03+7E91Pm4vC/NIj57Qai+EOY/vmY1nT7XQBQ9Y4qYvj3M0D3/+BC+4ZRMPhDwjL5bxga+mFqEvLpTDb40Z4O9tzaBPVjzer7KWD0+5+BIPswnEr6DK0Q+ubHrvTknUjsLcpY+qEJUPmrTG75VmKs+Q1kFPZzbWT4OuWA8HbgfvT08bT0FJQY+vikEva5M3ju83Ki+fX9qPvUS2D0fwDg+xiRdvmPurD0uiqi+YiW7PXx0ij44ka09q2ekPsKjwzsoyJa93HcKvfFAljx7t5y9sQvdvXRG0T0T+1m+UHSbu4gNBL7+aaq9WkpbvpVUcj6Xatq9C0vfPDEyDz4HmmK+3LCJvrQA8boprha+v0KlvpkvPDwmNsk9I1oePjRgSb7JwEC+kKlhPCODL77f/6I9ZVtyvjtMIr72sYi+Mz5mPvMtbbyK3mS+E7EpvmaRsbxQp/+6SpUcPbtf5D19zrq8Uo0VPrDJir3/sPI9pBfOPV5MMb1/lZm933jTvbwaAz57tiS9K5hQPWi2Br7XmG699h19PSbGzTwOxPG9cMAavpsGg74IlcC9uoedvGtFprwoWgi+FbKpvdAVxT0DjkS+aV/lvXq/Er7sezG+4gakPZN+Fr6v5ZA762s7u/o4EL4NTTk+LmycPU0rnzzBWVE9Ib9zvdn8jD1cHpy7xtrCvNuly7wiLpU98hfzuh43bb0m6pm964QDvZwIVL5LZYa54pYavmkzAr5zdie7zGWFPddV/D2e+ps9G2zGPXhXHD27gOa8B3RLvPST6b2G3uk9wnhJvorjhL34pgi+w4jAvR7SCL7Wwrs99pYxPfliOD38ESG9CJqHPEOJCb2i/IS95PqNPb6dhz3ZYZa9jxUzPkHmLr2EBAg9eef1uqyAAr5HqUg9J0alvSCA3L3J1G682YPwPTCquT18iey9yQBgPcm/ubx4ab097z8lvtCFDD4o0O+9Q2tvvmFJDb5Rwi69NTttvbM7q7z1jR++ZUtVvisEobw9Wqs9sqnOPRTqwj2OYau8liKkPd5HEz6vN8y9DUGyvJir3j2e9hG+jni+vb+cNr7Xbxg9D/X0PRw+oDrUc7S9Z/rduydF4z39LqW9cBi1vJCXYb2ZiVs8KUsjvg28yj3qDDq+vbx9vpvnSD3xCso9U85SPv6yBD6g2mk8ErZGvHdF9D20kVa9NMT5PFWarT1Mi6w96BpRvrUqnL0oJZ294Ix0vSSZAjyb5WA95ukRPr5JHj6G9ES+SaACvuXAk7zpGAS8tfptPu6RGT4WMCQ9jdn1PVXZY704ujk+3jf3Pf4w/b1i0fy7S+58PrLlDL6O1AI+81SovU6r7D3xcRs+wh8zvj0FWb1JI7U9RYjsvXqUVD6pbaU8VykRvqi09T0tHTG+qC6+vbyQsD2/How88AfjOuPvrb1UMI49kGfdveoVi70cNgE9i4SsPQU9FL6I7i67tjcLPiAIYT4EXIQ+fCW1PTRP6j1oGJY8lC/1PdZyk7z6NyK+bnIGvl9ROz3IpxG+tdYYvRXtcDxjWuc8ORRyvtkvUr6KEAi6CKxLOcrHs7zpNN28/N0lPbxowTyfEZS67/H9Pf+Dwb2vLIO9WAs6vgcEPr3/i/k922WLvRoU7b0nO/g9XHaGPUNJSz6Hv0E92T0xPlnIQ742Xtg9eT19vUS1IT1OGhU+FqTuPX1pi71achQ+jLEePa8LpDyVJcO9Gv6BPSCqRr7/eEw9kY0+PogGITtXeY09U9AGvR5Rs7ziMpu96EqAvJtN2zuZpRo+qPhEPgA0jT0UExw9LKkqPRsMQ7zJJ1Y8/DYCPv+HQb0YP1s9ur9YPv71Z715nMo93xDzO2EmrD4lSiE+EXfDPCRYLD41zBm+IwWBvW2noD3+dvi8ycXYPOiFaL6+hiA+oGlrPHfUsj0TUn+97XD3Pc9gCL6pBNU9lb4yPkPBLD6wvL49L7xAPnXUNr458eQ8n/E4PvHM/j3MdfE91W5Xvtr4jb21WDU+xezdvQhMcD7NVqq9mEqvPDOVkL1i3xQ+xkdgvm8SIz6wGLQ8jLwTviqdLD1yKbe9YQDbOzqwBz7t3YQ+yJsLvscpUL1bUjK8EWeDPOZFoTvOyES+TtO9vdOkCT6FekC98oWAPuqwVr0VCCQ+YneRPb3Fkj37i1u9ItMYvmELPz3b8za+Iwi5PXDY/D3TRls+IFIQvhSb4DxSyeA9HbrQvS6xbD3zYAC+MhR/PNsbBzwFNU69jPP9vT5A7TwghQ6+kc+XPSD0U72/scG9Of5KPqxAij1qADk8pxLSu/jjJb2Z6j0+PEwTPD8a3z17v1W+T6kTvb2XRL0PMO681ts0PjAWhD2dUX4+osJuPf7MHD55nQc+Z3ObvcQoXj3h7o69jAeYPA+rD76CvFY+osMKPTfcNj1lHw4+fnsMvlNR1z25biE8kEWavbZMLD7WXVY+HWusvYren72M7Zq8yP/7vY2Zmz3w2789hqHpvW4ugTxAqCc8pM6EPpOpkjwUwgs9jW28PQa63bz5rWK9Sx1CvUQIpL2CYaG9euKmPaoNxz0rfvk9i5sMvilhmj2SI3O9gmoMO/QeDr7Toui9IVBxPI6kk73slCy8ZlrGPbAxDT5FaP89pRWBvRD24b0zOpC9uk3hvTf4Lz7r1cE9nYvRvb+Ksr3IKue9a0O5PT8zmT1fNLs8thOyvCNcjjutxPk9DHNMviYevDysAc+9bPgvPqR4uT14ctm9iP9oPfQA3zpVgvW9g9MSPqLNvL3fyUS9kWT7vLth4LwieAy92Zk/vuhNqz0SY5Q6XkU6PqEEUTuDDDi9c8+VvV+u4b1LTR2+HRftPaIsXD1oXG69vUCGO5f2kL04sJq9zqptvQVMNz7k5AK+irkhPd3IXj0nRrA9VLoovhSpuj02BL89Y8hTPhtAAT7HdyY+qsWYPMSIb73Hmgo97SfqPY+yf7xICn0+7aDjvQ9hFz7Jd8k8b3GrvVRyhLxdPfS9r1D1va+1f7yWiAW9tTu9PPVJHb0F34m8oAsGvk05QT0SRwQ+NThQPUgZPj5ppWg9XVl9PVkFab0XvCS+ZVoevsC7WL0qf+08khq+vSfDdb21OOU8QOwuPbZxB74PJOG9cCzzPbsNu71j7BM9YgUuvYY0HL4wkQM+wIDRPXfPdT3PBBI9t7YHvm8EuTu/3Pm9ObagPSTTOr0VSI28S+G1PKN1Ab72JHO+Xq0rPmskRb4yBEy9tm2/PbkJdj7rchs+fyqgvagLBz7cPDe+eOe1va2TYL0i8aq9JEedu+IrkLwUXKq9xarzvZWJoD1EaHS9KWTQPWYwrz2c9OO8cuqdvWTpir3ox929d6CcvczZhL1PgxY+6++HPSJmG74k24w9V35ZvtxaPz7fSi++IrE1vWb+ob2Q+JA+t2PLvQ0Hij5n0nQ+3eaJvhshF76oRR89FLVvPlqWRb2IeZ49cjUaPhH9dz28BNQ94DpWPDigTL5A4xm++hplvqgOeTw2kR2+Q5ESvnn7PD6fsEm95nlXPW9i9732AJ+9FXL4PZ0/SL2875o+81BLPqDvZb5w2c49K0SWvWtGBTu/zFQ+Fx1Tvj5swz2CyZm88dgVvuxuWj3xBkM+ji+iPSJHmr0p0wg+yu/ivUNy9b0eM4e+NGzUPZ3sFD5hsLU8iiVWvvyE0r3aEhu9QTMlPUfgOr57O8C98cRMuwBxyb0WxIY9Ui46vk++kDwA6rW9dpemPS9jn73EkTa+eH8KvnBeE767joI9xGeNvFO2lT4we8M9WJ40vgy5571I4OG8yFIQvs7h7L06rS2+68jJvLF0Lr1hHmm+wuggPrfr2D2H7X++cAsyPkJ1Mr63NQs9V6wSvqllAj1HYE+9NP+QPlhgur0yVmI+dV+QvQTbYj5vlzy+osEuPkOzfb7kI/G9IhiDPpTqSL0Xg5u9YTfPvT3Tnj3dR/69JeRnvvYdbL71Hdg9g1gzvvIOjr0vJle+2ErNPQ/B+7pP0xe+bK+jvDlK6bv2zEI+qVrMvU4BOL4YOH8+Yh4UvQN33z2ankA+3/07vVnpAj6FELW9f/qDvqCGiDuMoxS92LLtPe+9tTzdpl++SPOHvYeSFz43C+M9r4lePYYA/b0P0wW+yDYgvh/RwD3kxME9OIAbPHGXkr04RGU9bSykPSp+uz27xTG9fdn/vc//Fr7hF9A9Ng1GPsiujb7keNM9lSxtvukdpL1A3Qg8l3e2PYkXY7732IM+vXYyPmahmz02VRW+k34CPeNDM75vhAe+qa7OPdJDIL7m/xO9WfxbvTJZ1L2u+q49JPdpvhJAoD1iKjm+vb6bPkMVgT4FdEs9zmEZPsiYyz0PCzE+O/CXvcbzmL6isRu+pO5LPYPrfj12/6i+iHTTvLkyhL6bGS6+vz03vg9dPL5zppO+xoJKvj3b+T1x1Y496G1Svu7NAL15SWK+L53fvMAz/L2pDQ2+tuCuu8x3Er5njVW+HiYYvkOSm7uGZ2m9sMOpvibVXb4WKyK+b9iGPlDa2rsf2m09cQJGvn9ndz7uE3a+KMb1vD9vvz2nOH0+awgxPqcYd71U3K893DJKvaM6zDzmiYi6IBEsPcPklj0p/XU9nZS/OlpDNDybPPu92CkePsOVJz4a3R+9HE89PjvbRD57I2O9kx3yu7M9fz4xOzw9T3kRPu4+/ruLQzC+QMGiPYDlHz5WG1e98iwwvRRsuD2xQDA+ASHsPT2PujxubQY+LmWdvFMSGj4pNqI9JYTivBs59T1zkEC+nn7HujasV72P7yI8ATSXPcw9JLspk9Q9MyUHvhqkEj5aoC88FgcjvtYAmj1kzX698SArvu539TwCHiA+rrUwPkZ7gL0oWau9w528PQBSIb60Eok9ehV4vTpjITwSWhe+D848Pd/hD747u6M9NtkVPGk/Zj4goRi9D39qPNOz1L32LkA+XRnjPYgCNT5NBAg+8C5PPsWx9DyUbnG9DjIEvtPWPr4u3zI+IIaXvQjb7715AUE+Ydaava5QA75SbN49bgOFvaoGNj3URBG+tKwpvt58sjtUiCo9UmnXvVMyGr4PMWk9e8rRvaEtAj3kq7Q8P9PeOafoEDvUGGc99anlPY9O6L0O84m9adqhvI5Zs73VSzA94VolOxxvor2GQi088hYEvqhpF741zSK9PsSkPajEVT2kpc08WpdevdPZzb1sZGM+NDlDPjCD/L2MXDc93IgyPgWCP711c/M9y0grPl6Qsb1gQIO9gc6jvVQghz6PE+k89MvjPXlDRz32ucY9EWorvYn0/r3wDjy8IjirOm2jgT353Ec+8BMgPlnBxb2DmW89Hbw5vs5bQzywrxk9uqwNPk0yrb0ReSM+tWlUPokw3L1TqpK9iQZ0PhmAP76+5gS+POkCPivPw7uDync+bM1uu8LlOb4MKKA6YP7+Pd5enz7PIO68re+GPt4eaLwiW469gSOFvAbrKL1R2xE9oeU6PqYZIj7ygfI7wdRXPvhwPD6z2sy9db5EPcCBKDywiAW9ORTuPc6DHj7pPT07R+Xyva/BQTxcYNk7G4mRPbBxGD7Eux47L8Qnveoq9r0Gn3O+ls9jPcqbc726pus9AczZPVayZL3L/oe95wUSvmf7Tz46Vge9H0H+PAR0VT6p85M9vFASvo12Aj7aLBa+muhrvkn7Uz1f1Ke9C7dLPTLUYD5GIUc+j97lvUsuQr7+WnU9TwUuPbd8lL2ECeo7RngYvgxebb6dehi9W/ggvuk61j14HaQ+SuuCPd9Nar2Sy0k9lnIeu3w9xj31htq97bZXvvPzCL6vQxC+32JIPQPNZj6d0K49FnBavbzBSDo9EIs9ePw/PvsWXb5zo289MDH0PVUZhTwm6+u6A9qZvSBm9j1sXoK+eWyRPpt+6D2m0Xm9NR+DvdmaUT7B50y+Nb9xPRmdTD4VLnm+uO2kO2D8BTs2SNO8lO8Kviwp5j0R0jq7JWJ4vcW43b1XAmu+AMpIvt5dSz3tZM09gDKwPaxJ6z3G/K68k2Aovokv9LyLugS+KRx1vk9A2T0rx469lPkSPviCHTyua8k91lCavOSDMr0q4vG9422hvEEegL4rXAq+83ZYPY5bKD2eqIU7cFdDvUfW9r3POqy9IHoJvqR2Xj69SoO9wjd0PDqzPj4xCCq+ljqdPIarob1qlRI+RlxWvtcMEj3PQnC874oPPhACeT1XDoi94I+LvVK18L0I/Ai9IXcsPdkiqL6tIR6+RYaOPkMFNb69Otk9hzIhvEiVeD0GwLS9Rv/PPT9jIjy1+pk9b7eTO7XxrjybOdS9OKkKvQKDkj0S0ey881gRvjt4B70OoMy968sFvvb7eb4w5bY8vc2ZPHL9kj1Zs7e9sNm7umyqHz3Dys29Qz4UPhrDtLxntZo+5LfUPfFHpzsDL/k8RmTBPA1H5z3SlIO9f3UoPqzPmD0wgBU9MsCivMHU5DxVTQm8+njvPTAO2T1Lrzk+7w6cPaEzqD0Jgd08ZCh0vU3vkj2CfSS+Gk9pPQmmNz5xz9E9KMbbPbV4Oj3PGua84l64vfGalL7q9ga+v4FlvEpvtj3JjAu9FoUqvm1EEj4sBwo+erkVvQBjgT2/4LS9Z/biPb3VI73fr5Q8A6vmPUY3Mz0eOIg8Rqe9PQpBJz2lHT6+2daqukaUor0h4T6+LSsIvou4mb2R78u98w0dvpJTDD4uB5s8miQcvT7atL2h1w4+aED0vYfYLD4VUUC9wwQpvbIv673IWNA98VcKvtCXL75wveY9Bu3hvQxuSr6BrLQ9nbRqvqCRvrwu6XE9nakgPVZ54L0xwPI9eaFyvUslE757pw6+jXsCvgqMqrxxXwG+/6n7va7N573DiiO+mhgMPiSrAb7qT6c9KBHFvayP7b3eNhQ9Y1Irvt2G+b0WU/A9N4ZdvlyQDT7BdJi90JKlvdLO3T2m+be9hvhDvrHICr6/8po9FCs1Pa6XIL6IR/Q87kmcvS6GQL6qqCM930gTPufrb77aDo29smQavb13Kb5TSwk+By6RPU6UBL6lGbQ8ekAVPhuk8b3iRT8+MJgVvuh8PT2ROzg9VazmvcH4Cr15ZVO+6ui+vYbCCrqAPSo9w4WuvVhO3zxw3hm9xEApvkxOUr35Weo9SSi3PeODpb1an+E8L9YfPiGaxr3akyC+opNEPa00UbxXsko9RF9LvqcbUb6uNjG+HpMnvuQW3r2Naeq9L+hrvMEESD00BDy9c6bluwRNi71QvBk+AVFNvU0TJL4VnVs9Cf0KPexJQ7yT9Am+yHIMvjAkPT7+ZlG+ooBMPbpZgr3G/Jo9BPjQPYUvHT2GwNy8fqVePiZ/WDzgINK7hOy6vSf+Cj4sB3a+N1naPMT8sj3GWwi7bdOMPsUotb22+6S90GAJvvw/Hj5W1Gs9AgUvPqYutT0r9Bk7gV7uPSnCLD0MfIe9lJoIvR1FY718lgS+HU5ivdaZo706DUs+HmIrvpId5j3ZzBw+qZGQPSiTbL74nC6+34KCPX+IST5+dvk9iE6QvqWtAz2nwus9XZkevlclkb1ozNk9pbkOPoIIn71bYSC+d65bPm1GiD3ysyM+mqMKPS9wzL0OwSu+NT6NPQGyFTxmfYG9T3OevY5TJD7pXs49L8K3vWvvNb3cpTq+KO8SPoFdwb2DMUA+ELO2PYDrADwInWu8FK/SPYFT+T3+mmO9Izo6Pchj1T2QUMi8GNzfPUikIT1IzYW9ElAHPC0XCr5aIiS+Ev19vYyZB75YJYi9i4D0u0JBUrpnf1w+6Q8lPsAb27tlr7E97SXePalMi70kKiw617+5PflGAz6KX7Q91HmWvdMBnD2kWdG9hIIdvsf1I77pm+S9DCx4vP6Thz0Kd00+AaE3Pix61j18HPs9KEYWPQbo2D0Qne47s6ffvQgSv73kojy+al3DPZv39z2/sBa9Q2x7PsjFGT43oOm97qoePtHfAj772B4+LmiPvjy8DD4chAG+QmIbPjUoIT7n85c9EqBVPl7i8r1BHbW8ftGNPqb8ET7IXLs8q+UDPaiolTwUHpO9DkqevY/zNz0SXi4+paSFvTSSrTzHnxG+kpGRPfjR9b2DIWm+06UmvrdVbD7821Q+HlxpPr+UKTwmECM85cX5vb5AEr5qlmE9U5oXvSPRLD7bYkS+1RZrvrC/gj4K1SU+N69gvsaIBz5PE6U9reC3Pb6/cj5vBI6+1sAMPn/6Bz3EP3q9YOCEvb7cKb45AwS+jhgduxQGe755Hlw9aJFHPY5yHT6WPSE9RfOuvQbk+D2XFO68m01NO+2tTL19aAo+lcUBPb+Zqj24xEY+Ono9vrn5or55ONy90S7WvdZJnTvRCl892BjwvatmUr5rx949HBY7vjDWeb5301i+xhQAPj/jlL650jY+yDaRvb/79T0PNAK+McXqPDONN74RpJk9hpYMPkc+azpvO0s9dOU8PmINMDw9EhQ+MVy9vYMQhT0WgYW+17LrvTEhI72fPm49VMAiPpWKjr16aRA9iAKVvX9dPj4Uojy+S6UfvNzIq73FJlk9j867vswLAz2n4tM9q2pPPWxHxj2j5/O8tUGKvbNWXb4FQAa+T5A6vk+aD77BM9y9C0q+PSx3Sb7gizc9k52NvZ1Vhb2I5we97oLIO4qqgj7fnqU9R5uoPbe0tb2NhmA8GFgmPp3Fbj0iROQ9rEWLvZy4q73RyLO9i/CzPVSSLb4PxHA9nUWivUehPL53EBi+tp0GvjSjTT06avQ9+W78vUd8sryJEAY8KXWUPNOOSr6v0/G8WROtvb1Igb1KqJq9mVzHPV2d/D2c9h+9UvsiPG2NHr02iis9GW0BvmXS3b0L3y69Q85Dvk7idrzj8KI76wKxvCq9gD0BUOM9pkSyPeNO6Tw6DLo9sWxpPc1H1j028fm9GgGfvMICBj7JBCG9XmmdvX+ITb7DwUC+JqO9vTECU73v3/q9TbfmPcd2UD2UeCI9zHYpvqD6qz1LkPA9qu4hvvBfMD3of9M9bJcFvu0sDz5PETW+lnkYPBh3HT4W9y6+3lJDvvNIGD7yAok9xVl6vXsPTz1rG0U9MjNhvVptK71Tzfk9z8p2PfRHcjxVaEu9t4oavifQXL5zQsE9UOozPuHPNb1qiya9ysQGvDr54D2vL8q9AOmOPQNAhr3ykj89JH/APZmHi70ddES9WSQmvq+HWr0LrmC+PyRSvCOIHT2zS/28FePzPDtVRL7LUge+ZXnlvFnioD0yWT29EUVIPR1XzT3FiQE7KC1Qvb03ZT0YCNe8tmXnPXt9Cb7MLCE8Av4cveon0L3eYr69bJ4dvpJpOD4cCHG9+AfSvYCtArynPB4+1R9BPqxUQD0r+Bg+TbysPCVDNL6+oyC9yIdXPC83UDyguoG6WJ0mvlmvC70ixb09rRPlvegyXD4t5yU+YuIsPtkNtr2W+9q9mSXIPHvZTT4lmR8+RuF7Pm+mkr12oyg+FTDwvKgsQL5+w3g+R9sfPn2+Bz1zu/M99yWwvTgsJL6uNQw+v00YvUfk3j10Ozk9LiXFvVYc1z2a3lM+JyogPIXO/L3wTCU7cxovPYKNxb20+gS+76OMPQJNoT1EgnE+IrlyvZaXjL3QQp8+cz5jvSaLrb1QO/i9vXgwu9Smgb4+Zq06PmE7vGc9SD7tXZa9FOaVvSzXwz0IF6a9q7WIvWoQGb59llq9RidPvaxf2rtSlUA9pzqHPQdN/T2dEcs9bgQJvvtDIL7N5cg9S94lvvEoUTutiFm8VAoGPlehfj7o2kK981qEu29Ifz7z1zg9P4yGPKWdtb2NrEO+TYrIvb5l8z0/6HU+GczovJgMgz1Woqo9xjIpvU+m/D1qaxQ+UBVDPrDHDr1qcAS9fLA1Pk2FUT3uHxA9LCN2vfVWu7vTaWC97PRePntWZ75qfk6+UAyGPZ2P3bysUAE9SEgMPl5DGj5v/RC+nyjVvbswor30awy+UbhZPjbbS72Ty4C+h/zxPfsmUj7pz3C9junDO8GPw70QoUQ+lwVRPo9hg7yXZME9H47/vbZtoz3RunK9pzgRvtbbrD1P7wa+2LO+vYcRjr2KIY09HML5PdRiGD54eL49ZggKPrnxnz1AcwA90rklPtKFwb0VRzU+Djk0Po/0tbxF/Lu9Vi7zPeucG76W4Sa+3NO/PCnlGz6hPCw+2v0Tvqbk8zxS4eq7jF08vt3prb3f7a2911QfPkSaI74E7oM+ntQXPikyUj0bCZA9GmrevRTY873r16q923CFPF3Tpz1jiE+9hWmpPZJoPb4o6fA9Troovvbdpj3l0l08bGwrvt2mML4GeEU9wJIUvjXqEL581r09vDojPo3IrL05dug9yikHvtmTkz6n1Gw98S4kvoKaEz5QxWs9Pe52PvEqLL59Fg0+perAvdiqML3NPFa9Jcv4vemFjr2xfbC80KfaPHNctD0XAAO+DfJGvrRjTrw+bf29t2R8PmYwYz4SFpM8w+zYPchTZb0f+qK6cH8SvNVl4b1rawa+Kz9+vYctWj7RPWm9vxPMPKHCpbxGMRm9wYQBPgKS4z0lVn6941NAPuZoMT6Qq2w9z+QvPQUZUD4giLM9Vh/OPGzFLb6Vx9Y9A2kkvZa8ab2B5jM+aIIUvoI0Ir4zFqk8OLVevkgjkz3RgAy+hXd6vbjTFD339S4+WxRRPn4uAz0FdQi+YtEyPT7FHj2kHZ09"}}}}, {"name": "sequential/conv2d/Conv2D/ReadVariableOp", "op": "Identity", "input": ["sequential/conv2d/Conv2D/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d/Conv2D", "op": "Conv2D", "input": ["Func/PartitionedCall/output/_2", "sequential/conv2d/Conv2D/ReadVariableOp"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "sequential/conv2d/BiasAdd/ReadVariableOp/resource", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}, "tensorContent": "xwH2vJjR47wjUxi9FqexPPtnQr0nF668s0DQu2qug73wO+g8mH0QvPICXL0iyCa9KWiyvGX7prskLDC75yjfPBLfWT2GxMY6nCmYPNEKjbuteq+9s6ZouzYFD716yzi9IFpAPSGZq7uIOqA8ea44vHvSWzz7Ega91eKxvJJGdrvsN028HcH0PBK1xLxOgDy9dS0BPZv2ubzv6gi9f0vDPB+asL0YI2y9wnHUuyQlAr004b+48o24PNBNLrjesT69MfuEPAxsbjvQDQu8S995vJfHBr054RC7ojHYPIYVHzx7DfW86RPLvHaeLD3K9Tc8/qItvZQkprwElkU8Si1TPLyXOLzmDZO8cVX4PO+0K70EKpW8JIA9PMufhjxomLK9uMPsvHen0rw+y/4748BtO7sUmrztI1c9w4gJvRaS8jxWhkC8sdp4PaBnZ71Vie69ii6VvJ9mJL1FgRm9lKoHPZDPbrzz5re8BYMhvOiPHr16ELu6ZMETvSWGlTsj9AO99w6/uRVTRzx6vUW87u+Juwl+hLwYczW9LM+nvJQdOjsKJ/s8rq0hvFw5hruvDty8orGyO4+udrwMO9k8RLvcvJ1pab0UP0w9rkhwuyKD5jy6Rgm9bxo4u1veujz9T5q7L73gO7gqJb09WRS7HxEDPYbIuzzL+3K9g5vFPJPyUb0="}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d/BiasAdd/ReadVariableOp", "op": "Identity", "input": ["sequential/conv2d/BiasAdd/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d/BiasAdd", "op": "BiasAdd", "input": ["sequential/conv2d/Conv2D", "sequential/conv2d/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d/Relu", "op": "Relu", "input": ["sequential/conv2d/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d_1/Conv2D/ReadVariableOp/resource", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "16"}]}, "tensorContent": 