{"format": "graph-model", "modelTopology": {"node": [{"name": "x", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "16"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "step_size", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "angle", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "fire_rate", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {}}}}, {"name": "strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAwAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAABAAAAA=="}}}}, {"name": "strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AQAAAAEAAAABAAAAAQAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice", "op": "StridedSlice", "input": ["x", "strided_slice/stack", "strided_slice/stack_1", "strided_slice/stack_2"], "attr": {"end_mask": {"i": "7"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "7"}}}, {"name": "MaxPool2d", "op": "MaxPool", "input": ["strided_slice"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "3", "3", "1"]}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "Greater/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}, "floatVal": [0.1]}}}}, {"name": "Greater", "op": "Greater", "input": ["MaxPool2d", "Greater/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/PartitionedCall/input/_0", "op": "Identity", "input": ["x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/stack_1/values_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAAAAgD8AAAAAAAAAAAAAAAAAAAAA"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/PartitionedCall/input/_1", "op": "Identity", "input": ["angle"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Cos", "op": "Cos", "input": ["Func/PartitionedCall/input/_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAAAAAAAA+AACAvgAAAAAAAIA+AAAAvgAAAAAAAAA+"}}}}, {"name": "PartitionedCall/mul", "op": "Mul", "input": ["PartitionedCall/Cos", "PartitionedCall/mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Sin", "op": "Sin", "input": ["Func/PartitionedCall/input/_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_1/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAgL4AAAC+AAAAAAAAAAAAAAAAAAAAPgAAgD4AAAA+"}}}}, {"name": "PartitionedCall/mul_1", "op": "Mul", "input": ["PartitionedCall/Sin", "PartitionedCall/mul_1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/sub", "op": "Sub", "input": ["PartitionedCall/mul", "PartitionedCall/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_2/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAAAAAAAA+AACAvgAAAAAAAIA+AAAAvgAAAAAAAAA+"}}}}, {"name": "PartitionedCall/mul_2", "op": "Mul", "input": ["PartitionedCall/Sin", "PartitionedCall/mul_2/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_3/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAgL4AAAC+AAAAAAAAAAAAAAAAAAAAPgAAgD4AAAA+"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_3", "op": "Mul", "input": ["PartitionedCall/Cos", "PartitionedCall/mul_3/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add", "op": "AddV2", "input": ["PartitionedCall/mul_2", "PartitionedCall/mul_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/stack_1", "op": "Pack", "input": ["PartitionedCall/stack_1/values_0", "PartitionedCall/sub", "PartitionedCall/add"], "attr": {"T": {"type": "DT_FLOAT"}, "axis": {"i": "-1"}, "N": {"i": "3"}}}, {"name": "PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAA=="}}}}, {"name": "PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AQAAAAEAAAABAAAAAQAAAA=="}}}}, {"name": "PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["PartitionedCall/stack_1", "PartitionedCall/strided_slice/stack", "PartitionedCall/strided_slice/stack_1", "PartitionedCall/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "4"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "11"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "11"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Repeat/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [3]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/strided_slice", "PartitionedCall/Repeat/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/0", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/repeats", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [16]}}}}, {"name": "PartitionedCall/Repeat/Cast", "op": "Cast", "input": ["PartitionedCall/Repeat/repeats"], "attr": {"SrcT": {"type": "DT_INT32"}, "DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "PartitionedCall/Repeat/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}}}, {"name": "PartitionedCall/Repeat/Reshape", "op": "Reshape", "input": ["PartitionedCall/Repeat/Cast", "PartitionedCall/Repeat/Reshape/shape"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/4", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/Tile/multiples", "op": "Pack", "input": ["PartitionedCall/Repeat/Tile/multiples/0", "PartitionedCall/Repeat/Tile/multiples/1", "PartitionedCall/Repeat/Tile/multiples/2", "PartitionedCall/Repeat/Reshape", "PartitionedCall/Repeat/Tile/multiples/4"], "attr": {"axis": {"i": "0"}, "N": {"i": "5"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile", "op": "Tile", "input": ["PartitionedCall/Repeat/ExpandDims", "PartitionedCall/Repeat/Tile/multiples"], "attr": {"Tmultiples": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Repeat/Shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AwAAAAMAAAABAAAAAwAAAA=="}}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [0]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [2]}}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/strided_slice", "op": "StridedSlice", "input": ["PartitionedCall/Repeat/Shape", "PartitionedCall/Repeat/strided_slice/stack", "PartitionedCall/Repeat/strided_slice/stack_1", "PartitionedCall/Repeat/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [2]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [3]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_1", "op": "StridedSlice", "input": ["PartitionedCall/Repeat/Shape", "PartitionedCall/Repeat/strided_slice_1/stack", "PartitionedCall/Repeat/strided_slice_1/stack_1", "PartitionedCall/Repeat/strided_slice_1/stack_2"], "attr": {"begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "PartitionedCall/Repeat/mul", "op": "Mul", "input": ["PartitionedCall/Repeat/Reshape", "PartitionedCall/Repeat/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/concat/values_1", "op": "Pack", "input": ["PartitionedCall/Repeat/mul"], "attr": {"axis": {"i": "0"}, "N": {"i": "1"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [3]}}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [0]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/strided_slice_2", "op": "StridedSlice", "input": ["PartitionedCall/Repeat/Shape", "PartitionedCall/Repeat/strided_slice_2/stack", "PartitionedCall/Repeat/strided_slice_2/stack_1", "PartitionedCall/Repeat/strided_slice_2/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "1"}, "shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}}}, {"name": "PartitionedCall/Repeat/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [0]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/concat", "op": "ConcatV2", "input": ["PartitionedCall/Repeat/strided_slice", "PartitionedCall/Repeat/concat/values_1", "PartitionedCall/Repeat/strided_slice_2", "PartitionedCall/Repeat/concat/axis"], "attr": {"N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Reshape_1", "op": "Reshape", "input": ["PartitionedCall/Repeat/Tile", "PartitionedCall/Repeat/concat"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/depthwise", "op": "DepthwiseConv2dNative", "input": ["Func/PartitionedCall/input/_0", "PartitionedCall/Repeat/Reshape_1"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/Identity", "op": "Identity", "input": ["PartitionedCall/depthwise"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/PartitionedCall/output/_2", "op": "Identity", "input": ["PartitionedCall/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d/Conv2D/ReadVariableOp/resource", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "128"}]}, "tensorContent": "WmCAvV0x9zzLWK09uM6mvXGJ0D3zJau8MaicPe2dgbyzCku9C297vd60sj0w/6I9TfZFvJ5agD3FIsY8yZDSPEs2Z70Z7hE+vczfPHo1Gr01OSo9Xp8PvZwqw7yeNMg98LcrPRYaAz59fz2++bsWva6LOb4OMDy9qW44Om0Mhr2qQTy+DCb4O4XEkj3KySS+KegZPUMD/j11+Bw+3JgIvpT91b29xeo9kwKJvB2jrr1sAyw9koauPfU5Zr6Nm9U8NMaNPXm9jT1h2hs+mrUwvck/7z0zWMY99i0KPVK6Wb6+XCa+nkIFvnolJr3Jtyc8z06/PbVb4LxrmXe9P1aVvTNYMz7Jzoa91oLYvazhKr2gL7Y9/GSJPRZ/FjyLsqW9SU0FveFzkLxpVPG98kI4vlkfvj2RQhu9CKxavm+F7T25fSy+twzKvQXs8T3nI0C+DZf1PEgNO75Bip49ja1hvlzXvb1QMz6+eUvgvCu0IT5d0M66hx2jva/RdDsQTGS+AVVEvamj67yYmN29iMBHPZQwR74AJYK+y8cCPkp28L1n3cm9ODFIvqMBBT5T+NE8+ESIPcflv737b8W8VHBKvm8if72Fuh++O53uvYvuWL3IKP29iVL/PYTV47xFIcm9Ojn6vdcnur10NxC+Ov4Pvhyq2L3qQJ88WWwfvuu/5j2nT9892qHkPF5w4T2HnSs+jw5rPgh5A77fkg6+scV3PmPiRb0ktvg9qe0tvqovaj6kaKq9WDnUPdWewzwLzQA9bJ6dvWptmz2t74m+FqgVvvEiYT4klSC8i7m8vYFRNb3B5bK8RYwoPiTteLv5YQo+pos5PoqAAz42x+a9NwgdPgigHD6Zias84+Q0PQl9bLzLmb89RT6qvVW/+72i/1i9AYuaPtZaC705S4M+lGooPRX3RT4OI8O9ql/gvWfUFj3nmSC+Gz2TPTAjjr0BSsM89+JwPu0gJb6TaDS7n6fdvXUT9b0sMAQ9/FSSvXQ7GTzG04q8q8X7PYTARz51aF4+MFQQvm8DMj6M+gU84sUMvd0sBD6SYN48pkP/uyYE9z2K27s9tG0DPgmQtb1oCE6+jV+xvL9CCr7FDpw+nzATPvkWHj5s/Zy90ZkePktnBL4aLRO+R8LiPZUmDT715ww92nq8Pa6IpT0AVtw9e04ePpLCED6p5j8+uq54PVJrG774di++S6MjPYdz+bxjqOY8NhAFvuJzBr4QQBe+4eiTPtIwqL2LG1W+qDq6PaSQ+Dy5kjo7Aw9pPkCzMr4r9aY9NP8uPu7G9j2X3aI9pFkfvRQHOD42qyO+U2Cnvbal071JKGi+9jkAvv4RE755ENW9dJioPaQT+r0Sq649uuMxvirR0z3RgiM8KviHPQk61r2f23g90UnuvTf9eb5auGS+QyAQPZSDZT50mWE+lVJLPm57MbwsvE49IB41Pk7rIj6OZyU+6dvgvDsUFr7bT0w+VgqzPc2vbz0R9o28SyOuPcCOuDg9ZMW96YQbPkpydT1TKPi9TFoHvnTbXD7KPzi9mqTVvWWuRz68Jzi+puEKPRRGOT0IzLY92frbPKZTgL7Prho+KINBvr4LD75Isuq9XA4/vhGgxj3tP5I9Tzg4vp/xUb2DjPY9/mKEvAMwKD7yDW0+jJAqvrmuYL37AVe+P5pGvog+m73M10G+msCYvuyfLb7R39W9dFiPPD9Sl7svTEY9rl7PPe1E7j1I9xq++4+1PEcR3733LzQ+Td+7unNsJD40Bzw+/5hrPCHyHj5NpBo+RkrfPYCErb1X/lC+MPgKPNQsGLzFn+M84oI7vHjxkj2C5CG+UeVyvJbuub1iSay995xQvVECar10E8Q8k6gPvjM9DD5p8Pg9NZsXPk6o6DydgJw8Tj9cPujYD772wNY9Da0iPoDAbz1/Ajk+4CtivOB+QL1MfjU+gnlDPmKWY7www+M9nD7QPWOqG76sGy8+hdFFPLrfCj0X6TC92NmRveEQ7z1/yri9t8jFPd4FN70tUpA9bkcKvpLVrzxEHIi+uUMWPlnKmDypFBs+aGMevdFUsjwqhmM90OZ2PCxNf74Xlim+tF5mvTAoqr0VedI8RKCIO62WJz5NvSu+Xa7SPc+eRz1ukiq+Dj+XveJPB77MR8I9WWELvgukT76xAqE94SwEvvmxtTxU/HW9cMiAuT+HHT3S/yG+F6olvi88Er6iqBw99HdVvuNblL3PQpa+3frZvaxCej1vnjw9CjfWPOmhJz6xL8Q9NdIgvnbv0j3eXTS9SV+XPbj4Jj5Jvgk7Hja+PDgNC748xHU5NTQgvi3fmj0nSfw9Jywivp4pDD0GPQQ+NyzGPZ71Sr5Jd+k93eKtPSV5gjz92XE9l0/vPSegFr7Akx8+LVCJPDrUoD15tYk97G78vRVyq71tLuK9mY45vlh8qr1OrHi7PXLmPd9BwT26r0y+4oJgvkHBBL5XvyG98vtsPZLe4b1wRss8vjuHPmO/5L25nY+9/i0UvrmVhjxWwvU9D74/vrvfO76Vhjo9j3PzvXZj3LtjwcC9NTYTPivGlz0V5He8oW6wvVkD1D3Joag9vaK4PIh3EL63Pmq9n8h9vbR8+r2qn/U9++QmPawf1r1kV2++1qCavWUb5buyhEw97WVnvUb31L2fo4q9Ca8cPXRDx71wXem6TJj0vf/BGT4wE5w97QI3vadmGD4vWPQ9xZIGvsTI6zwXqXs93tXVvGNKKL1VGSK+OoCCPgeMlz0I2BE8obxMvfBSJ74Ageu3sv59uwpKFD0sile90tyAPaL+hD5FtO09YzbUPIWakb1mjlk+ENO1PZnAWj7UDzC+DrdOvBoHzz3AFOY9mbavvetdSD4T5Fw9BTVmve2Naz73jj4+lycZvYwNPL2KOho+MYauPUAk/70PbKY9UTKmPQkpKr0JChc9NgEXPvuXwL2dkY8+z2m4PUPE/jwR02o+gnmJvi5EGb3RfGc9kzCOvdNSCb6N+l4+/nyBPXB5W75BpPK7NxqRvIBACb4/pVI+C+KrO9VXKrsOUgs+dQgXPgUJRb6shVQ+pVe4PVjQQztft6G8mBAjvonNGD56UA6+5zC5PWw6sb01tDO9O/2yvfU6Db305489rkkyvMIbY74Vhkm+sE4jOc4PMr52x909x3XNPedXST5lNvu8QDpHvbqxWL1ebdK8U/OjPdCABj6m6pY9TtDuPc2dUL1oK5E9B4wyvd8K070fBCU8V+n9PZeyiT0ficO914KOPhWz3T1cygY9Vr4nviE4Nr45urI9ZJudPS4mEj4qrE6+cadYPp0ACz1PZtC9SFIzPpFSbr1ezKo9yAYTveQkujym9JA91AlZvqSO2LzMokE9T267PeFvabt/NH+9cFkOvvNE+T1dvOK9dWDKvdYW0b0DlDw9H77WPN/Awb1hLVs+D09hPtmrbT1DVBY9my/5vQi6SrzBpkS8zI2uPM69JT6IFeS9BbpYPoui0T318ro9yk5hPRkyAL4ry5u9qaHoPcBwR763LkU+eI88PvdbYr7hnLC8Qe0TvhsCVT7/NDc89nhRPg/vjj13A7c8whNcPh/oXTmARTg99VZsPIl3LD64tCY9/hFhvmiC7b3Uvn4+Xi89u8dNOr670HU+U4gHvvnBRzwdlsU9V7u8PEhxFj5H4d085dqcPdsPJr55my893GV2vZXZ4zwvGMK9cWMAPrQpTb7lHy2+dC2uvYuRIj5rB02+LkmIvs3pMj1kKBW9Xk+fvSQyJTx3vW29O4nEvVSBvT1k6Qc+XAkrPpRNPb0K2Ak+AmS4vfp4uLz7qCC+wFxAvu6RxDxpI5A9UVUbPifuND5XmvK9l/ZZvpmu0j14dxE+nemDviE+b75mPF0+H8cQvu7rRrywZDm+rRpWPo60VL77jj4+IU1/vPKvXr1wZEM+R6HGvLoFxDvyPQq9U92kPJDY8r1/FYE8vyyRPf5ugDwr6Q++JSByPqNGbD1DRbI9f+YvPnRR3j3XriY+OeXcvaqT1L3fSWa9y8cXvvNAFz6P2Ra+G/hYPXXuaj5cqhq9RUdOPWDau7zRPRA9sjiEPD4uXr1BYdq7/UBpPdtl9Lw0zXu+UxGjvWrbLr3sqwu+fZvavGYv+b2TN+a7XfVTva6/lTz8Uoo9gYjUPYmh/j1E8oc95BREPTl2Mb5ZWhg+OrqePejzUT1/c0O+PxRWPE2Y073tK489crowvolDGj0saPY9W0OXO2NMnz311Gs9jAD8Pe28VL4c4RI9qa1avcii3z14pCS+s8M7vnWw7L1N64Q9d0knPq3oJb6vHZy7B8EhPrLPbb6s/la99gZbPTxn/T3moCW9twQGPpCXvT3XC048Btl7vsUkUb4CmxM9slFaPsDeAj7f8VG+JHBXvfkj0j3jsh8+9UdLvmyhAL7SwDy+iH8SPEU/Nj4vkZY+EDNevsr5B76F6gW96deaPV3v3j2FZBo+K5PtPP3FeD2x4iA+GxoRPS+z670S4Yy9AE5ivk5o6L2yLfO9cle7PcnJSb19tR8+tTHDPXINcr7PLsS8PBEBPRHx5TrLQJ89g7U7Pm/Z2LygFic+oFZlvSjCa73t++29HuROPabB3r0hohk+DFWQvUFe9r1h35e9RivdvdKh2L1tfnq9xmQKPqMMID5mp9E8K/hBvjFwoLwnMJG93pPMPUQkwr1h/iE+ThUhPl2tzD2cSMa9F56lPU1GPzu6tp09jef9vQn0Ab7+OVY9NydkvXFdpz0wDTg+oDvZPVINMb5aDS6+UpWfPQqF073yV0s+FdpZPmc5z7w5tRY+n/M6PfXse77BiKe8+1C7vQf2GT5Pv2893X2EPXcIfz0SXHo9IuoAvrv/hj1sEaI9Rz5COlooFj5jZim+ivaTvSVQpL0nKwK+Q6VGPnSGqb1ONoc+pHgKPdd39b3eLYm9NpcwPqyNuTrmiOa9WF9iPv64Aj7kZhi+SHKfvbXXSz35jVY9QfYZvPx+Nj4g7NW8Sa5ZPtP7uzzSCIS8hvJRvkVSRj59KyS93LlsPdb13DwdLis+UwVBPiccVL4htqM81+z/PHWEnb33C8M93LOXPc9ojb0opOs9E3SIvVZZbDo1VP48smZFvOZYPj5if3E+CCdbPub2aT34wI29IerTvRM5mb0EBQQ9JpP/vCxAJb5yRRQ+Q6GrPUjn/LuphUC+S0J6O7B6Zb0yemQ8uuhoPSBPKz6oyfu9MxzcO/g4hbyFmre8mcWIPiKIjz0vc1S+WBqhPWvjGr59Vqs8580FvurGOD5OllE+EYaRPUzV7LwLXjG+vp5WPkskNb52Ddi9QrggvmM/uDzKUk69wGCKPCP5HD7Zqju+nb2HO7rG6r14s7686PPYva3GGL5ScB88GhlDPucEXL7lLlC+6P5CvkMZxT28IVa+vYCIPZzVyj2MOSW+BLulvLf9w70z7YE+m+8eu5xaSD5vHII9WDIgvryDdj212KQ9qhwJPrQtED4/FzE+Uko+vpqGhL4S4gQ+jJFTvJG0EL5c0go9EfCaPEYOpL0kFwA687viPTIQRT7kRF+9fjshvqSaHD0Ivho9EMOfvRbp9r0KxpY9iM0APkILXz6a2cC9gkaEPnxSWz57y7A9rv6vO2skJT5bJbW9UVtwPfY6hT0rfDC+A2QWvhEq8Dxa5BU+plQqPWZ3MT2W3Y4+f0wYvAVUfL54axm+553mve9yST5YKg0+qyRbvv8zgr7wIT29LWCQPre2Jr5E9pi93Xpovp4cDr4/lQi+loRTvEHnvjxXIo6+WxLSPTMXGz44grs9bjADvoHFMz3nI469Rcf4PUlnTb2BZhY8qpbZPUYybD0MiGE8/yLBvR4T9z2GY/Q9HckIvaHq2T2Nqhw+wLHePbinMT1xiTS+RXUvvnS2Dj6x09C9qX2PPSZDqL3AX9E8MwhNPZrqVjwQG2c7eqpOPqlv17vsCxE+aEfHPR6sAL7qk4m9/ZbAPXwt1j3RDes8cUGsPTQcGT1Faw09jUwjvl4ITT4HDta9XgXnPeNBwL2Jfv48T4AGvNnnRj4JhJK9AZuGPqoZX769Hnc9cH0yvqD9Br5R4R++kzQVvWij0T3fsyW+zCMNPm5jUL5jz0Y+N0tGvgGiHD5dyBi8xM+xPUzlJT7vxGi+As6FvWNBsL2/Hck7DKYDvraY4Lw5Y+69eG82vVNZJb6FIpQ9ppVSvdrEc73DNY29XcTnPRGJTb4aGRG+UpUOvfG1irvupBq+OSkPvMemZ70sPAe9trppvUyXCD3Ocaq9McBcPVI3hb01f+o8/LldvfvDPr4wGAE+8FcxPae1pz3mRE2+mxHSPdJPD7yH3U08Z6sSvRtXGL7dEHC+inWZvahBjz3tepY8T9MIvl0LWr1mXg+9K8qbvTCDAb5VXoi9zYnjPdmvD76A+f29Vw6xPSr6VbxqRSm+shlEvpATFj61jjO+WcjnvX9hb70dFOc6g2w7u1jrBD5TXi2+69YPvljW6T32oQk94cgcPdexgr1viSe+8hCTPViUBT7+g5c8KcBRPWGAZ7yWiBy9tKH6PApS3r2RMxg8WtQrPcrHxr0QjPS8tNoDvvJzlD2l0LA9oU2TvTkX4D0eLeq9crePuakCHT7qnhy+aRCAPdskRT2GneY9qeiwPbz+Kr61WBM9MB2/vX6MZL4Y+wG+STCePIemGz4owRc9TZsNvhE0Jb7Quba9EVoaPrRqMb7T0dA7QV2PPcCq3b0CViU9bxCPPYzXuD2SSia+iRfuOzH+sr17fBc96dzXvVXwSb7C7iE+ln0kvp6kkL19OCu+aLzgPYW3rr13Pdi9XyGEPfxq/zy9hbU9MBlcOq3qe72teSy8zit4vTUrUD0ibic+h9AiveeDQT4Y6oW9KR68vYdZ1j1c21g98ASSvdG1Yj6+zXe96/ooPmP0qrt4+a28728oPiCNCT5SkbG8g0dsPULuSj1Ye7y9tLYOPh/JUT4JLKs9w663vR9wAj4RO4q9lUMPvm42470zUSg98tENPfYj0T1e9AC+hfJnvVvHub1ttj0+XXIhPe4hcT7/81E+ioFAvuMeWD6OtwQ+IUthPWKWbj5lOg8+710Avk9LVTxbtw++Ee+lPOpBg71YaPU9UkUePGZeQr5A8U09s5MhvsCnRz6fjES5/+U+PXvZeD3yHxm9o0VePsFOE7y1JVi9nQqVPNzRAr40+O29k/LuvWg9nj08ShQ+edrVPb3BLL72Ola9ccPFvcPaB75tPZG9uDH8PSu1tb03aQo9o46rvAZNBL57b/+9YJGEveGsg720X029Lo/0PFx+Oz4ExYQ7HtkSPlX/+D0ba6S9jws3PuthJz7xeFw+KoWBvJ/URD6jJyY+oMQbvr70wb1tkvG7j/3HPB+J+L3W8r+9NRirPQONXj0gWcQ607ZgPiD6GL6U+hE+B9CevMZLeb7cPHS+2xxQvgibsj2W0Qe+fxWoPWIVeD3Bvyy+mgXwPahuNz5FSwK+Y0r9PUx7Mz635hU+tkoJvgR8XT1KvG4+NfWOPT/YFj52Bzg+i8KoPaz0IL7LykC8JsQUO57w5r2ZBZI978IkPkwLAD6iPQ4+bhLAvcliRj62jlU9e3ktPGl+Hb6YCfA9ywMHPhlMZb5k3Yq+m/g5PWxDyDsMb4W9SjunPsUePz5v5A4+5CCEvXgs2j0xcGE+aX6HvbBi0byQCza7z7KeO2pJBb4kcr88tKMGPil4+TyPXhA+KNEyvke3Czx5bSi92vaLvXRth70nDQc++dQAvv1CCb6qvy4+hGwqPR2tEb4BSUM9tdSCvUlY9Lzb/YG9CMRKPTUtkr3c91g+TgcWvrGEBb1XdVY9bDvnvRF1LD4yrM67X+AnPiLV3b2DK5M8psZ3Pdouaj0gjAU+12MHvvAN57wCARY+B1JfvSzHTT5V8v89QLKyPT+ryz1m7se94+usPCIUm71Buuc9ZEQXPn9XKj5TU0O9g0AXPk0Aab2O/Ky9AuWBPGq0iD1BUCa+m0oxvr56QT4Q5CW+/LsLPv5HET4fx0M+VpUyPlpEDz6slCE+cGotvibIjj0/rxw9uWPXPKk9j70RsIA9eeRwvF3M+z0skzE+nRP/vSzkAD0coPG94Vu/PXmLOz4WKhy+1uTcvHBXrb2rljq+2VlMPkd90T2GpTU9RfZIPeWSTD5czHm+eTU0PooZb70pyJU9yc5GvQZdRD1nRKQ9mIS7O67jDb25leg8NthFvT7RcL6f7WU84z6avOmhTLzzBAe8764DPmcaTr0L7h68RE/iO3M9kD1Vwgg+hqHIPequpr0CzSS+VzYgPvSwFT0ZMq091qLpPPuoTz17T8o8CbHIvI64Bj7/dZM8hlEfvftGgrwkVOI8qwYZPu2rEb72uOy9MdhXvjE4xz0M7uC8zRcbvJ+z270tLaW9RunrvGe+lL03dyK+sM2uPUn48b2Jlgw+44PovbIJ0jxyiQk+12ziPW9C5TzxoDi+JmCZvUeeOzwLuwk+SSOePQh++rw9lsy9wBhUPXk19bxr2/q9lNEBPFF5Jj0Kila9agIBOtJKAz4MvtO9LO/svG6Xc7tc7Ew9mdHPPfd8cz3WMCW+RrRsPRzoF76T37a9hp8YvQ67Er78S/M86/oDvl2yNT3KcoU8TYMVPp3lnbuj6Lq9EjJuPX8/Lr17wEq9za8MvvRY5r3lNHO+kcHwPTdmY73mtgs9VrX1vH3Yk73wXSq+xveCPSTjAD4S3Jy98JR9PWEHKT4AwTk8Pta2PUL7mL1SI3O809SYPAEdEb2eiMA9Zz45vlIWDry3XdY9YK1qOqPryb384bM9M0bsvTgz7j0bCAY+idWrvZii973YAIC9pc4EPn+u7LzDdgg+j/gZvtLHfbwLSfS9qfyvvmI0Dj3s58O9prFPvc0mm7x9JvQ9kNU7PgY5UL2aO14+8i+gvU7I573zXb+9RmQVPkrRkL2RCmQ9BEx+PPMFUj3DWhO+bHnkvBq5jL6luHK94dGGvVMSHj62GLu9x1lhvguU3z1n9rG9wyJPPY4/Gz7kmJA+kqzkPSmZATxhrd69/yaSvruUQz4AZd49uY79PFp20z3h1wS+7aN+PlPAHT5CW0U8ISzRvtXGNj4Jt50+loOWPr0N7T22D8k9svTgPYAWFT4U3DW+OVhbPpnhhT0k+hS+fucKva05HL43cgU+39u3vVxayLxWoFA+BsM9Pt8jOT6xWLS8IoErPtflZb07oCk+LRnrPVC4i77XtyM+AmpyPnLslbxau7S937EsPrYU/j3zMcA9QeiePN4VQT4gjyg86HscPtktkz2DwBo+yU6evQfTY74sGA++yOjXPo6pHr3Hcoc96DG6vWfZwz3/gDm9ooI/vSCCYr5CC4E9VmQyPibKzjywNUQ+owtqPcTmzD0L4rM9BP0ovjF88ryWgFe9qbCgvqqMuz2YQjG96oR5vJSTGz4fSJM91B5vvaILwj1G/F2+a+XqvPe9Ej2Gme09t2CAPby/Kj7+Yge+nkQdPWE9yr3MmXm9vc8lPsaEuD0J+x6+2ndAu9hQSj3xhQI+L4x+vu3yqz1CCLC9/QFpPkTOdL4f+9S7CDSbPaWNZ77gm5s9g5J0PrcvXLzXIDM81NakvQx2ED64GDq+OGMfvK9qJbw5gWs9rVs0Par5NT0tdlC+/6NsPeSZcbwEWg4+FuiCvPad/7tD3iI+nfvZvcgX0b03vmc+59cmPa4SYr4tlti9WHhMPTK45r35xhG+5nPjvdlqx7tx+li+HnaHPTG+t7zMQTu+4l+Wu57mYTxRSAC+a2ZJvRRZ37wDuwC+rOF6vdSHyDwlD6m8NQNPPjk9vz0SZZO9xl9QvklJVb5gBBK+Ns6xvVtE+D23mky9MJk7PoOXSL6Ho/k8zD1BvZw3ED2iTDc+9BgUvEbCmL68/0w9S9NBvaY03b3ioxy9woORPdbujTz7RzQ95cUpvmyMsLzoNr29u3WwPEUeCb46SHi8KIkEvqT30b2XfQs9dA8NPCdbEr60CN68Wa8oPmXRxL0RjoK9rs10PRiAXb63UCk+uH0pvgOQHT5Bol+90Ur/vey5Kj5bj4O9IaL1vaoxAT6adDW9rdKovQ4wc7w8k0U+m/pKPduE4T3hBXg8TMS+PTBwAD7+bbS9hcq7PbDiBz5TRIu9uEOyvYQUOj4HZ0e+pi7wvT2ZDb474FO+v9zrPeQDNT4ip+Q9A0xUvYyP9D2Vbmm9mTdVvdm65Tvz1FU++qwNPpCZIzzTLc09IWZ/PSXnhr2GJsC9B7EuvFkkIbwYedo9bs9Kvb/bZb3DaTU9YYDSPRhg/D0tT2E8pG4LvsUrMj7fJAe+JyOrvaQ+w73p66U9MnspPVHUR749vZO9T1P2vcn/XjzPuEK9y7LtPKYFJr7sqw0+x4rVPWN1szt4ntC9GBXivZhuFr7XqBc9DA4Rvo1m5TyGvww7UuZ7PbIKmj0eZbE89tOvPYa/1jzr6Y+9yj2qPU9gET68sd093mPZvavgZrwgiEa8gPsevkgJUr3UKCG+CNg2PbpmJT3o04Y8zlmQPb17GL5iIHa8vkcWvQYBy7xefSs96F7wPduSFL7Vu629iALTvfXgM74+4qc9c4rpuv4HT71LrFA+LGofvkGrsb37TC28k8YOvK03+73woUm+yTmVPawpTb1Mj2+9LdYSvgGerT0GAj4+b6DnPMkSIr70wvG9YdYKvmA7ij0R7aI9dDiUPTmH4r28N/A9pCIovrMJ1bxtud29Cnu3ve1fAD54wac9n2UWvpDRObzE1UY9UOSoPdhtLj2Mtv28kMa4PSoGyr2j1so98uTuvO6Lnj2wZZM9T5kZPRYIbD2h6n09IKISvSyL8D2OFK+8agyLOmjTMb37FuG9jkUvvPql+L2Lgk685MsiPQJuvj1A8Di9hLbfPfeGAr74NRy9R2aSvGWHQr6hGwS96WVivZDcur3n0Kg95R+TvBpXoT217zK+9ucjvslYjrx/Pf69KOpBPRs4Mb7gCiW+4WbuPXS4l77qmmc+IN/fvMglHz4EfzS9ecV2vU55E75iuDM9MqxfvHwf3LywlKO+9aa+vZHgrj1XLd47LYY0vqGFxzzv0Ya9yFn6vS+O7T3SILU8attIvkZ0376IFna+CgGlvUDGND7Z3wC+uE6Tvjaf5LxJkVk8XkTUvRpC+T2VjEi+zZDMvZiaBz6Vu4i+scj/vd67kTxEo4i+C68YPVD6ArxZiYs9L5WIvcfWAj7NLW6+BtHlvX/aAz3CXlc9F28OPiG/kb4DfIG+sU1BPonxIL50jiQ+M52dvSJuXD6BnC6+6Sj0vTZxjr5h9U4+swZ3vo2CaT1BViK+eo4Avb1IEL70QLk8bh5qPWZkib7gdX2+l7Y3u6YYLT6vtG09PMuHvRZm8T0CV6i+RUBNPFWqMT39atO9U577vQ7ODj62JQI+m0nAvdTh/L3g8z++Rt8bPuSH27z5G+K9PcIFvqr/i75886o9maW+Pe1LI77/xM05AYBbvq43Zj25NTG+SI4wvNgwaL6Y9+W+OaIdPPfRq7x4PZ6+heLOvd0lzbz6D6W+vbQvvdz5D75FTgK+vBgZPux2Ljx+iv85XqRTPASU7L0v4co88RrhPXaXh765b369Zi8kPh1Ehz4Cq5e7Vx9tvcINL73Y6uq94IX0veVzFj4x0w4+ouJ9vkv2BT5NqYG9Ymukvt3kGD4vVIG+xoQ4vk5mwT1MXKm9NXdEvCQ9VD40ZBi+mxOIvr6Jvb0qRdC9gwKNPRIwiD6Yv2A+LrmDvudm5z2RjlO+kotCvsf1oz7rP+28mYQAvRRfLz4uPEK+6I1PPiD7fz5ZG7C8keASvvgmtL0ZGHQ9xWjmvBofQb1g7zi+ZwLmPaHqQ73HjzC+26iavUlkyb0Pk0E+cokJPQmFO74oDYu9J605PXbXXb2H+re8hz7gPQ6h172tufk9N+e/vWqpubxchYS9Wj6kPai+Pz1MDzu+bs4NvKRaITzOYyI+ZpiDvLgrH70uC+C9QmLJPWe+bDzdJyU+hZslPi7HCj5VYyM86s8YPqCLU73s3w2+BZ9mPptrCj4SXUU+cdUyvgQ2hL5jymE+N3WNvNtqH7y6dwm6QrYaPZYQ8b3TmDW+q0bxPdE7v70Y2/e9ac87vjqokT3Gfa28uju4vXc5+D3r/eo9Y/8NPgIdgT69bek7l4tgvr8plz4UOIu+wReOvm4kKb4X0Fy8/LU/vYGYhr5ZwyE+Ok9evnUgsj3QDUi+a6SFvldaLr4MPUw9fdsWPgpwAL7SypW8AWsjvk6ftT1jMPG9OA1OvuApuj1Zr+i9nwUrvjhcL76JH+S9j/McvU67zj3ZHSi+o5YTPYfyBj32Ai0+nKm/vaqvgjrcRcy9RYyhPH04qz1q7zW9admJurFkIr6J0fI9WCzWvNBtFz3+fl89cOWkvUPSOb7Ymg8+8ZsNvkvlFT1ZpiI+g9bUvQC3WrhLM4q9h12uPVk5Bj0nOT2+6A0YvQ1yybthTKk91a/dvN2fhL0ENjq+evNhvrd3YbwnzHO8awVcvfSfuzxx2Fc98mmjPWMiEb5Tcr29Df/HPZ6Zhbu1Pg6+RX93vE8Cyr05MIG85UusvYYhxb3IOZI8HSBqvIdskz0Huh++Pa49vqeZtzxgR+i9ITpqPHHm6b2cjfG9GclVPK1/2j3BtHS9FxTovZ3YAr6hFD6+Or0FPUL7+7263Mq9y9FAvqY0FL14WAo+XdACvXMilDxggBu+XI3avOd65LzXTxS+2lvKPUutULztpJo9+fxRvgko5z2QY5E8LmtLvq1zCD7GXg26L+ZWu7swyj3gVfu92FeIvdgSyj0Gu2C+qDAMPd7W5z01vuA9i5DrPQWK1Lxt1FE9XWH1vcnUmb2s0ru9OUCvPXKAxj0Bcs+9qzoavl3+AT3v89s9CAt+vUWhmr30pyY+/BThvZ54J7zygqc9AfL+vfhzTr6+T8m7WA+zPZ0apr7wyFY9AzOwvXNCFjza/ai9Sr8jvQ7blT5YHMA96EuBvtyg8z0sEaW+wNEsvgasf70DVik+CKsTvszhD779ZEQ+u4QEvh1sOD5zzkQ+p5LMPfyYSb0Vl+69MhyGvYXIt72gEUe8n7LjvINvFL4RsmG+TDu4vJyI+j3V+ow9UQchPSwnRj7IhlC9rmXnPWhFjL60CUE+6OFqvdSNmr33GxI+z4hGvKvANDwmJ4A9hTQYvFSSDj6iCsy9IkuGvL7W+z28l588FTUdPeiSRz7XuE8+1r6MPTvwlD6QWQ8+MofhvE5gJj5RFdw9IuAWvvHoib35M06+tGqoPXGKmL7RvX++lC4CPDH7Jr2V2hK9hRB5vgnyCz3zvQC+heVavje/JD7m0B+9Fwc9vo0x072YZfm9qzOTPAaJ1705WMG830HMPXr1/LzwTYQ82fzkvSoFGj4407o90RRFvPvV0z3FvOM8VteQvjgNTT480Pc9yAbzveOe7Dw5Rg4+txbSPf0xoL0TrkM+Eic2vICpMz6YGh4+NVCJPk+LlL6QtDE+rheovWGMiL6XiSG+jX7wvbsS2L0LCTE+ysklPRuYBLzPPZm+aawBPum7mr6iRBm+eD8tvQ29or5PkFC+AG89PpAmBD4g4Bm9EYHRPWYEi74gevc7x6FiPYM4Qb0XZzg+m6KWPQUvqT5lH6c9lCS7PVbN8z0sgRg8rN1/PtIYkj62U7C8QKB6Pj/MCr4EJBa+J80yPvyclT2IRwa+9ahhPmawLb4BCCC68IaIPgJ01b1bOa29H/4oPmwAjD23rgE+GUG7PRC+GD1bFII+DZCXPBYClT6al3Q+OmGVvfQ2kT2ob2G9NDQ/vlS+hL11J1w+ycgLPuECYz6MaHW9BaApPmc+Hz6fey69+V1Qvm/bpL0lJwC+6ZBRvo4UyT31p+u9kKedvcwXfT3BGnU9cOObvfcQXz5pvQu+NS4FPhTuxb3Mcq09yZXcvUOG8j0PhQw8yIc0O38qo7yq0Ry+5Cs3vln96L09hNY9WY2gPWo0T74gTRi+2q35PVor2T0adT4+XWMRPlh4uj2VqHS9Y9W0OwEdMz5qyIw+z6SYvRu6Lb14WIa823RAPAgliT4BmSG+c8c/PgDEJb6SIIg+Z6KcvZSObT2R47A9PQJ6Pa90MjwcRhG9jtvOPFnRPb4OhVk+N4m1PTiXxrvjvQi+X7sRPkNXqD0LacI90LLavWBBBT2E57K9nyjrvRLeNr5mBNW9KAlGvuWKwz1sSCS+KlL+vZ8AF77K5ww+4a9+PMeBj76atQC+VYW+ve+A5r19UfS94QW1Pddjvj2kZyG+qFkgPjDGFLwtqRK9rOhDPsXN1j2/qd89rmYEvl4wuz20hiU82jR0veT+ML6Rajg+zXx2PZm1UT2HX+i95wgAPfZTi70D/++9PFf3vVShDT77CHu9fO9ePN+71TqE8AM9N9gEvvw/Bb4kAxQ+naNkPi/oQLzQMJe95FUuPkGjwr2f4jM94o32vQweVr2eMR0+gV9evbA3b73OV1Q9DkjmvX0xvD1QEmk96zqlOmTxFL75eGo9FWLHPNOwiz0Pri499xCAPSDKA74suIA92aAtvisu1Tw85LY8PPYXvqhMTj4aPMQ9ai4QvqCJ0ry1ZFU9usQkvuxXOL5X2Aq+X93wvXs5xb0tpna94O5Bvf6p2L3NTac9D7VGPZ4gFL7Lj7q8ZwRxvYt99T2KqUg+GXiePIWJYD2eOeC7rnZ2Pquh172Yr+A9P4ccvbu2tL0nAxS+nB0Nvi4ZkD2O8S0+rKsiPjz/xT1lrxY+fH1cPtFoGj7krgW+RBa4vWSM/TyFlrc9gF6vPMyy+r3Z3N49BcrjPXr9iL2f7tG9ONVfPUVCZT2Zu5g9qtDlva6Bz7vEFzu8cTo4PqBqwT0t7e285bHyPVQBID6F5R4+Kr4XPvx9rz3iUFC+DAIXPvUrtTw1KPw9WlHCPY5b/D1UZxW+WgjovRUycL3FIw2+4UciPmXvEb0oFNs8mOQEvpH6tr2geBW+WkN7O/AaUD5/3f+9Mlf2PfmtMTv8GqE9Ci8HvikRuT2Esas9ztI2vncdHzxP1Lo9pH/WvSklh71Jy6y76nkVvl+yEL6qKxI+tLzNPNGlNbw4vUM9ZKxru2aNu7w8YR2+yvGDveQj3jwnLx0+7MhOvQJgHD4HuQE9YACEva6plz1EUD27+2wcvkgzsL34aqg9w2cjvvp6vr1YW7o9iNaRvWRN2Dy5rbY9MQC+O+2qHr7nGz896t9xPVprQb6GVaA90fkrPTti0L0p70i+eBM/Ppde9rv59W8+F9JtvoMBrD4DpPM9YDjqPToZHz3ifZ+8zrrJOoZKxz3h6Qy+7c9VPbKP4L2pjPy9iusbPpZEMb6hYJS9VAPAPXRCWj1f1D0+NkDpPFzkoD7m8BM+/ioZPg5ssz1uoLw73OvUNwjukT3luAi+Fq9AvuXYi77y0H6+E7kePlfjJ76e9Lc8xiWLvmkeQT7tnHi8QNeTvLRWUT6CPwo9IH3JvZoMbb1NiQ08B8PNPC5+jL2VUTI9Sgc9PHLe6r2sxM08d44CPsKnTT49wIK9NWfnPcflwj4IVmg+Z8hbvv8wijw4KzA9dTkwvnKJrL3Rx+w9H3wmPRhxBb51wZM9bzNJvrwK/LwHFHE+BH8hvljjmb0r4mC9aVmcvYYReL3BWRC9vuPoPWydLL7/Vkc+jL/KPWjCOD0CxtG9a8dePovgMz6j+Ts+9XVwvHOzgz5eUro9irVtPqCQcj1FwgS+LoVVvemgP747Mz6+XN1pvXakQj5L9DK+8nUJPeo/hz4ITZi+54QRPjo0Cb04Qfa8XSsVvgshRr5PXI89ng9zvZDjRb0Z0C+8P3aVvtYB6j3W9oa+VdGHvgjnsj3Uvx8+RQrIPd9ZFb5ymOM99vkkPtJgcD4WFkY9RduBvB8vfL69vRq+ez5mPof2gj0QCxG+GvUeu87VAz7CNuQ9mi8/PiDy6D3GFDW96AdBPX6wmj7mo8Q9CzEcvQ0IOL1FNyg+0owvPsTOgjzGIR2+6PxcvUDsr77CO8A9aLVuPn0/jz0gEUe+zHwgvr7UEb6hdHU+nRH9PTj4S72pIbS8UEm8OwQpij6GvDG91J4ZvaS/sbxQsAa95+C4vWkCBb4eUhE+BI9ePpasHD7dhbU9yleOvQwGcb2dsqI90LkLPt6wfz2f12i+/P3jPa9u+zzpTVy9MNAmPnpjhT1+ICc+7DxVve/Xs72BtJ88JQJUvoqnGD6hbgg9OJhEu5Pt0z3aWEW9H9FPumDqlD7YEB29xwqTva6WFb7KshW9Rw3FPYilFj6Ekjm+mLbnvTHZ7D2ag+K361JYvqPGEL7VwQg+N8lGvkHjk71nMkU+4qsOvuKRCj0ssj+9X6mdvTgLzTz0+N08kA/MvCEF8z03mJy9NvbhPUVuWL59RAc+JkD7O8WZ0bwJFnk9lOsePqM+xb0rfhU+MSg3PvKjxDzlqcY9LrKsvb2HFT6krAi+6hraPWefBL6ps8U9RhcQvrQlvT3H32e9yDjfOC0Rnb1SQda9z9h+votOET5jvLQ9W7gkvl7VcD3srJu8sQbLPSAX27vDcw++W9BnvaL6FD4vWCY96qy+vEYKBT3KSti90txnPSWYLD4rUMO7aCkDPT2lpj3NiU6+1+YFvuz3GL3sKxO92wVcvWcmiL3fjzC+hBruPRfZtD2m14C9QdB1PCSQFr6jqQS+G6w1PSEdc71iQUC+RJ69O6CW3LtFJjg+4kF6vd7zXr5Bw6s9YxMuPvd4TL1gfoY9z68UvtaKBb6y5ca9XIkjPu0YNr6gKci9gglHveJnaz3EK1U9ShllPeDLIj6RjQM+t0exvT1hgTy+AwO+GC3QvVQTVL5CbRC+LK/MvRbG+b2Fp9u9VM1NPWvHPD09YQW9CZiyvCuRpT1VhyG+Z4CQvHCgPrx7MAm+J60xPCIf0zxkoAm+1cMYviPZyj01VCI+UYNJvSCcsryjJ4690v/EvUyiEz4rGpE9gP2tvdJ/lr3ocy++P+aYvPTgqzs1xJm9YjTBPSnFzD3xBz++w6QAOxeHV7yKsAk+ZLQ+vqMBvz1nlne+TXI0PcWMxz6Cgoy9um1evpSnAD6humg8Mhuava0wDD45yWG9P4UcvkxnDr5JFCc+5iQKvvwXnD6pQm4+cHOmPXwLOz44MAG+t36PvXTSD75+f889ElP1PUYEBr6/7JU8i22YO4Pul72xseE9iq+Hvr7Ior3QiN689MGGPXTnlb55VCU9YXJVPe/uBj7fJJ89S9kNvuvG873hd5S8SjJwvWd3abz9rfq9HoOivCXjc70paVu+tZYZvqzFAb4+zY49gGjAu1/EbT2nM+o8H7oBPlqZuT2ANb89+bwmPZhRADxeXf29gkUpPnqFCr67DhW9hvRJPmo4bT3Y0vY801pzPSZUuD1lldA8OYgWvsrUWLwTHlE6zr63vUfbzT2SqXw9c0IPPnhKd71OtKi82UXUvc+ur76VECG+4moCvroN8j3p0jg+02LsPKlmEr4uUU8+vmEtPTfAST5n0gY9UClfvjWHVTuxMoQ92M2RvVOVgrx669g9wyHmPSOoirzPQyw9CSE8PiTP5jwCfwK9a765PPDair6tWhC+htv/veuzKb6ctC89fMo0PgiMVL4QUry+XY19PuN6or7ssmw9TEDTu15cH74Okwe+Ng9wPUy1HL6uaGy+AH2Fvc34i76LQhc+eosgPmM+jr789hm9kTLbuyZc1z3hv0e8ZamDPsYLUL02qng9ZTyJPs9ggz7jFl2+OyTiu8Mz+D3f8di9rkkxvvIsp734lFk+u1sgvTvvBTwvUle+onssvHjgSb4Y1NC9GnylPXRWOD5KoDI+hU4NvUZVTb7z71s+9AidPVqXTT7VtLk+/E2BvlzyZD1yMKa+A3OYvazKIj0PaQg+9WpDO9vSNT6bRAC+azBiPUbAx7toN7q+IjJSPdgrmryFtC2+iHHFPRuS4z0dP069icolPkBGi77OD9I9ofbGPSSDBT6Peba8pScePmKxG74ehbU+MJpGvmwWJT7n9SA9CQJCvtN5gz5xrSW+6lVgPu0hZL4jDYy6wunTPBYo6b2No5W952nOvQszDb7NKx0+bhNDPgN2eL7OSIq+6usnvlBMgT1MWV8+gj7ZuwWtzz0ntwm+LWCePj1edD66EPW9Gh6tPngHsLxEwLU7PNTWPYZmCbuLpgY+4f7sOx1P3r3Wpmy+j4XjPZU6hb6ClHo7Kl/YPTkJdb2TvLI9byufPW/2kj7G5Iy+WYAPPiF07r3A9BC+yIZkPXB5ET1Dabw9mwBdPcDeUrzepAq+++devBFY57yzo469ASUmviJDpb1AYDK4W+QdPVhCYT1drda9hmIAvty+TDz6zze+jFxKPrvtrj2qN5s8sRIXPsQZk71ZX5Q9+RyBvVyLGb6zZBG7ta8HvkCppj1Ydis8Z+zcvZcPDbxT/qC9yOEmPac49Tw4Fxi9nFgdPl3Fib7lEY+9gODgPYVOhr0Olmy9RrjhPFxpTT2NSec85c6LvlVv3L3MyhQ9lxawu+gfgz0GMkO+TXndPIae7Lxgyb875buqPRcpbb2iywe+iRAZvkBEvbyl9ys9AYWnvHnjWT3ED2S+cborvh12Tr3H2MY9jyqUvVgrArkmaJk95FwBPDZG+T2gGwE+EjUxvcIe672kXcu8AdXOvZm+uT2F7zq+1Mgkvv+srj3yTQ69D4Xyvd5HhD2ev/88lcAqPeHTjj1zBQA+eus3vW9vQj5tpfY9rUqRPNyaTb761FI+g6DevP1vQT3q+Vy+WMHLPSFV173fSRQ+SkLNvdRgVTp4pE69s+vju1KI3b0itBq+TAUfPvkHGb0+lUO++ETPPX/LzjxULZc86S5nvgy5GT21vhu+fiIIvS5pez2ZR7w9EHZIPaN4ib3eruS9qVIzPXaxMr4eDw2+IiamvQ92LLy6Au67xuLLPdb7GT7cUfG9EcKlu2IGiD0680+84z6EvQlxoT21u0S9sWOPvUrvfL3TmPg9OCbqu0wOIj2dIj6+esQEvfc/n7383aa8rl4TPvmEyD0PpvA8e7W1u36JEb7Jt0g8DeA9Phzh7LwKRxY+HgABPhYpk7wZaw8+QWl6vRfpj72FsYg9ilI3PixurzxTR06+qmGaPeAAwz36vTo+TtorvjxyNb17d8S97crzve2fNz4YSIA+DWQKPXxilT4GwlC+kqSJvSaSh7s6AzI+rG5LPs8PjL55pyu+8yyXveql2DvMGUI+YLIEvvcg/z2xUwG+mH2rPe5iSb4We5g+IlW9PQM3gD47I5Q9svqrPSjfU72PKhK+kWwkPrb6nz77L9G8UqpYPZ94lb5Q0169FhryvSp8QL3jmYk+F6qdPpfbDz0cSSw+U/NQvfwlGT5aeJQ+QlclvlmbZT7gAim+LkEvvp715L1bDN29hHHAPYpw9j1d0hu+GJnovcf+HD5SF748mH7Fuz+v+j0r4RA9g2M0vsdXlb4Znx8+es43Pm0rJT6BfEW97ByAPsl2qTwQV8W9Pj8ZvrRiBz6kj9C8IbCLPTx+T74k4RY+BeuRvqfJHj7aSY890Z+BPr9K6b2jGYo+0jefPkGYgL0/1HM9f+vmvDYpqT2/9he9cGAVPucZF74blIm837QePg//O74Anxq9/EVPPomWp74R55S9DIfRu12u3z3TXwM89qGHPBGiGT6XeQu+yAHHPX53kTyMtVw92rx2Ph8kYbyTkUO+jg5HPj+I2L2ClLG9jeSOPfSyF77f+X4+9Br6PRiceT4AcxA9EsdpvEywF749wSI9y73fPMEOvD2EnPG9gMXUvXYem71DLTa+l4NWPtDi+L24oSu99MgSPllPcL7wec+9qysnPM5Kd762FjC9LqIHPtVyTT0Qqw0+mnZevAG7cD5Wd4I919W/vS+psb0T0Hc9CMGaPZo8gLwpvki+OMYJPsXPOj6vpGM+5hk+vjxUaj75soS9AzV2O2tWjL2Ik6++riHnPLG/I7y0vFw9OtORvjTOWD5AOkW98wgLPu1dEr44acY9Y963vTiMgr6N16m9enwjvue55b1pWGM+U1COvFRVwT1Icdq9v0TBPI6bUztFj+E8mXAJPvKDB729Brs87rnLvbjnEj4RQJQ9/aILviqu5Dwsmh298EpnPamsKj11nmw9W65kvX4PxT0kPP88CzCuPEeXlDw2Zw49rAGlPWd7tL3KcAI+hst6PtORT70N8XU+p2cPPor/+r2JKtw9cFVUvRe8ED6e0D297JQWPEbPvT3Obwc+bCsoPvqmbjt/Xl0+SErXPJEsUj7M0QE+faY1PH9/JL6i7NW9YqRlvOGvGDzNpwI++0+KPeZwA74kDx++6bh/PfgBLj3GfQG7OPMdvpdLO70Bi0K9dFMFPsr0JT4TXCY+f8UkPuZYq73FLIe+ZxEyPpgFgrxChwQ+5KZgPXb8Iz29X7o9hjLvPS4b2z2pGfA8M4fhPT7TL73FBtU9qcUdvlHGf7y1GgI+nm2gPfpiUjx/LBK9FnuFvdkWjbxzEqI9rIljvoFVwD3EhfW9vL9gPYRIcbx5Nae96cVFvhEOnD17E089P5BivVH61j3LbX89CEwIPh/DF77Hz/C9UGEIvu3j4Lt29zq9MMsLvj5eIr5sSYI9d80dPW1Ghru/VzS6C7mXPctylr20tfe8BkmnPWGzCb76tU09A6sfvhAPEL5DJCW9SdC1vdYE2T1PDwc+/+4LPcgeTr1u5C8+6sVUPdP+7L0we0y7L/k2PfeNhb22LwC+xIapPcl4Pr4lSEK+l1tpva9QTj28+QC8fOJqvTtR0j0qWyg+TA0EPnJol7wtJFq8K5rePbL9yLz4Lvq8cXTkPRmAVrtSrFY9hCrivccyhz3ZbdY9SftIPgZ48T2g50C7sZXEPVBtzr1NKLW93maaO23z+7wbYVk9UF8SvqPq0b1ZKAY+xzd+vbnv3j3a9hm+5QETvn0jv7xZvoO9Xon9PZk08b3Rdk09bNWfPcJOdzxUz+i9b8rTPTsJ7r2OUik9732KvZz0Er6zSay9s+mcvW40jr2nYwC+O0YfPew0Uz2tmCe+OC4Mvkg7A75FUrq8rofePcytXb7+/j49bbMovgSgJz0ijA89l8FsPswL7L3VhiY+8uz3PY6vhD2ZOqc9iL2VvLMNHD5pr0e+b+r7Pe5uWT4qxG49WqDIvN2YmLycUT+8cvsSvCLbJj5KeuY9YLJKvm91Cj2/nWG+Gu/TPa7pEz4QaXG+hVOpO68QEb65fQ49rykqPioJMr6s2CG+yEOZPDmacr5ziC8+cZYQPppCFD7QuBc8kJAIvZxfk717lEg+FIe8vCK61z11S/892oNNvqVJRz14KES+orHTvbXBIDzq8TI90J2DvBMkGj3/S/g9L8yrvn1dDzzZPkk+b2ZAviOnZr2H5wC8qT1vvkSgFD72DCE812ybPYLEg70bO8O7vNA2vgY2dL62qmE9SB0DvuboST7gsyi+7y4EvkZH6z1ykGw9mtpovh7yKb4qKFQ+OdrAvcMsEr5kyAY+jy3/Pd7Upb3LnCS+ULYFPbdJX76BzI+9anoXvQ+lGj4ZPAq9Y3spO2b5DzwEryc+qx7HPO4aM77mEk69ZWf2vcSfrT2C8RQ+di8dPZYa2r242Pk8ZDbUPY35lzyfxeE9MpeBPmdkqr7fGFE9dqE6vq/fYj09uzO+ll/JPf0mXTyx2GE9i15VPmyWOT6PNBu+9CalPdPFMD4Ky2K+00srvCPfV746oqO+1fc8PmtN0T2n4ne9DX39PapQgL2PMIw90dtmPlGhoL4hwAW998IzPnntDr3Yqh4+BCF1PgB+nr1GQNu7vLCMPnjDDj6klbq+ARYVvinpcb3kgwO935HsvSZ7Rr6N/2k+UnVgvQpqTL5Ipk09ApJ8Pqu1fL4bazo+o/3APb4N/z25qTg+o3x8vSfkAj0QNg0+Ed3zPeHhMD5Kwfc9IhLcvANEgD0HMaq8Lt0zvgP8sT3c4Eo+AAgLPr1iUr1CgUI9WYnAvFALBj66yrm+X8JPvsUCpj5lWrI8InqgvtJP4z3lqQy+icBSPhr7gb5Ulfq9l2e4vCqUIr7vyLq9dAFqPTINgb4kEFY+tqFBPgaSB74Gmlk+qrHvvY7toTyXtKk+VnBdPsEeD77PPa8+bC/cu2mpWj6jccO7Vjk0vHpZLT0No/o91ef4vFxdrrtqK66+adhgPrr9yT3ldkc+8edlvtDy9j2pday+ZS3xPRAqlT5E8489I2GnPjLH47oAya291GYBvTPEYjs9H7q9rFTsvTsL4z1V2Hm+qVFUvDI/+b1hUA6+M9lCvvAwXj4ThQa+YSoRPYmzKT6zRn++1LmBvs9s7LuhPh++Jwqivi2y27qlZrc9N5AfPp+UUb5U3zm+Yd9gPV1EDb6mlUY93r53vv/4PL58JoC+B0tcPuEuYzwzHG6+wI4YvvxZDDvCzca8/WpbPR6rxD2dpgY8lr4gPuh8k71r6+E9Sj/gPQnkJb1TdZy9gRvOval5GD4uxya9oidoPQkOAL5Utlm95vJvPbmj8zzCl+u9nDcSvu6zib71lbi9XuF2vDfT0LyKHQi++yy2vdFGpj3qR0W+8GHfvbVZJL6RpCm+t4h7Pb9BI76I4JE5DLqMu4ltDr75Xjs+UPOOPYz9mDzXdVQ9WAN3vbymcT0IyIO7dHKmvJ+nUbwu34g9ck6OvEpoT720LZa9GEYivXmRT74S1mI7c34tvlPCB751uSu7sxyGPXj38z1obJQ9c8K5PaGoZT3njPS8cm5OvJCzBL6T4tg97f5dvqT0ob0d+hu+2GXEvWY3Br5T27U9CqQkPVlsUD0upjm9+M+MPHkwNr0PjY+9mmmUPbMZgD2716u92+w4PsKwWL2A1gE9lbbhu9JoCL6gcyw9/7XBvUML+L1BwIu8DRLoPYSawj3/nOa9suVfPVHQzbwO49o9pLEuvo8eET7zma+9ctFuvq/yGr7GQS295zKMvczK8LseoDG+9tdRvkmonLzWroI9SYzKPcFRwT2jYcy8BY+tPWRHGz72+sa9WT6ovFib1j1vwRG+5QTAvS9pP75+whw92VvmPX6/dTwlGti9H66lu4fk5D1f5K+9g5GUvJ9ofL3qUZg83NAQvs2C8D2vjD2++peEvh7+gD0ujL09qXVQPhG5Ez7folU8H/uEvEjF1j1GkG69rRC3PKPWlj08QZQ92z14vsMm0b1i67O980uyvdgZWTsHXz89BMbrPddjFD6pJ3O+FyoEvuf5A73BzPy88QZcPrnAFT7rhTs90ef4PTrxfb1FIUI+FBP0PQaZ6b2ETC08UvN1Pm6uD77yBAw+gsf+vAue5D3DQzo+4DM4vpKAxLyLFKU9/ZH0vVZDUz6Of6s8+F4SvjlruD3jlDq+M774vf+3qj0aW9g8wLpDvWs/UL2Hz5I9blXhvcvSg739QS09y+WLPUUoML6hVMY7qWsTPpggaT7j/mc+TWlbPVxQqT2ynyY7TbsSPi5TZrqFTiW+TKgEvl1pCD29VQG+jGpMvVckczzL8g49MeZzvt7uWr7oDQS70JiKOysf2ryOVhm9E9wTPapvsLy4Spw7qLDnPXEGvL3153i9UqY4vmvKQ71UaOI9+a4BveXy5b1GYs89ahh+PT7XMj5B1Yk9l4IcPrK1Rr4Cxt49GdCcvQjymD3Hl+s9GI3sPXZEMb3Hwv89OdMHPawNAz0ArrC9zTyrPS+aXb5eW4s9DlZAPuICqDnIxkk9UqP9vEL51Ly95bW9+aCWvNQL3js8vQ4+uJ5UPg6cXD3n3rI8FLOEPfKJBT3mJDa9aKQDPrs3VL14FWg9iItXPmIzlb15Qfw94OCcPNDIyj4DuB4+hjoBPej2FT5P0gK+ZlmfvYITdD1f/Cm9L1kEPaolc75tESA+2YGdPDEw0z3/P4e95O0PPubdDL6PoNI9PO5PPqeyKD4Q0dg8CfdWPuMhR748bwA9J7hQPiFXAz7d5/s9rvgzvvlsh70pZxw+08/CvYiEYT78JQy+jFZuuwuGwL2iyxI+Mh9vvt3hFD6jCrs9IhYXvjuWbDx6teu9XaVxvGkbTz6Vx5E+gPQQvqDDa711jtS85x6nPJPaxLw6Yhu+fk/KvbDL4j3ttVq9HCR5Ps3fXL2EF/w907+EPdb+sT28Rr681D4pvi1tMj1W80a+5OKnPVMNFz5f0Vo+8voVvl//az1m9xY+exL8vQX0ez1pHAi+rQ1QvTcpUTxeXxe9Itwivni8QD2v8z6+ldWcPQO3rr3w9OW91Cc+PuZWEz0AqWk9YbzLuke2M72wylg+SQuUPfu40j1yPze+MH/Iu3VIFr02bRy92mA5PrmjdD375Yc+DM6JPa/gCj6k3Q4+r1JAvTAAWD0rTra9CxSru/77BL7EzYA+VEU+PcfTfz3RMhY+/aAAvnT7tD2gFzk6Njy6vR/3FT44k3o+7n7BvaW6ib1+ZOw5HdffvRLOsj3Ka6c9p23DvTWBpjsy6Ek8XdqAPnESTDpTQb+8k029PUPA+7xDwHW9IPFmvdyHpr2ZYMW9hW2ePU+58T1kIQ8+k6wfvhkkjz0Tr4+9KXPeu6m0FL6m1tS9hZrXO6UBlb2d7oi6FnvCPYKhFT7fSvw9td6TvcJx3L3w4Ya9onD1vZSwLj5M49E9+23XvQKZqr3c8+C9Y7TOPZasjz1pctY8WtHcvHy34jstvQU+cr5Svi41+TvZm9q9u1IsPhklvj3KhtS9cWNUPepaFjwS5/q9eEQTPtvKt73mVlS9tJ0+veg6e7xIH8S8MVQ/vjm1hj05iIy6m549PoIknbsCa269YaGUvU195r2bFhi+8UHEPSPlHj1mrWm9AL+/O/8Lcr0LIaa9wWZlvaJWNT5Fh/W9XyQ3PdrWaj12kak9UiMwvs5+3T2K+ec9oLpQPtu+/D0XPTM+mFGMO8Bbc71yghE9m1vAPXThgbzyA3E+4n/avYdwID6VfaE8VVmsvaj7jLzFBgS+q+D3veaPIbrcEUS9CngQPZ0BG71PW8K7CVYJvlqISj0vxwE+AFWBPenzQT5vTCc9qKwzPWIwVL2toiO+mY4XvsrEm72ih9E8WXK6vWQkZr3kuC09K0TwPDSu/L2NM9e9n0LiPYeQwL20gPM8a+QtvRonMr4SRAA+FLipPcHdZz0L11M9qQgAvu/46TrUKfO92nq7PftU/LyVNea8ZT1KPeit472PoYa+hw4yPraUUr4IzSu9xC2BPV2fgj7ZgAI++3SYvUiFHz5UKSe+EgGdvbo7hL1kFIa9DrGSvN47ALxOTqO95xwDvryz0D1IEES95VHTPb0puD3rk269AZ2FvWQJS7257+a9EV6KveBWFb2nl0U+w8KEPT3GGr7JUo09QYVyvp8eMD5lJle+yGA/vRLptr1LgZI+niKGvcS9hD4vFoI+C5mLvvpYGb6nYBw9Fvd9Psj7Rr3WBLc9gGEXPtBQdz14Qp89Pj78PLIHQr7nVQa+gBBTvp4GCT3Ykwy+kCYcvnDpNz4Jgj68g2B8PZi29r1Bkau9BmTFPbTngr1yYps+oN5BPhuoZ76pZdA9bhSEvYjRxru+gWA+7P5XvtZclz2beFS830oNvoYECj0/o2E+AVKoPXxJk72j6Jo9OEHavfZYAr5Vx5C+gKGwPccxFT4bXu885zs6vjuUu71aU9I7lhR5PY6bEL4iBLa97lBZvOysxL2Rv3U9JHQmvlMVgbz0yZ69Hme0PXTllr0QIze+4HEKvrLZFb4S5VY9I3p6vPWqsj7vZOo9DiUkvvti6r18q6y8bzTqvRz3E77mASq+jduKPEc7Tr1PUGG+FcAKPkTE8j07yn2+WfsvPoS8Cr5QYbc8OaIdvlRpQzzu3G+9H/iVPnibrL1ypVw+AlukvW+nRz6Baji+fOwyPr0AhL6UXhC+qgNzPiGUQr0nWM293bj6vcbDQD1Wm/m98LBYvv4DfL6HZPY9k24lvqQgiL0uyWC+gWu5PZjdPbqYWxy+UlhFvA+/Njw6QTA+q0i+vWY3Sb7yN3Y+TVs8vYD5gT25AT0+/Axgve9A2T3Yvqe9viaBvpEuhDtTZCm9thqXPcjWjDwISF++MPKjvQM3ET4hDac9XRthPUFfx73IYvK90dMjviS7kj3mCNM9L33MPM5Pvr2iEVc96A6gPZd8wD2u+UW91+fxvVcxJb7uP/M9mL9qPsuYib4rkMg97XtpvrR0r71Zb5U87xSXPaX3Xr4NuoI+6VwoPifwsz2hIhi+eIfmO4TAFL5wyhu+Z3zuPeONL75hi0a9LjAnvZ6cEL7d16w9hstrvuZKxj1t6jm+EdqaPiudgj4gjoQ9WdgXPqj72D2DqB8+6V5rvToUsb6TFR2+nNoKPcO5cj2kmpy+3zsQvctRhr5RHzO+60dOvsqyTr5cE5a+XVUovoxctj3nxoI9I9FBvkCZCr103kS+5SrKvNxv673TRxG+0TXHO1dfBL7mm1y+IB0IvhMDXrz2XQm9z+Sqvl8TgL7U2Re+mGeEPrM1n7yT3IQ9rANUvlWAgD4AmlK+IAnBvCLn3D0hAWQ+QzQyPlW2Wb3j76M90ElOvUIn2jzkcqg4kzw/PZp5jj22kI89LTCaOtQHhDzfXd+9flolPnlNNj5TxAi9y5lGPt5XST4vlny9Ga2NvJv3gj50Tk49WoIZPvJjZLt7PjS+W26ePeOzMT46GU+9keESvcIZxj1DKis+ONW6PThUUDwIFww+BCB3vGBj/T20l4s9DvWgvCNS+j0pIEa+gJiXN3jrVL2OK7s8D9WcPVNPCDyHOvg9Hg0JvuZxHT79h548Ehocvv+flT02IYO9lFctvi1OIT3g9is+Zi0yPvO6f71GhJ+9S1WnPXN2Ir7CT5Q9gadEvdg2tzyN4xa+evEsPUc0Gb73WaM9CXaBPLT+aD4pjcK8PnJHPG59ub3xik0+iST1PZ5vPD4k3OM9ot1gPoqy5Dy0G429zkH6vWKRRb5zqDE+J/aCvQVl1b18wUc+4oydvaAgCL7gO9s9vsNyvdd4Vz3k4By+l/EmvgqhXjoYsdo8fqHgveliGb48wkE9z5DOvS0tDD3e5yc9HOYBvHTWtbteJpY9sHTpPcmp6b2M+6S9NuLWvOWRyL0XXgg985VbOz+/mL1tjTE8Tdf6vWXMF76U5TC9T96tPcstSj2mziQ9ko2EvUgP2L3661w+8DJHPuaj9r3dq5o8e71CPpu3Or0IIPM9/wk8Pq0dq732F4a9SceavUPAiT7Qswk9kFTNPWSuiD1OEbE9fdgUvO1o/L2c6xW9ovG/u6rUoD27Ykw+o1oyPtlk1724mcM8I6IlvqebeTxDHFM9d+8YPteQe71GVB4+bShnPpGc171CM5W9WhBrPghuSr7WpAm+q4EJPruCT7yyx2w+2IAnvK/TOL7IF2C858wIPmk3pj7isBS9NAt+Pr7tAzzl+Iu9bGnZvK+AI70mzz48cxZLPvZdGz4lDRQ9YLddPm68Nj5af+u9ev1XPfzZnTx20N+7RTHzPR/8GD5Kp+y80CANvruspLq80WM7REFvPS9LFj5owcw4gM03vYQoDr5gyHy+FhVyPThpj736kAU+t0X4PfYan73mTI29du0gvpKhaz6jh0S9SUjGPLJ8UD7gNJI9cu8ivmN9uj0n+wG+8nR8vkt4Sz0WX8m9h+LPPOu4aj7nMGQ+1WarvdlVQL7gMRc97AUtPfBVS71t0628HYEpvn7ibL5YTjK92fE5vmeX5j1scKg+giVZPTP4Qb3aI4k9pAo8vAdAvz3BC5S9ky5Mvik9Fb54WfS9bMkrPcQhgT5+z509hzlEvZBhDjzWzGs9p0tDPpcrM76PuYU9WHLcPXevYjw29+I7GR5kvcyQAD6WLYO+eteOPqGA4T2A7ie9aJisvUmHVD6v+F6+D0ScPecqSz6afGu+vU8RvbdJVDtJ7uG8MjkTvj4w6D1F1/Y7y+QpvSLZ7L0HHWe+OpRCvirEaD1gNd49qKK0PTPz0D1XN1S9084RvlwROL2bBgm+FsJZvn0azz283YK9ZDMbPveNqLx0xL89juefvIOSsbxt8dm9yRyMvKG1hr4cYhm+0fSFPVBITz0/Uz68tPYSvaC8Dr4oFq+9L0YdvvwcYD4eXU29Vl6fPBzQTz5UcB6+iOWMPBIwsL0Ugg0+k6RbvuOgRTrfIwy8Kh4jPksjVD0Jkde9uhKYvXJoyr1cHRe9AkAbPexupb7jCiu+0MyNPoOsQL7sLro9OILnvKPdXj0yfbi9XdvWPaxjWT2kEpM9C6peu3CdeDxpktC9IyvavFLOiD2xJRu9fHP6va0VBb1D3dC9BlQHvkY9cb6HRbo8uIYCPc1ybj16XLO9SnWkukSxFj2vEqK90ScRPsVvybzZGqA+LstNPSnM+DmgKBg9cXxBPNR+/j3iynK9grknPq1HlD0Hexc9c8O2vDTdUD2kQ8y7Q7CSPTBEzz1IeEQ+27j6PbHbkj1+9NM8ITyNvejVnT27PxK+GBViPYO1KD6rEsA9H0LJPRcsgTyh1w68wm67vYdSlr6X8xK+TQCXvM3ywz0U2CK9yFc3vlAtFj507PQ9FGgavV1tpj2eQ1y9QuDmPZIZKb3m34M84oDgPW6WNz1Gw5Q8ALu8PZNoST38SE6++vNXO6s/pL0a5D++lIQJvvtzmb2kJdK9NU0vvh58CD7Z55g8CNkWvW49vb2aXAw+g1XxvYxPKT7EdSq9H0RIvcNF8r1Nis49l60NvvG6M750l/o9cL/JvQ8mUb5toMI9guptvuu8ortGxYM9KgMwPd+L4r3HyuY9kIJ3vZ2pDb6cRQ++xi7zvdjg17w9VQO+f4PqvQ1q8L2i9iW+lanxPU2qBL4Naa49KtbMvRZf771INhI9AVsovmsC770E7fA97Glevje1BD4BbX69XuaNvdvE8D1WhqW9sj9YviWoCr4xip09scMGPcqnKr7zutY8otp/vUp6RL5zFBk9HeQYPv5Ie77AtVy9R6T1vO/dK75H8Ag+BWSVPYYcCr60Ndo8wccUPoad/L2wET8+/bMcvjNvZT3KnT09gPHovXGfD71OX0++GCHpvfidNzy5Cl49rpupvSRxAz1KEhe9aDsrvmK+O72ogLE9Y9nAPRO2oL15pJQ85LIcPqp5x70GyC++b681PYbYlTvc4gs9pj5JvqIiTr6giCy+m78uvtGx9r0UaO29k4vNvBjIhD29rGa9D7Xju3/0h72HVh4+ZfKGvfqgIb7ADlU9cSqePJ54Fbw0JA2+H1AMviZdPT4uz0i+s0EmPfNIlr0z8Ek9nvS+Pa53FD3hx8e8ophgPjL8pzxaB468OZivvbwaID49f3O+Le/1PHTJzj1+/ee6KnaGPrFLsL1v95u9XokEvsLvMT5GLmY9ZC4TPi0s4j0H3807WMfpPf3+cj3EX4a9OxHYvLkJYr2D5QW+Jj5hveELlr1tFDQ+RL49voVYBz7hmAw+XihoPT0Rh77v0DW+ETmRPRvCRD7XedY9mGqYvmzrHT3IJAk+8bIUviSia70Vb8g9zv0dPkIQsb2lSy++zE9iPiGuiT0edyI+/itlPa5dwL3DoCG+6FDJPdd95zsBuuu7MU6NvUHNMj58COI9vQXBvWtHHL3qhi6+lrEEPoEl3L3OaDw+jQ/IPYck87s/lfQ5Ln7pPfg+oj0p92W9qJ1YPQChrD2I04K8Q/LTPUPSLT19VSS9iUwhPbOlG77U3y2+R8KivLQ6Ab5NoYi9DKB4vKQYo7tXtzs+bXMtPoeTpzzNL6Y9v8b4PZaFiL0ZKr87VQv0PZopDD57GeI9+YeDvRMnkz1x7fO9QIkqvlcuC75Khve9QngSPPoDpD0e41s+nj41PrAXtj0N0eQ9O0ZEPQBb0z1K4DE6kfzwvT2Vp73eQ0C+J1PcPchXBD7cjd28H86GPmizJz664wa+EI4rPmkACj5w3Rw+ooaYvqNyET4uhxu+F5saPl7zCT5NgmI9/Z9aPj4T/L2kUrm81p+KPmvoHD5lOAy8M1RJPIZAOTz0sb+9OH3Ove05Pj1snjA+lAyavenl2jyihQm+BWkKPVq68b3FA1y+TYskvhOUgz4vkDs+lwFgPqqP8bjEAIE8lCz3vU+UO75fIG49GnfmvNtwGT5sAz2+R1RqviKmkT5iICE+XMFBvsGUCz7AfZE9J8zSPRpOeD7THZi+tvQTPiJAzTtvg8C9sXiHvXhZD75hfei9WgEGvdDIcb4YCHI9FWA8PcbSGD6llzs9O6+xvbShBT5zlOi79dLyO/TsrL0X9AQ+x+oCPdTduT2BtXA+sggxvkJXsb5wv+y9udj1va5MuLujp109jQYEvhhxPb6SK+k9kUtKvhS1f75a91O++lYFPnvxoL4h/Eo+KsSKvTQKAD6vuf29KKE5PXwkNr5940c9cu8PPnMjG7uGJSs9iwVFPgTwXD3Kfgk+7WmwvS4qVz1z5IC+p8Pjvc0PBr1BtBc9TKEHPjA6ir3z91A9ysZ3vZxjDz5GVTa+kv1HvDBlb70+4BQ9snjZvoRuGj2C6sQ9wpXhPBmh1z16TpC8qof5vFAqUr5AdCS+mUwyvgKkEL7hfe+9zmu8Pfq5L76cjjM9bf0UvWZ8mb2OsFC9UXVxPKRrjz6CRqM9nmiuPfrNv71EDjI85uwXPiz8cz3K5eY9Y0GMvexYl72byrC9/oC6PcOWMb4k3H09h4eTvXsEP74MQhe+pKcIvirTKT1u7Ps9mhMLvh3iz7xXpUQ8Wd+bPPPKU75LNyS9myPOvT6Onb0mAq29CQDHPayh6j24Okm9CHwHO2XZU71whEU9KazRvSO0Dr4IEzO9Rf5Hvp2nkLy3IEY80LTbvJt8gj3JqL49paiqPVJr6TwTu749gvfsPHW1xz0wCfu9ZMQivGZ0Bz48STO9qnhqvXI6S754k0K+IP3OvVwVUL0gQP29mwHdPYNEJj0r8Ro9A5ghvt6Fpz0hKv09mGskvuIWFD1UFNM9WqgFvgjUET6FXii+YkW6uozuDT6LIya+5iU/voMmEz4gFag9KD+OvfSjPj34Y0w9L983vcCML71EpwE+og4ePXcYoDwhVVK9z60VvpLGWb5Im7495iYvPiJlX70RANO8uFl3vEoX0z1k7N69yj2HPdtJjb3xYV09vSm/PYK+kr25LiG9A2cmvue0Vr2eZl6+VK7HuwO/DD05x1O9GvsFPU6qQb5pZwi+vTYgverzlj0JqXO9ZAVNPSMBxT3Cul88Ygt9vURrVD3qnvG8a7zrPcZkBb6JsW07V5IbvT/T2r0V+6q9l20tvmnxOj6ZD3W9+DPUvTwq7DqM3RI+yrJBPhzP6TwRHQ8+fiGxPGrJQb6wJW29Xt+bPH24+jypk8O8YIo5viqeP71rZrA954LyvZYbVT5TBDU+WiAtPqveyb0wiuu9YaLkPKNPRj5KRRI+kyOOPpj8oL2Mpfg9sg4MvSgOS770bIo+cW8dPpqMNz3wBeg9wfzHve+wPL6zKQw+3+yjO9L29T3AGkQ9BXbVvdnn4D1XKlc+Ni1yO/zHAL452L86PU6IPR0k3b1TmxG+tgVcPXmIpz282Xk+ANOQveHydb1GBaw+TtK6vTjwx71KmAG+S7ipvDjhj766ECY8eAoGvCQjWj60pJ+9G36mvaOZwT3ayda93eovvbK0HL590ze9NL8/vSZcEr3C6hw9oI89PXO7ET4TKcw9rJYIvhB3KL6w/8s9eKUpvvL5wDxdXri8IpYGPnNHdD4cEd68ve81OySpgz7nCE09OUw3uyCTvr2MIje+pxmtvTjG7D0hT4Q+pOdIvbgFhT2N+aE9Lt07vReuAj4O8Rk+Cv8nPlL0Y70BsFO8Lk8/PoXdHz0E3Iq56P1/vR8wL7xB/AS93iprPibCcb4vGk2+bS7BPRqo5byLqP48ULIJPqsfKD5qwBa+e0HfvZ0Lpb25Wgy+bwVbPs1UVb3Q64e+9MkBPmKXXj6i1l29313hO9Zi4b0Gujg+YPR1PrDV7ry3HtY9YWTdvejopD0LglO9VOAAvsJVhT3LiP+9ZuhivWZWaL10VJg90j79Pe0FGj7kKtA9IBYOPsnrej0VA7A8anwjPp9Qyb2yUTw+0YZDPuLJw7wvcbK9qv/qPQOjJb7oKyO+apLYPOAFHD74LCo+Vk0kvlhOLz3O9Mk6aVVSvi9ovL0tV6K93E8wPlgQOL6jmIc+zvYjPhe+Tj2rxCE9dDzQvcP2FL5mQ7m9gSSEPEpWvD2H+wC9rZWHPUTqFb6Drt49ReQyvipHvz3vwRQ9ncIwvoQhOb6ZGSo9keQbvpF/FL4o+bo9/sgnPr19tb1jCQA+kgQBvtwFnj6v4mY9gPUfvtr8Hj41+JA9GIF1PsNCMr5Ki/49hnCrvTNVQb0vKSO9YRcDvl7nhL2u8ZC85mOBuioIvz3MYwG+lkxUvkkp4LxlNwu+dICAPvCXaT4wC/W72LrjPXuuZ71Xl487SbWku5H0273cNia+XbxLvdeqTT784q69g8eEPMDPw7yM+Ce906c/Pmpgyj1BIaG9XtY7Pm2PVD58+w49eSuQPAbtXz6OZJg9xKuSPeVzSr6N/dA99zT8vOntjb0PiD0+5EUYvvi6CL4r1WA7Jelrvhtcgj37Leq96dSJvU0LED0p+zM+EfJFPlF4BD2C0wi+du5BPbKW8TxF+sY9"}}}}, {"name": "sequential/conv2d/Conv2D/ReadVariableOp", "op": "Identity", "input": ["sequential/conv2d/Conv2D/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d/Conv2D", "op": "Conv2D", "input": ["Func/PartitionedCall/output/_2", "sequential/conv2d/Conv2D/ReadVariableOp"], "attr": {"explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d/BiasAdd/ReadVariableOp/resource", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}, "tensorContent": "ckQOvZ+YD727UTO9vxvwPAOoS72ND7m8/pcvvBY8Or2VnLw86Ww8vNFjgr3e2k69prDvvFYqSjxq8+S7bkF9PJO0gj1AKII6evEMPTcdi7x8E8e9FB7+u9PCC725y2G9fGyIPb2sDzucCp08Gg/QvDl9kTvqr868hd1bvN4eBzzAxaC8H1lKPVslDr0QkEa9JtsnPX6ew7yJIwe9REzrPMLDv70814m9AyZQvFGpGL346bk42x6WPJl9pruapE69q72cOwpV0DugSBe8q71cvFfDNr0Bh846RTaqPHyznTyJWLe82xDdvDBHJD3jcWk8BdVcvUXN37zxIGY8g7GmPNYAVbxJZqq8cU/JPFRnUL0WDKy8XexrPKqBlTsHYMa9VFcsvTBqAb3gmxA7zcNyPPuqkbzIFHA9saslvYVoBz2hg5S8ybWEPbislb3xsQS+rKOAvP9zPL3YCSq9Pee5PBEXoryu2N68yL2VvIWTOr12+qw628IOvQh/lrrVyeW8AR/EOv4+6zvssyO9BIr4O8y5Ury66oO9s4GAvAUaqztMkuE8H4OivJ2rmTxtHKi88wMIPEZTorwKyhI98BwTveJBkL2rLkE9OgYnOeRbuzy6Cjy98MIcO3aH7zy/rcO70A/cO5v/Rr28/xs801QfPWk5mjzIfai9rIMAPUyDh70="}}}}, {"name": "sequential/conv2d/BiasAdd/ReadVariableOp", "op": "Identity", "input": ["sequential/conv2d/BiasAdd/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d/BiasAdd", "op": "BiasAdd", "input": ["sequential/conv2d/Conv2D", "sequential/conv2d/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d/Relu", "op": "Relu", "input": ["sequential/conv2d/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d_1/Conv2D/ReadVariableOp/resource", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "16"}]}, "tensorContent": 