{"format": "graph-model", "modelTopology": {"node": [{"name": "x", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "16"}]}}}}, {"name": "fire_rate", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "step_size", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "angle", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {}}}}, {"name": "strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAwAAAA=="}}}}, {"name": "strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAABAAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AQAAAAEAAAABAAAAAQAAAA=="}}}}, {"name": "strided_slice", "op": "StridedSlice", "input": ["x", "strided_slice/stack", "strided_slice/stack_1", "strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "end_mask": {"i": "7"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "7"}}}, {"name": "MaxPool2d", "op": "MaxPool", "input": ["strided_slice"], "attr": {"padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "3", "3", "1"]}}}}, {"name": "Greater/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}, "floatVal": [0.1]}}}}, {"name": "Greater", "op": "Greater", "input": ["MaxPool2d", "Greater/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/PartitionedCall/input/_0", "op": "Identity", "input": ["x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/stack_1/values_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAAAAgD8AAAAAAAAAAAAAAAAAAAAA"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/PartitionedCall/input/_1", "op": "Identity", "input": ["angle"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Cos", "op": "Cos", "input": ["Func/PartitionedCall/input/_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAAAAAAAA+AACAvgAAAAAAAIA+AAAAvgAAAAAAAAA+"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul", "op": "Mul", "input": ["PartitionedCall/Cos", "PartitionedCall/mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Sin", "op": "Sin", "input": ["Func/PartitionedCall/input/_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_1/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAgL4AAAC+AAAAAAAAAAAAAAAAAAAAPgAAgD4AAAA+"}}}}, {"name": "PartitionedCall/mul_1", "op": "Mul", "input": ["PartitionedCall/Sin", "PartitionedCall/mul_1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/sub", "op": "Sub", "input": ["PartitionedCall/mul", "PartitionedCall/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_2/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAAAAAAAA+AACAvgAAAAAAAIA+AAAAvgAAAAAAAAA+"}}}}, {"name": "PartitionedCall/mul_2", "op": "Mul", "input": ["PartitionedCall/Sin", "PartitionedCall/mul_2/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_3/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAgL4AAAC+AAAAAAAAAAAAAAAAAAAAPgAAgD4AAAA+"}}}}, {"name": "PartitionedCall/mul_3", "op": "Mul", "input": ["PartitionedCall/Cos", "PartitionedCall/mul_3/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add", "op": "AddV2", "input": ["PartitionedCall/mul_2", "PartitionedCall/mul_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/stack_1", "op": "Pack", "input": ["PartitionedCall/stack_1/values_0", "PartitionedCall/sub", "PartitionedCall/add"], "attr": {"T": {"type": "DT_FLOAT"}, "axis": {"i": "-1"}, "N": {"i": "3"}}}, {"name": "PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAA=="}}}}, {"name": "PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AQAAAAEAAAABAAAAAQAAAA=="}}}}, {"name": "PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["PartitionedCall/stack_1", "PartitionedCall/strided_slice/stack", "PartitionedCall/strided_slice/stack_1", "PartitionedCall/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "4"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "begin_mask": {"i": "11"}, "end_mask": {"i": "11"}}}, {"name": "PartitionedCall/Repeat/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [3]}}}}, {"name": "PartitionedCall/Repeat/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/strided_slice", "PartitionedCall/Repeat/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/repeats", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [16]}}}}, {"name": "PartitionedCall/Repeat/Cast", "op": "Cast", "input": ["PartitionedCall/Repeat/repeats"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_INT32"}, "SrcT": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Reshape", "op": "Reshape", "input": ["PartitionedCall/Repeat/Cast", "PartitionedCall/Repeat/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples", "op": "Pack", "input": ["PartitionedCall/Repeat/Tile/multiples/0", "PartitionedCall/Repeat/Tile/multiples/1", "PartitionedCall/Repeat/Tile/multiples/2", "PartitionedCall/Repeat/Reshape", "PartitionedCall/Repeat/Tile/multiples/4"], "attr": {"axis": {"i": "0"}, "N": {"i": "5"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile", "op": "Tile", "input": ["PartitionedCall/Repeat/ExpandDims", "PartitionedCall/Repeat/Tile/multiples"], "attr": {"Tmultiples": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Repeat/Shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AwAAAAMAAAABAAAAAwAAAA=="}}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [0]}}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [2]}}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/strided_slice", "op": "StridedSlice", "input": ["PartitionedCall/Repeat/Shape", "PartitionedCall/Repeat/strided_slice/stack", "PartitionedCall/Repeat/strided_slice/stack_1", "PartitionedCall/Repeat/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "begin_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [2]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [3]}}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_1", "op": "StridedSlice", "input": ["PartitionedCall/Repeat/Shape", "PartitionedCall/Repeat/strided_slice_1/stack", "PartitionedCall/Repeat/strided_slice_1/stack_1", "PartitionedCall/Repeat/strided_slice_1/stack_2"], "attr": {"begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "PartitionedCall/Repeat/mul", "op": "Mul", "input": ["PartitionedCall/Repeat/Reshape", "PartitionedCall/Repeat/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/concat/values_1", "op": "Pack", "input": ["PartitionedCall/Repeat/mul"], "attr": {"N": {"i": "1"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [3]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [0]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2", "op": "StridedSlice", "input": ["PartitionedCall/Repeat/Shape", "PartitionedCall/Repeat/strided_slice_2/stack", "PartitionedCall/Repeat/strided_slice_2/stack_1", "PartitionedCall/Repeat/strided_slice_2/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "1"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [0]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/concat", "op": "ConcatV2", "input": ["PartitionedCall/Repeat/strided_slice", "PartitionedCall/Repeat/concat/values_1", "PartitionedCall/Repeat/strided_slice_2", "PartitionedCall/Repeat/concat/axis"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Reshape_1", "op": "Reshape", "input": ["PartitionedCall/Repeat/Tile", "PartitionedCall/Repeat/concat"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/depthwise", "op": "DepthwiseConv2dNative", "input": ["Func/PartitionedCall/input/_0", "PartitionedCall/Repeat/Reshape_1"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}}}, {"name": "PartitionedCall/Identity", "op": "Identity", "input": ["PartitionedCall/depthwise"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/PartitionedCall/output/_2", "op": "Identity", "input": ["PartitionedCall/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d/Conv2D/ReadVariableOp/resource", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "128"}]}, "tensorContent": "tP+IvQ7g6Txdy7c9+6uqvfy2xz0uy7i8LqOhPbqKKb2HlWG9SbRsvezotT2QnbM9WoJovBssfD3hAs88S2kBPY+vgL0dMBI+b0ybPOt2KL1u2EM9JasHvfMktLyw58I9mvP+PMUW/j1pNEO+D+sFvYTLPb4G/0y9iwBhOuUbl729MFe+AHwruwj9kz3S+yS+g04xPXIT/z3ZBhk+1WsIvuHLyr1HzPc9fB2hvPzFwb1N+kQ956+xPdzaab4LPOY8tNWYPaLNgj1QrR8+bIJOvYNh9z2+xcg9ZZgIPfExWr4voym+NRoSvkT/Kb1TT3M8qe3WPUwEq7yh6m69bXWkvVkGLj7GtYe90aPjvbMyB70I/LU9F0aYPXsc3zv5g5m92VT1vMwkjbwofOa934FDvkQwvT36ZRC9rxJbvizs5D16cS2+zuHGvSnw7z3LDz++OEPpPGzkOb72DJg9CG5kvq+fub32Aki+P4zHvINRJj7zi6u78Be3vfKoqjuTsG6+Ki0jvW+PCr1fhcW9BkFePVqcTb4HKoG+ZwQKPnwA7r2fX9O9m6JFvqFQBz5jkew848SJPRgTvr12EO+861FNvgLpib3vZSO+6Hn5vdXXZr16Kfa96O/+PXeW1LyDYM69ZEcDvkA/tr2vHRe+/hwXvrqw1b39o5E8yFgkviu66T08Kb89HdAAPRO9+z3ePSs+mbV3PvbiBL6Wxwy+Yu+OPuGaS71dTAA+CG8jvoyzbT4nX8y9BxPLPU9kvzxHLyc9tIjGvfgOmT17ZYy+yOwNvqKVWz77k3a7u9q6vbPEJr3Z7Sy9AyIiPrXrvbovDxA+l/Q1PsmnAD59MZ+9E7AcPsPDJD70kYU8UTUuPWn0i7zwjuY9nVW0vYpWA74oAXC9VHe2PjbOubyqhIg+0rsJPf7XPz5T/ta9Ly7Qvd+J2zx24xi+NbuAPRgckr0sREc8CmNwPtRmP75Z0K27OBjyvdoBFb4Mlh496LKsva9QDLziY+M6gw0MPrKTWD6B62I+2cwVvtfoJz5fBEo7LlltO6YTFj6BBTI9uYc2vCiR5j0pT7c9Pp4YPtYTs71hTEK+4PLOvAh+KL6wOJg+CHcBPi4cGz7Di7W9+YYYPq5p/729PiW+9HYTPrBZCD540EM9opS7PS0ypT1dEQg+JGYsPjypID4WQ0Y+fq5nPaE/GL6L4iu+Xrf7PKAYBL1XtQo9oPHyvb4LCL5yXR2+aliTPiGpr72GMU2+Q4eXPS2dzTwLV5Y7ldhqPkpiPb6LIbg9CjcjPno/xz09/6k9SyNbvcgkLz7WQSS+7fKmvX6k472sume+0pYIvoUdI77etsK96p2MPUO5970avLE9wJY8voAvAz4Hp/k71ImpPSnw8b0bIFM9JH/xvYPuer6um32+Fl0uPfbNcD6Z428+uXJSPpAYIrwDhGs9XSA5PgoHJT4ORBg+yL1RvdXrDL4YP1A+BFW0PV7XYj2H5M+8DLeOPbRARjv4Tce9/ukfPk4ukz2nauy9lOENvux4Rj6/ZxS9TrPHvbNmSj64NUC+zNQTPcCfeD06p9I9/DGlPNu2hL5Pciw+aD0uvso9+L1O9dy9qMlAvnW6hD3DoaM953M3vvoEPr24kdo9kpkovGTkIT6Rr10+DekwvgnrT71Ajk++2xA8vpqUnr2pCT6+Lj+mvuJlMr7gsOC9zIkGPZr2mjv1Sks9ALHIPfYO9j3B+B6+UlYHPa2A+726MSE+iBMYvAcmIz4d7lA+iMBKPMoOJz4cmyM+Y8e0PS+w6b2Ib0++kBsePaeO5rxNw/88HJ/ZvIUEOz1IIw++3/VXvEjvgb2aeZ+9XuRlveMacr0kd/s8ebUDvlf/ED69J/Q9MIoTPhA1uzx/0Po7qIBrPgOkAL6Kt9s9RCsfPhhEoDtZVD0+9KnaOz4oLr1mYFI+7D0/Pr70wjplo+Q9yM+2Pd0oFb60UjA+yXSAvPQGOj2MPGe9reSYvRK15T0tiam9yMOVPbQHUL2G/Yg9SG02vkyN0zwmVoe+uI0WProZejxoBxE+B4M3vR0grzxKIXs9PiN4PElggr6UOTC+PSNevReX3r3jCbU8628KPKNKKj63OyO+dffXPTieRj0NsSy+6dKKvYR9Dr6R+sM9FgwWvsN0Ur4TPq89KyQAvvdRxjzpGoW9DDlHvECTDj3CZCK+VYkhvnT+GL6JSxU9gFBPvruenr0QwqW+v6Dovf9VUT2gLTo9MP4BPc+KKD6wLLY9+mUhvtn38T3jpiK9lLWWPSjmHD46YOQ7Qea1PFzZDL7huRk7SkodvjSjmT2dU/49aCwrvh5kFj2OzQU+gqnEPVYpSr5xiuM9AFqkPdbKczwP9GI9vjIBPsanEb439SA+I961Oz2ZlD3BkYU9DC4Dviv5mL0QL9+9/UU7vjdQsL1dB0O6XSDrPXHxyj2rlEy+ffNvvqSHAr5m8yW9xruEPfNe871Tpck86XGPPhQw5r0qGZG9ObUXvjRKxTwwZu89EO1AvvOEOL6Gehc9tULsvVmgDLuVZMa95eUNPva2lD04Y568dM+gvYtz2T1BKr49P9wFPWA7FL4ZV2G9uOKCvWbB970SEvE9P1FOPYJK171WgG6+pCCWvfeDmrsOpDU99Ktsve2r4r3SjJu9vhsNPXSE0b2WyiU7Hkv1vdWMHj5G+p89WFhCvQ27GT54yPk9DWoOvgiW6zwjIWw9+Av5vOXcIr3GsS++NJaCPvqVrD1tU6g7H8EVvf8pLL4vAMk7nmwzPBxeED1swDG9oz2YPdYUhD4sK8s9gtacPOruj72dPGE+8KuPPdvkVT5svTO+TiwYvD0Ysj0TXAA+0BabvTFQSz5g0P88ziV6vTWbaj7s2EM+h3ItvWPghb3wNUQ+otiwPe/j6b3sHKQ9UT6yPZ42L70W9G49ad0VPj+lzb3AqI0+d2z9PQcjMz1e+3o+0AuOvj3AQr3Rfzo9CcmDvcydFb4VdmY+kfZVPbg7Zb6hH8C8VIZ/vMEgH76uf1Y+QGGwu6Hd4rzlsxE+BwITPtzFab43f14+BCDIPVHvpTybP2e80TAsvkTPDT7TUBG+4gABPsKYjr1NOxW9E5CrvdGCGL1EoJA9bP4hPELZar7osDq+IgO9uY3sRr7E8a89ncS3PTDaTD6lAbG89jdlveGWQ73S3Qi9HVTHPZpUAT5v47I99p7sPUzPg72w08E9lDQrvblav72Tzak88ar2Pe7WmT3b6r+9iCiLPmbX1T1oFh89YoYavlHIN77HS6s9bWCuPQ0wGT4ScE6+SugxPsrZqzxncda9qjMzPrY/iL0kmL89imY7vZscczyJDaE9DoV3vr4QFr2GaU899NS/PWimi7zFG2e9grIUvrP95z1T0M69sIr7vedFzL3CskA93L+GPKysk72qUFs+bW1qPoBtij3ckvc8s7YHvrfpVrx4ZRO9s/rHPOhLKT7ZK7m9GSNePsYj1j12OL494pBbPTVPAL61J6e93n7EPSDfPL6eJUY+3m5CPqTTab66TWC9VXMjvpJSXj5KmlE8M5FfPnRzpj0Aw8g8ARBlPofvDryDp2c9CFIJPBvCKj5CjaU7vPpYvnxKzr3LC4Y+TUwUvN7VRr6RdI8+SGfjvSVJmzzqSt495MKJPEd7BD4fVfs8AayhPW0tLL7ybeo8hpUyvUjVjTx2d+O9uFLyPeloTL426iS+VJqevXBCIj6Yile+AauQvgdSQz0X08i8je+TvQ9VDjxta6S9FS/Zva+sxz2khwE+Xgo4PvTiiL1c3uc97dPMvYnI1rxSphm+Ty1Ovich1Tw0p6E9KPkJPj32JD4rswO+RatBvuUviT0mdBg+tsmQvlz3jL6M94s+dQESvqDMojwU3zG+aX5XPhaKZL7GW1Y+vnUmu/d6Qb1Guzw+fKjtvKJgoTtcKxG9P38IPSFF7b04m4I8wAmKPb50krzluRS+d0l1PmlggD0uIAk+XF45PmZQET5VOS0+ouzovaFzy72WxW+9cPs0vgFUGD6T5gS+Bt9PPYQoaj7EDrq8faD8POvBF72bOQc9cAwCvVpqT71J3xA8M31YPYBus7yPCYm+YDy0vWLOOL1cLwa+Nw7qvPb8AL7Yshi8wrxXvZp6hbxVnXY9Dr3mPZ+O+z3hx5Q9IARCPQYRM766+Bk+wa2rPdI2Pj0t4ki+cUc6PH3E3L1YMpc92Vgwvnt6Gz1blu89DClzuyLGmj0OVl09J0QAPjpxYL73sgw9MZsUvbb50z1oP0e+enBRvnOw6709voY9SrYtPqWvKL4hqY+7nxIjPp4VaL7+Ukm9C5Y+PcYA6z1oEBG9ZTILPjlhvz2QsDM8uMV/vpnyXr4cyiE9FqJYPoMkCD6bjFC+Cc9svZ4Y2z33LBw+T/9RvgIL/72+UUK+yg5iPDMSRD70AaA+I1Z0vo0RD77vs/28S/WNPeQx8z3Uix0+0qUMPR+cdz20Kic+6ZIWPb9z3L1Gc4i9jHltvt0U5r3sN+u9igLJPYazbL2igxw+/9nRPVS8d74D/7q8k6sAPb7FuTsALpU9qvw+Pr/YyLw7gB8+f/BfvWSiWL2+Jwe+psgxPTqz7b1HtRg+TqKCvUj/Br6B83+91sDhvY9a4r2+1HC9Zh0RPiBUID6/+rU8OoRDvj6KpbwjEIS9WjrTPSjgwr17XCI+WyAgPpR5wT1P59e9x8CmPR1iEry7R5099Fb8vTVuAb7+XVk99qRnvf96qT0YXz8+KzXPPQn2Or4q4DK+m7WUPWGV170qWjs+JkNaPvS7jryVyBA+pzmWPWp9f77tgT284tKkva3dGT6dLko90Kq8PVZaiz1KECU9bzIavgglhj3psqk9xGbVu93+Fj6AXC6+lJqTvQuvob288Ou9KflUPr9Fm71j4X8+B98APb0j7r1lBIy9KucoPq7PkbvJR5O92EFgPheL/z2WvCC+lQOpvf71gj0uL3w9LJqhvM8UNj6NfhS9dcJ/PmTFBD2/iIS8lqVQviG1Oz6aFEO90Ml7PRmLozxT3S0+BlU7Pm21UL4ud4U8lAATPVc6yr0EL8U9CJhyPRbMvL3DmPQ9ql+FvQ+Cz7xdvzw9dl58uwanRT4dPHI+3UpKPptaRz2R9pO9paqKvbM1bL3lZwc9SWQfvZKDKb6jPw4+kQe+PfQYM7wGVzC+q2qcuWYMzb1eEKw61LMjPRsyHj6CGBO+u9H4O649i7zWKBC9ru6QPiPYeT2XQEW+GImrPfGIGL7Uth09tojtverbTD4uzFc+f3RvPep4pLyZujC+hIRePpleO77QRcq9C2UNvkNdsTwoTVi9D0mQPDnNID5FXDO+1MeevH4v5r2hNiW85evMvX36F75/BLE8m8JAPtVFUb4O6ki+LKY/vstGqD35P1S+CFaMPSJNtD3sDCm+AAaHvGepyL0gWok+5zzzuwy6Sz7NPoY97VQovivSqD1bWJo9ZZMRPoCsJz6sCSI++0dFviJehb5LxQo+cS0xu+6vDL7POg09N+PcPJNNrL3BSz47pxr5PfDYRj4q52y9DBQlvlZdKT1lpCw9vp+vvUdABb6LJUk95bftPQvSbD4RsdO9qE6FPjv7Yz5AR709z82ZPN6OCj7T4JW91OCQPXq6hz3NRFe+PrMfvrFhKD1NDSQ+OfYUPf52KD0Ucps+hWYaPOpkeb70OhS+V276vdUWOT6C/As+gBFdvu6dhL7CpXa9VQuUPrFCOb5W3KG9EHpwvv1HDb6VUwO+T9Lnu6CVtDzvtpe+xAnGPcyjJT6h0cQ92R4Evun6PT1g48y9BfTqPZDjQL0Gixi85kDtPZ9JCT2G0e67nrzOvbOw8z3u3AI+AIpEvVnQ8j1UuiM+ycTVPbIa1TzkrTq+ZskYvmo79j1JUtK9vXiCPS0I+L0/K4M9f8lZPcQ47TxMTTc8HGBXPuRTjLwm3R4+LgDVPd/v771v/Iy9cbSoPXH43z35XrU831bLPYCsNz1KgaQ8L+slvuavFT5v+vC9hvLdPdPi3b2eUos93mFSPAY1XT5nQIK9BP2APlD8W75D6V49lz5MvvgwAr6BqAW+CpYfvSiAzz2kXRi+d3TbPdHrVb69AUM+QtdjviNDIz7bfiu7HDquPTCPMz4nJYK+FHmNvY3isr0UQiw8VM4EvsA1Cr1NXfu9na8tvT/ZPr6B6Yw9WTRRvS1Ebb1UG4S92QPnPZ2gUb6GNxS+HCXevBffPryjOxy+GQKOvEm9dr2KfOG8MqNavRb6Dj1bBbW932ExPUgXkr1bQNw8EaxCvSOyQ76X2QA+rd06Pdm1nT2JfFe+/tK9PUaCHry3FVA8RBP4vOjDGb7kTHe+MUmZvX1kpT2EkME8PmQLvoGReL1Skva8N4OdvVBnA778doS96a3xPf1oFb485v695RamPZ9DPLwn+yi+SuBHvvkOGz5WxDi+z7UAvo/xdr37Lag7qIKHO9qWCz4fBDS+WgIdvsro2z3/cwA97kcDPY5rc71UACi+A5GbPW+HBD7+/NM8T2hdPRBONbzTDTu9WcfuPPE7470OhjE8ins6PQoB2b1QCfK8/ZL/veGLkj3T+Lc9kR2WvbUU5j2X4/K9AFIzu1zVHz7CwiG+EwWKPTUHVT26keE9wnqhPbXKLL6Qsdc84JSrvX6ca77MsOq99X7bPKL8GD5WEyE9pukPvi6GJL5NtMC9UGskPoIcM76H+Mg77QGSPbHT2r3WyA09sDSOPQ24rj18Zi2+Z4hUOqnyvr0ZdCc95VTevS1YSL7u4CE+8u4xvq3Bjb38IC2+U0DRPeCCr70Xsd+91vJ7PYE9Cj0eP5s9W3S+unBaR71sZwG9sGsfvct4VT0mCCc+H+spvAKROj5hY4C9ewiYvc5W1j0g0Bo9g6GWvbM9Zz5Hq0i9MNMUPkTXG7x7jPC88+0wPrGN7D1oGT68w7CaPTAJYT3jXeq92D4IPi0fVD7IJcI9E/bAvS0v9D2/eu+8vRcOvjey3r2jlxo9EZFHPVpd0z3d4969PdFnvabGu71Q2Tc+ZDSuPfeWfz6tIlo+8wBEvtwoUT7YW+098paCPaQFZD6/dRo+DnsFvil01DtGlRy+pU3cPC9yub3bOOw9uKpKO86HX77m8HU9ZawqvvvvMT68RV883NFdPXkxrz03li69y5JgPusBnbxLl2e9DS5NPVKp3r0TZ9a9nwvrvcbbmj3zcxM+Mo0GPruEK756gzC9BkjIvQxyI74KX6a9Qd3fPZK+wL1gBBw9USXGvMbKA74v1hG+TyhYvRgcjL3sJwu96ynoPDFyND5uxCc9FhoiPuKlCD4EzpC97V0wPqSRLT6fFWE+NGM0vFN1Pz4LNyk+vpcRviT/xL0ps9u8KgPCPFNZAb4s0Ka9MApWPUfUVT2cUPM7NSBkPrpyJr7+lh0+R4TZvMZ7h74SK3C+tqlqvp5/oj2FQgS+iSalPSBZQT3NaSi+TzTmPWC0MD4XC/y9oyvdPW+MNT6oBhY+rDALvuGQnj06tmg+zcKnPQsSCj7iKS4+g6+kPY/PIr4V4vi84YUQPEj92L12pqg96UMoPvO0Cj7CYBM+z1S4vabAST770TE9k4wrvHuVF74+rfo9Mun9PXqaab6J/ZK+qHz7PO7CWTzxyoW9qimqPqw4Tj6a5ho+BZJnvf8ooz231mw+NjWJvZlEr7zHBHq8w+ilOsc25713QhY9XPn+Pb+94Tx+3SA+x8EcvpMGrDwghwa9yYSSveT3u72Mkw0+cyQAvhYjAr6D3iI+W5Y9PX3zIL5YVRY9hoqSvYwK5bxu9Fm9IQhvPVmak72p4Vk+1Ukuvoj3Gb1LmXo92tO4vblAPT65YA+8ghggPh4yzb1Thmc7eEaWPSvmJD2k4909yhIPvhNk2rxMBSY+/ZeFvViDSj7kVAo+24SjPfuslD3AH769KEtPPWIUoL11DfA9oIQKPviwBD7NLNC82S8bPkt99ryuu5696GdBPJFbjT15ZBK+vr4lvqPQSz4goiS+OIQCPoMgCz7FdUA+bK5EPiRgFj49Px8+FG8wvplAnDx53Bs9qXP9PHHJXL2MbMw9DyQlvAhXEz6nmDQ+tWoHvnASFD3Tqva9DeeDPUz+QT5lKBm++CT1vCeGsr2QpjK+kAA4Pn7xxT1sVyE98u+pO1gzTj6J53S+Q0YyPnWWSb2TdYw9+DBfvbN5Sz1BGa49h2+GO/1aBL1js/w8Ins5vZaKfr5K6Ag8BskEvUP81bz0vSi8sD8APuyxkb3/B0i88G0/PB8tjz1ceQY+IYi7PW8cor23uSy+AcMkPhAL/jyeMKw9f0UYPcx5bj29Pqs8vxzfvC0WCz4j3oo8GbSMvGZLIbsfegI9G8YkPhJ6Fr7K2sa9xkpWvqxlzD3ZjOW8rNxFvCI8z70OVcO91YfAvLDlnb1Wkx++eC+0PaG6/L0huAg+0b3lve5Vmjy35As+finhPRwA+jxT0zG+SHZ2vcJlyzplfAU+aDSfPQB9y7wWqeG9trFOPQrONr2TV+29aLXoO8TiGz1BfVe97GZwu/SuAj4zgtq98vX2vCYkx7qki0E9cVnIPU+UVT0cpRK+z9WLPd9XD77oKqu9FbFRvTZzCL7RDfM8aXMOvsGmUT1vHYc8SWoTPmDp67qZs769gYR5PZQrMr1fdVW98IYCvtTR3r2AhYG+e2jwPYkjob1zwNw8oGbhvEOIib0bfTC+zICHPeuJAz4YrJm92JqIPUG/Ij711I87pQWtPek0pr2nnai8zxedPEecCb3RN809nzQ4vsX/BLyVUtE9U3wbPNn11L3eu689gbb6vW+z1D3ijQA+k0KDvZ1WCL67rXG901MHPonSK70OHQ0+77YZvmGK9rwtx/u9DduzvrjJBz26ysW9ufRSvY9OrbsivO495ZcqPhskg70j2lw+0O/dvbqgo727fEO9nysnPj1NV70G4S89oxCFPPJbOD0hdAS+ic+4vF7uh76qSmS9CDG2vR2NCz5WAKO9QvJgvvUC9z30/Jm9WjCDPUckJj6JsYY+U5zbPbrLxTyy6fu9U4azvrLcXT4J7uk9jcAbPcTfsD23TRG+KHOCPhtfMj6xr7m7OkfQvvg3VD4paaM+rtSaPvuB7z2llOM9Q8MDPmrnGT7LKzu+KsSCPirdpD26VgC+4snDvEjmFr5LAgk+CK/DvYTjSbxUHV0+9KJTPiwjQT6W8lK87hs6PmZFYr3TIis+2RvxPdppnr7MqCQ+k9V1PgCRCr0GX7K9Im4ZPlZz8j0fRaI9+PKKPBv7ST6RwHA9uMwkPpd2zT0QQwQ+Ky2AvYeEg75sEAm+tjjiPuBPB713eZE91xGevQLc2D2tZM+93qsCvYUxYL7FFys8LepEPjxyMT2Kp0U+W/3FPekX3z331l49dtoWvmmiBL2nmsm8Qm6pvtN6qj3W7Sm9GXpvPKBLID5anao9DvuAvZ8twD3b4F2+k8cOvUdtKj26etk9hgu+PU4yLT71FxS+HYMsPdfefb2cpIm9psApPkImrj1fqTW+R4eiO6HiUj3Muf09yEWCvl/toj3PFLi9Ki1aPuxGdb5qZk+8Tu63PRkaY76heHU9tfRsPhOXy7zbl2a822TDvaXMHT7swEm+XwH6u7xLKLzixUs9XhIyPR/iMz3pRVO+By1GPcTpAbz8zgc+sRVBPB3ZL7zuahU+RYfTvamJ571vYHI+U49hPUVHhr62sPe9LlaCPYvo1L3gOia+A4LevQTnyLuS31y+amhVPdqjobzt7Em+M36rO93fQDyhp/69pKQqvVCKHr0l/QS+NKNtvQHIKT0v5Bc7nClDPpM+yz2ln0S9K2BHvuoLSL6I/u69SPG8vVBN/j0lE4C9281FPkP6WL50QQ09w1jwvP01Lz3Zu0g+9PHJO5Zsm74Tyg0954BjvSkZzb3SdQ29VY+OPXc6sjxwPYA9+q4Svg/lwrxkx7+9aigPPe+wHL7NeR48nh/NvUFPkb0Lorw8YSBIPBTMGL5tt5q8xHAsPmrQ072u7oi99GKTPdE5S74YcyY+TaQVvhxiGT6JVwy98yUDvutUKT7QCo29ed8qvtnGwz3ycG29C2mqvbVR4bzDADo+jkL8PMqG2D3OERk8qJSlPfk08j3XubG9s0a3PccdED641aG9GCCHvaosPT62q0q+Gh/evRFmB776fmi+uCIMPqAcOD5YBeU9fPycvW8c7j1lvou9MQEpvbVgwDrjpVQ+BrgePgjqBzx9ytg9EbZPPYr9lb0aGa+9FMEKvOF86Lwtcr49XFlyvdrKVL0k5Ck9oyHZPQdh4j0Qi0k8j8wXvslwLD4A9wO+/mSxvXnL2r15Zo898wrwPNuhPr7GCXO9L4b4vRzd0zrVs2S9P0LoPMysHL54dBY+W+rePQq2jTy1R8S9mxMTvmP0CL7M0g89o30NvqmPEj1JiGM8NQOJPSjxlT17vQI9D+W1PR/4Cj2UqZC9X6KZPTlgDT5ZgNc9z2PKvZADxrsDGWW8+fwgvivdYL27jyW+BYtMPYt4Gj3Fcpw8JIZ3PR8lEL6bCJQ7GSnQvDl6q7wKT+Q8gOnUPUH3Eb4y7au9vJzYvb9/Q74oMp09kpSmujv+Zr3JxVY+QSYevoBzzr31dke83wgLPPFO/72Eo0m+YbOHPbEIS72oDlK923kLvh6YlT1a3Ek+NZsyPdfEKL7rX+m94G4XvoM3lD2PQJA95OWJPUO7371nD9g9aagwvlp9A73ZL/q9qQnWveyM+j1HwbM9mOIGvtRFZrz+NE899FmcPYwQIz1Tbsq83JXFPXuHwL0ej9g92sPkvPPRqz0EsIo9HP4MPeNJZD13tX098R8rvXWd9T3SyKO86DCCO0RWRb3ZXNu9IqWevMuCC777QfM6jY9APQOeuj2142S9AFTPPR0TAb5jOw69jgjevC40Kb68SAu9zLCyvY6koL0mDKE9I04OvEzNlD0mBkS+BrYhvv72L72jhQu+N/JZPZcVNL4cQiO+wCT7PT69kL7661U+AjC/vBQCBj4rhVu9hpaTvecoDL6jGVA9hgkxvCSUG73EHa2+6LGNvb690T0zQti8uh0ovlNxGz21I5m9AUD8vQae4j3zPkY98/dbvjNJ675KuG2+l1+mvV6lMj76lRS+HqGTvslI6bxwD0c8eyG8vSbN7D3aez2+3buhve4HED7q0oq+0PDyvZmR47t+qo6+K+xKPJ4W9LyKk2c9MoKZvUsiGD7YvpO+aCLWvYSQ5jxT6mo9CWURPv0rlb7QsI2+yLEjPu2HCL7nGS0+8kWSvb/yXj6pcDS+RozVvZiPnb4E8FY+9hpsvl1eij0PhBG+iMLAvOdREL6G4Ew9XAMePU0Lib4s74W+IHYuvB/pPj5yrmg9Mbtkvcmr9T3F9pi+0ZxePAl67jzXEZK9w2ADvk+g1D0U8Qw+Ju/4vTVZBr4gyj6+EV4yPupFDb2vSdq9m8MHvo4jk77MVLo9njIAPokELL6cCJa4KgZZvrZEQj27hyW+3tblO7oMh75zIO2+DSBDPAWaB72TB5y+H8HYvTc7M73SuaK+VFSCvecNFL6mVQK+sg0KPrfkUjwLvrw8cFHDO36FAr4MpDw8NN8APjxHir6ZWXy9H+o2Pl3JiT63jG+9J6N0vYERZ72fydG9yvMUvpRgID58JRQ+5HeQvuVNDD6AK3W95j6zvlVzED74Eny+4Ic8voFWqz0EdrW9bGwQvFT6UT4KTPa9gmKOvjFryb3HyJS9QHWFPcczkj6vElY+J6Jbvr559j11Ck2+AGtFvn3yoj65BqO8U23svFZMGD5tOUi+MS1YPufQiT6qgye8BMgJvt6Rtb1rU4w9tTMMvY9DpL1jqDy+vWUJPqWgfr0wfjm+QuTTvRGG9728XUo+GghCPdn8S74EDIu9w49vPNTrf71o7o08w5ftPcmnpb1LcMo9sPC/vbWWErxFtFq9P07lPdy6Oz3g702+hPgoPCuFCTzj1S4+Makuvc6JWb2f8fC95Gu4PdNkhDv5PRg+1dFDPrkcPj7guiI8fYccPttSeL2vCAu+wTZ8Pl54Fz59VlI+NqdYvrd/ib4kK4c+aauOvHaPRz0v+M285ZQmPTRUG75X2E++msrgPfIG0b1iMBm+jNY/viyExT3iflO9NMTmvbuYHj5gzxA+vD/jPehehT5TQf47375cvt+Dlz6QGIS+iiqLvl1UEr42Y0A878hkvYgjh77C+EQ+YdxavlJD3T1gIES+VAmYvjHxK75cFHk9dE0YPtAU3L0adZy6Zdstvtn2pz1dfPi92elDvmjDsD3dn9y9+1guvvw9F74jcuC9tTsdveY8nz28TyS+0Q0oPYAiID255C8+iwy4vQVOf7s5Gsi9rAiOPFzHrj2g4SO9Q8z/vEySML61n989xFAPvVEFwzzX+Vs9HvykvfkoNr7ALgo+YykQvtPP5TxWKi4+c4PNvQ5qKbwrOKO9N3iyPUtZAD2q/Ty+MFExvcl2+LvHLp89lwYGvbtGnr3r1UC+trFmvoh3ibxRoNu8Jnl/vV8r7DzLkWY93vujPUxLC77eRa69wibiPdc/jziDcg2+MMF8vCPPz72988G8PpDBvaLqwr3Yvgq7HFQqvHcFjT3tKSG+apVGvrg4qjy/reK9MypVPJEgAr5rreW9bU19PPLTxj0XwqS9tvvtvRtKBL7EIT++jKEZPewA+b2stMu94itKvrICMr0z3Qc+qBUDvfWqljxOshi+zbztvPXLobzWEBi+73C4PY6GhbyYH589ou5Zvhrh5T33djm6qcdJvpJECD4HEJW6Rh7Lux4Iwj1jQQC+xHhlvR1cxz2dLmK+CwI9PYTC+z0LS9c9KYvfPeUT3bzkoj49pI3pvVBIY70UN6u9LiCnPYMy0z0QwfG9+hEbvtGVMD2fw989/cxyve7OkL3ZbCU+2yPhvba8CrwB9KQ91EkAvtPaTr7lyeM6Fuy3PawepL4n54U9LVbPvQ8tlLzDJQi+AnAwvAZhnT7qctA9pLSTvq9v2j2kB6m+/rctvjMwrb0rcTI+d5UMvsaoCL7Exzo+U40dvlaOST4GajI+rHzUPWIVEb3rXOW9oh6qvXsprL0U68Y7sDDlvEquEL5CVna+hzEZvekV5T0S66c9squVPZm/KD6ukxm962u9PYa/ir6IHkM+18tnvYhWjL1y7BA+ofc6vLXhPTyj/1s9KR1EvJnBCz7KFMO9yfyTvAJGHT7GPzA9AvvHPJJwYD5+Xk8+0Y6RPZxEoD4WCPM9bk+/vH9gKz6oCtg9mOgSvvgyx70W80W+oZmvPeWXkb41uX2+noFfuc1jS71fbKO8LkWCvjYYGD3dq/C9dfJdvrr1Nz7JZfW8DaJPvuh8zb0TARK+aN+OPKRl+L1em9y8GOTFPbDbmbzOhkk86yj1vd6KGT7/mrk97TSTvMlg5T3XoCc9iQ+HvrkRXD6OX/Q96mYEvrc2bTyRtR8+GdWWPcDgtr09CEE+YsiYvBOCPD5uKhQ+m+eLPk6olL5WiTM+KPl7vZTvkr4ZyRO+CTXdvdsQ0r0Mji8+2DxIPQAuhDzY/pW+HgoDPvcbmr6KXRq+QdUnvQLAn76yK02++zxJPuqcCz6fuXe9wSrYPf5BlL5aMWY8td+NPcvUR70J6DQ+5wdyPdcarT7EWqI9KUfDPfNF+j0lZdY7WMx3Pgqxlj79qq67ZxOGPj8nEb6N2yK+reMiPr8mcz3lgtK9jnRrPm/FH75TgG+7yY6IPiHOr72cgZG9YkIXPuEWgT2EdgY+b4THPTNcjzwKwYc+eInlOx6Lqj5IpoA+3BXNvRtglT2uYUS9+JVEvjBPpr3EYVw+JmcVPl7kZT4Q21e9J9woPtUFCz5Y9Te99udbvrpnoL2x/AC+4WFRvkJnvj1kvga+r2isve2TjD3NaJo9Y5KRvTNiYT4okRu+y+3zPe74vL21CMQ9GfzqvS4E7z2glcy6f/8evBrfQ7wISCi+kO9Evqc8AL429dk9IK+jPfhMUr7HLQy+C0j3PZ8rzT1f0DE+sfY3PkIBtj3onn29u5xBvLQ+Qj6CZok+pIDYvXZkc70xSbe6CHFPPKS5jT7D2i++mcY8PiDmI77/xIs+ac+HvSSORj2W4qk9Dps/PZwEGbz0VG+9jQbDPKTwRr7MSWM+163zPX4dKrxLcfC9k9UUPusCxz1/5cM9kkT3vW/k8DxtYNi9qY3IvbRQL75xSuu9U21EvoQVvT343Rq+F5+0vexLDb6WpQs+oWW6PO+Bkb76lfa9ApXFvc566b1MrO+9hqnqPeD+tT0Q9Ay+cSoaPnygA736bxO9dY9JPpN28z1YA+I9N2/zvcQUtz3U37g8fMt8vRmbMb45JTw+iUacPWOVPj2qx+G9FwHNPOl5l71uAuO9tL31vSOMHT5KaVy9pZbSPBjqdTuVYA09MYP5vRc19L3xeh4+dChlPgu007v4+H692Qc4PvUsi73EDxg9BsvnvUk6eL2GBRM+YzZVvWVGgr0bLnA9tG0EvumWsj0Njk896kj8unC7EL73xFg93vQCPZiqaj2dWD89A3qWPXAiA76NMIU9J4gsvqn0BD3O4MA8dtEXvgbvTj6Esc89AioRvm9sDb1A3FE9izMevh3PNL7fxxy+LFTVvXKIvr1D3k69mf7HvLQG6L29Z709PQlTPeVzDr5a/b+8spZ0vQ66Cj4js0E+oSgAPbLqdj1bVY88SCaHPvZV3b1K29A9cSExvTe4u73pxBa+j5IVvjaqlD31KjI+G/cVPgQ2tD2QfQ4+iAhgPtlyFT5bmAW+gTarvdxAzTyzeMo9ESyIPFty8r3oueU9yMzoPW+zgr1TwPC93fgvPS/FUD0QfJo9F1XvvThqErzTe+S7rT8xPu0MsD3oF8O8F3gBPiKLIz5mRCE+dugSPoutmT2D7Va+7xkePquxJjzELAI+HdzHPYPDCj7DFQe+N2zmvVekWr2+GQO+8LcqPkIs17xWofw8HfkDvlc7sr0pYwm+TqR0PATAQD5hZQq+LUwIPtd7hLyzFYY9B94OviMCvj075K09qM41vi3bST0nW8Y9ElHKvQiOW70vmXO8UMshvodwCL4ohhM+PiNIPKPIgrtmi4I9vVmVPA9uQLyJbjC+XUGrvVDWBD3ykCU+FkM0vYLTFz5dGv88az+NvfjzeD17KgW7zrQnvspVwb2XlIQ9Trklvvp2q71IDcA9wuQ5vU8TrDwY5bo9P65mulBCIr75eDE9Hs1/PT5BSr7pOZY91pYVPS9R3b21sUe+BVRGPhGH3rpUQoI+d1RlvjgQsT5DiPw9z1/aPdC3vTz9Zdy6Xg9cPHnhrj1pNhi+x69lPagk/b2ukNO92gUkPuhnNr42KpW9WbLEPRnwIz3geEc+o22nOj/roj5nFRc+succPk97iz2HJyE8qiuCvKDulT3SAgy+le5NvqZajb4YJYO+PacgPipcNr5Cx/c8WuCQvjApQT5YCyi9xPFnvC82Zz7CqCE9ptfLvZwCB70B4Ra7WB5MPUiMgb1taWc9dL/1PCwI4L2INns8MXQVPj6wOz5MPKO9x7uwPfYYyD6nv3Y+yFhcvsuf7DzZGkw9T6Q6vlNFkb2GFQc+HSc+PROqEL4is4A9RZJNvt4mLb2YJnA+8msavpgGcb2Y9VW9BWmZvVo2jr19GEy9xKL6Pa2HML7Lw1I+DdzYPU3LTj1XVKW99cBBPmkqPj4e/Fg+dRiPvImjiT5LFOw91YWVPsXJiD0FmgC+blhFvV6ER743dza+1BwovbXTWz5phSu+ptxuPTU5ij4i+Za+cwk2PqEtg7zTfCi9ywkNvinwT74SCqc98Z+SvbjB4jsKARg8TNqZvnnE5D3HkZC+rjGFvkOC3j1DBio+1fraPbYECL4VLBg+F+UzPobQbj7iHjU900ilu0wwgL4JPhi+eGB0Pj1GbD0WRCK+N+l7umZIBT4liAk+X7NMPoUnCz7zcDm9NiojPS36mz7n48E9rk2UvbIuU73x4QE+ebctPuMBnjy2WCC+s2xlvZlyrr7rKcI9N7xqPrYyUj2ReUu+qIYsvif/DL4vG3c+u2dMPuKsY72LFM67lhCMvMpXmD4iuRa96oIkvfHaMr17ZTG8tmrMvZgTEL7fDRg+X25WPpkWHj5bva499DBgvUREkr2Xnus90NATPpWe2jyOWYO+isLiPXnY1DyaxwG94NI3PkYnpD1ULE0+ggBQvYU/tL2I/SE9vSVbvhpdAz5Goac8hrbaO+298T1Usk69FOY8u2jHmD5nBAu9bEhnvZuVDb7WHWK90TLjPQgPET67cEm+YgUAvgYOsT0TFac7TJJLvkYUD75FcR0+7iZEvjDO0r0DCkA+b0wRvjQU3jxeVUm9i4SWvQjApDwgqwA9O2bWvJivGD6P/6e96sPuPTITd74RKwU+eyQhPLaHTLzFVYI9FFEePqQg1b0Oaho+f7owPuUeyTzqpsc9xGvUvTkmFD6dKAq+Aze8PW1zFb7FasM9dOYFvprIsT0MaXy9KJGUOnTlr71BS7m9Ufh5viGmDj5A+5g9eZEmvhgKhD37oxG8dw3EPX7ps7sfPwq+7JlgvfthDD6GRw89mZPOvP27Bj2Eeua9f0xcPWcoND42ML27wNXkPBQdpD27YE++o+Lavd35Jb3Krua8e8hZvWHnjb3tvDG+zkTnPYsNxT0VocK9GRCPPAUuGr7nSwO+8h0+PXOWXr2E0ke++qYEO5j4Zbx2sD4+H/9zvbmiY773mrQ9UlkvPv9wfL0YJXE9Y0UMvlXy+L0Wgr69rJEgPvNiR75SIMK9AwIzvbS4WT2E2W49DzxCPY7fJT4OW/k9Iiu6vc0/OjxP5cm9uxbOvU5QUL6xDhm+w9HJvcT6/r135OC9oh5WPVGSJT174A29XmbOvG/Zpz3W+BO+SqGDvK+687qWVP+9isfKOzDf4zxkPxC+1X8YvsUz4T1TEiI+h8RavcOJgryWOKm9YLu6vVDQFD7Nj6I9UGi0vTCimb2fLSm+gUaTvLzRsrpK0aS9rOC2PRqdyT0k2UK+ZLdZPMekkjtoXhw+ZFRCvu3DhT0kMIq+0KcuPdQE1z6011W9NrhavoJeBT5WFyM8WpGDvZZXDj7pIlO9c+4pvuIgC76sC08+lV4SvsN4qj7P4Wc+5F2wPboNUz7geA++Zhekva9dB764ERY+kCjvPQoKCL5Ysw68shSSvEC5u724IM49nHWCvr8m7b22FV275RMqPa1mmb6N0mo9KS9GPVcXBz7NG7c97FEQvqCk/r3XYH28qsNavX3qoLwkcOS9kvUivDRLRb1ne1W+k7QrvsCn/r3rZ5Y9aEmEOxFZiz2Yndo704QOPg/Qlz1+UaA9AzApPWJhEDvWXwS+uH8cPthx/b3GpOm8MRs7PgvzgD3KZM88wMtJPcSDnj3U8To9iRoSvktBXTwKKEU8K76tvQ9X7z2cFmM9bvcNPv9wiL2wzeu7O8HrvUQJr769HSa++WANvsnn8z1UnUo+In8OPdfqH74jokU+z3MXPahOVz7HINM8AdNkvimOKTqKq5c9gD60vdQsgLxkLA8+EGsQPhfWZ7y94Cg9ErhYPuq13jyvyQW9vi4JPbXzkb6H2QG+stvsvXWCFr615DI9vLgwPrpnVb4NYre+PehqPhbnpb7v/2I9nT8yPC4NHb4ROAO+IbaGPeduH76hBWS+hpWYvabYjb7ZfhU+7UkuPoYWj74fkUi9utHUuyL3/D02hm28xyGDPpzvQL0tR3Y93B1/PkVxjD4RmkK+53iUPKby9z2J8uq9ey1Pvk9Crr047Xg+qzvBvFGpzjzpXVq+uTF8vPeCRb6iUca9OS99PU8+Sj5x4DA+82TMvLtWUr6TMGU+ibuAPcv0ij5Ddro+XFSOviAJgz2Ru6m+wZOavTDJDz3LaAo+jrXCPFqvJD5Rj8q9UlZ4PSvmI71qbbq+X9wePbT/O7zwtDG+ksvCPV5NnT0lI3i9+jo7Pk4pjL77TwU+F6qtPdn84D1BPX+9cQkLPjMfEr5jI7s+FMBtvohGMD47SrU8Zbtuvvzlij5Gtz2+nOlRPkgAab53dCA8DNflPEDa9b3MBoe9Zl3PvaGrG74f+xk+kGVHPhideb6nW4u+rbQ0vnqJqT3vSUM+nMQnvV2bkz0TI/S9ymeePgCmcD6Ub/i9iVuqPtAYnbyKZ2o8QyO3PbFuT72eeRk+XW8yvMRp/70rYYq+H1j5PYMpib5kpTU80Wb4PUlRw73vjrs9q5KmPSyynz4VfI6+d3AOPvtzBL6YRBW+yIU+PVyldT3FPqk9ML1jPTcfqLy3nwG+KRJDPMfBIrxJ53q9ITYevnvBp724woc8ZOQAPZHkaD17ks+9aqbVveDTNjyychG+VSFJPg/WrT02jWI8HrEKPmyPmb3/W7I9H4VQvYdYFr5E4oC8G7QEvseozT2pPDY8P9u5vduoJby8lJi91XRBPSC4DD1mbx290u4nPowHib67coO9PoPWPUNWhr00lGG9BS5IPJO2GT28Fpw8s/GMvtS03r0w+CI9uYCsvOZXWD20zT++HHsaPaQEE72bs248FFZ+PW43i70bCQm+n8QGvp6p9bzCMI88v/DyvMd8ez3Wf1W+GYc3vuhTfb3dgrk9ytOVvfxfFjtxH5Y9XMu5Oyhd+j1rMwY+t7pkvWVby72nx9W8xxrlvaJvuz1Q7Dy+h6YrvhE0nT1suPe8ZDbwva5sjj1BfS49pH8LPWsfjT0G5v49SVN4vZmyUT5XBPY9Y2m4PMFaVb4/KVU+1eALvQC5hz1XMnG+vr+9PeL/wr3TlRU+ajPJvYndAbwJXzK9xHaAvE1Gyr1HOyC+BKwUPo7tc7ysHEW+UKjhPYKZ+jybxew80b1zvntvSz2Kuh6+z1mAvZ4SgT1ge749J+VgPUZagr0G+tq9jsJaPdXvN7706w6+lvChvTSTorx+flI6p2rRPVlOKT4SgQa+TCTzud52jj2Wo6S83EaTvT2RrT0Rl4W9Dme5ve/GjL0zSfk9l31OvMLWLj3Orz6+/s3yvGVWlL3SCAS9UpsHPsW/tD0K1cQ8j9lMvKMtGb4rO946wm9FPkFM/LzLFhs+LnEJPpwVHrmYoSs+h+qXvQwmo72v/Mk9Jd5OPkbC2zwEgFK+Xd7GPUW4tz3J70I+O4E5vpr3jb004f69N4HdvRVPTz7NxoY+IdL2PB0SkD5uTYS+EZ1jvXkLS7pBZkc+4KlCPgbljb5sZDi+c+KsvW5nQTzvd1Q+VPQAvlruIT5TqQa+cDqhParnaL7TB5M+M3m9PR9uiD42DKc9AymLPUC5Kr2r0Rm+tTYoPn3EsT4AV3q87FkAPXIrkr5tVDi9LkkJvsmWUL18j5A+meWdPkocez2y7Sw+EV8rvXcEGz4fk7Q+LNIGvq4Rcz4XZBK+RbFCvkl6z73nZtW9iOj0PWON3j23wxa+zfX4vUfLHz45RaQ8qW+iPGicAT5WYx09RvgvvtvNmb6ocBY+O+o+Pl2sKz7Db2K9sjqSPoIe9jywmu+9el4Svp5SBD6cTp+8vDOFPXhmab4ys2Y+6FWCvm0iMT6pS0M9dMSIPuLUsL2w+4w+80yXPvfBjL2cH1Q9qEFevZ7wrT3Aoe688KQMPtnp8b0BNb+8JjcePi/9SL7jCwm9B+NaPum9ur4CJ5+92HH1ukh9tT2Aygk8kz2NvMiuQD49PQK+l9HPPXVD4Tw5g4Q90td6PgnJ9LzE9lC+RZFJPokxt72/Qpe9qj2ZPUARG77szHs+wKS/PQM7hT6O/588C1esO/zTIL5nWYI9Np4qPPA51j3+gAS+k7bfvbiDsr1DTkS+iUJqPqqt/L0cOj69lZgSPj4Wd76Agrq9DlwXPHgBdr7wHaK94lTJPWWKSz3zCws+JD0qvGi7Zj7wEZM9X1a+vWKL7b164qI9ys+oPZfRlDtntE++VqrxPVx/Mz5E4mM+oFNSvhv0Vz6LaQ+9kUCWug3muL2cGLW+JhvFPI7RhLzROUQ94GyUvh1wVD5BzfG8cI37PY64D76LT3o9j53IvQ6wgb5vI7u9hPUYvopZ572NCFU+Bqx0u7dPtD2XoMe9Ui4JPXzaSj2i9hM9bz39PU9/Sb2J0pk8x8LUvd0lFj53V3E9tvkXvv0joDx34wO9fbOQPWx4Ez1b/Ts9EU1yve7csj0CE0Q9+X/bPIpJ5jsXW+s8mk+wPXfyvb2aJRI+wKp8PmgaWr1Bg30+dcIoPioGqb3XatM9OA+bvYfoHT4JPRe9YYMHPGp+0z1+OQg+clhIPmEkrLzQLmQ+KULXPL0DKj6izus9Jp8OPH2nLL5+iau9qtIYuyLx4roDxww+PqKJPd6WBL4ptg++Zc71PGLxxzyQ0jQ7KYQnvvHJZr0Kd469EvERPhX5OD6CaRc+8wIJPkKzrL0O4oy+ZccrPtYlurzsydY9KUQ3PcsNuzy+Obk99xH4PVWmzD19JeE8tR7qPX8X5rzybsg9ucosvpRu7rz05Os90LyiPXTn5TxST0W94eFnvbEAx7ygkJ09gqJlvt4wvz3D/wG+Td0lPcpVDr2LssC980hPvkT6jj2hlhs9JHdmveyN0T2ey3Y9e6D1PapgI761h769yhbuvV0zwTvzgVW9kWcBvsiBKL514po9fl8YPdE1P7xW/dK6q96aPTSziL3ioQ292uumPafBD75f0kQ9yKsqvmJqDb4GKBe9wCy8vRIW1D2W9Qg+wk4ePY+4Nb151i8+fng0PTMxAr6dx5Q8xWTpPPztjL2naxG+tca6PZ1iQr7iVUa+Oa5mvbmoRT2OD3a82JFsvbYytD1PnDA+9Lz8Pfl7vLy9aly8UQnYPRcU7Lzslau8jBbpPfwDsDsVqFI9hNPRvbyLhT0sid89dhlSPmR58D1BOZQ65vKyPXpIxr3jOrK90YQzPJWG7bwCgmo9JFMavkI51r1//ek9DrZavUiQuT3loyK+JkMQvqEODL03QIm9xY0BPqIw+b0pBi49mYCdPXXv6jw4nfO97o69PQK98r2t4hg9LHh9vdl/CL73qo69E72pvQ2Ekr3t7QC+L5ofPZORVT29YC2+U3sMvnHdAb7SdvS8x/bFPVxsdr5OKUA90uUhvqjQ/Tzm2aE7nYh4PpA9+L1fGz8+tNEGPnZdmT3tErY9NKDTPDXrLz75p0S+QVQhPv+mXz79MF49wTsbvIDXb7vnJdy7JW0rvF4pMz6DBNY9+B9Evj/7fD1sSnq+1gjRPTuODT7I+YS+po8MPQ+TAb6Zo2s9rr0dPqEjLr4NXCC+8ZMHu/zXfb73wjs+NPMrPhRmED6u0a+7hGoPvSECtL2E1lU+Va3HvNwUzT1STAQ+T3ZTvshoaz1I+je+gC6wvcrBMj0/4Fc9E2OQu3T8KT3j6BU+nG+0vsg29Dvo8jo+ZP46vqjQZL2eJN67whhxvnkCCj7HbxM9nTqPPXL7Wb2RMbS8x0hPvgVGfL7ug2s9zIL+vQxLSj7HQja+MfgHvtngAz7SF1A9kIhevoUYDr67mVE+VMzRvXJfGr6cZxM+6aoXPhSb2L32iiW+vW6CPemyWr72X5699H4wvTvmIj4isRS9HtzrOkTODjwUBlw+aD3ZO2ZyLL6jPpC9wBQIvk6QvD0gHh0+6mA5PXkN/706f+48sGKwPWZ3wDwFftw9hEWJPoxwr751Jzk9Gmw2vjwBcz3RmjO+HYfyPYCLgzx8nVM9AHJjPt28Hz7MKhu+fOaKPYXBVj7ifWi+j7PduwdYMb6K2qm+89s+PqhdDT6g3Yu9Vd3wPZJDlL250oE9W/h8Piupor55Dnm9bNMTPhyvOr0aEw4+XyCGPm6vqr27uIa8qfuGPsuFGT472bm+RjAdvvq6k71WEFW9OnoKvq6OWL6JC4g+wcKdvfPgVL7ftFA956BqPtHaeb5AOTM+1XuDPRsmET6vBi8+qDuWva9iWTzgcxU+g5HuPeyhOz43egA+8cxqvV3Yoz06JuA7kqcsvgoCkT3rDkM+BOgbPkv4Y71dM9s8z0WevEkEyD2RZLm+YB1ZvueqpT5kMkU8FBikvt+f1D1Pewa+T2JePnVodr5qDRS+CVn7vI1NLr5GTt69JfF1PS6Jdb6TJWw+6wNPPjr3/72PYFU+mVkNvgiMIj1A1qI+clZWPqbLHb5g4bI+1dacvK6HST7KbuS8X42xOrGCWTyhygI+vjC9vF9OL7vLILG+5tJpPi382j1jYFE+aop2vnE5Dj7hv6q+7QISPucInT7B4Uk9A5qqPo/Pi7vRA5i99CJnvVhqojwoG8u9WukPvro17D2FVIy+AIxAOOWxAb6WaS++8uw7vpdp+j1yVCu+gjssPdRrND66QIa+Kqlmvh70xLsBBRS++3uXvkQoC7zpr5c9F7EoPp98T75bbzW+anWSPZi1/L3ijP08d4B3vsraQr6hHnW+H/5cPgE47zzB03e+U2YUvhm8OTzNmca82AlUPTOAzz10i4o8b6IbPia+m72/9tg9bejTPZ+OKb20M4e9mHjOvRZ8IT4JTR29dZNoPY1e6b1TADe9EoR+PfPQCT0Xody95RsQvkh4jr64g8C9KKPxvDOIhLy+agu+/bmTvVKzqz34JES+ulwDvpcCKL79hyK+kH1hPWxxNb7BrgW7tZeLu6PzFr4ArUM+BHtUPYSaaTmLn1M9bXtivdbCZD1jCSa8fHPIvAWr+TuY1Zk96j8KvQqZRb0/1pe9Ut8svafxR75W+RY61JYnvm1mEr5AzH26v6ZyPQlMAT5HdIA9lbihPXunhT2eAxe9w8sXvAZPAr5wFuM9EhZPvikalb1g7Q2+sDXcvQnwAr6H+qg9SvsWPbSSij1Cowy91oOQPAhoML2iWIG97kOJPVsniD3IodK9mB47Pg7gUL1Swv884Qq/u+DGHL4T2RE9dU6tvfl3Ab6I16u8qXTbPdLd1D3rheS9rw9yPU7t5bxCyt89hX8vvmumFj5khZu9Kv1ovoIBHb403zu9k3ezvVJ4rztrvSq+LMJPvkhHtrx08YQ9USLGPckstT0LE/q8F9DDPbp8FT7B2s+9DjafvEc20D0uvxK+mWe/vdl+S74GPwQ9Ry7aPaZE5DypSe29MsAcvEsS2z2yNrq9EF9TvEkDoL2Fa9s7jLUHvsYT9D2tHkC+CsyGvo1rhD1h6KM9YNpKPh2SKj5EBYA87F0qOLxQsz07U1m9mX/RPF41aT0ael09i26RvtwI5L0A0bq95wHlvbOperzp7X09wybWPc13Bj5CN0u+UHMLvkTSbb0HfaW99I9QPoHcDD4JWeY8H6oOPq3TT72fdWQ+L7T5PXUI3r1pYyc9SdRwPh8Y+L2NKf09cMGrvdRAAj7VK14+kek5vmA/lzpOvn89p1PQvRvBUj4bU+g8sewTvvZIhD23JSu+XPACvuVngD1Lr3E8Js5svSohhbxT/2E9fvXDvWF05LyBsXU9OPbdPG/kLL7566e67DcdPo67Zj5aIHQ+1HotPabJEj1uv9y6f1wcPuKZdDwidCC+eGIIvsZNUjwQbgu+qMpKvTL6iLt9AvY8yh59vhnaYr5brTk8aBuduHFIvLxchQu9QF0dPXqeH712Ocy85ibAPWm/1r1C1oK9LocMvvAOML2E3uY9wKQkOCy7x729+XY9Y3xhPcaaJj5bGWY90DHdPRpcMr7I3OA9IxKcvbgqhz1jQNk92yHuPWXNQ71iVg8+96cVPeYHNT2QCrS9WJHcPSKnYL7RHJs9sfFHPrZ6hzpmUPU81A7HvOLtK7x3JOO9M0Ynu/ivJL2xYwE+tJpgPqI+cD0KQ7o8E9l0Pa3wMT1N8Uq9FdMTPj0VPb1j3mc96t82PmuNsb3d4RI+ySWOPBNL6z70Dhc+FBbRPLc1ED5IXfS9RfmaveT8MD3A0Qq905x5PZDudr5YPDA+Bq9FPGbS6j0HYb+9KAY8PnJfE766GNg9cvd5PoLUHz6oOb67ZWJhPgAwbb6GS1E92axoPsrzGT6oYQw+0nAtvpqJwr3xiRc+DtmCvc7lRT5u/m++Ncu4vBvm2r3z3Q8+AQ2PvugSFj4x4B4+PA0Vvpg3/zsGwAm+GtMhu5laeD5hGJo+HAIZvibiOL34nBO9HaKbPLpTO72e7wC+54HqvRiEij24Jq+9u1d5PuJ4Lb2/hME9SpimPK220j3m1he7g1QhvhfxKD3N20q+dmGqPU+MMD5wNk8+Pr0PvpfXMz2vtkM+alQOvq+YoT2G7Qa+SPnQvd/aTTzOh7u833RQvn84jT1L4Fa+C1HTPXDq673vIQa+rnsmPhPAfDtl7do9caAMOyjFYr2GDWQ+CUu5PcdQlj1KxzC+HmZsPOV5+Ll6aX28RMc5PkH9gj2q5JU+MRirPR0WBz496i4+/1tLvVj3BT3uQ8W9Lu9cvKBgFr4nro8+TmUSPTFxmD1J2R4+ab8Ivj6Zfz1uXCY63FX3vd8J7j18vZs+eN/GvY6ggL1FyK88GsDNvYiIxD1wG6I9ukOdvQ6H87tAZIS7fzyBPpuo/TwfhDm9UvOhPSKN8LyTgiS96zBwvZecn71bpMO9nCyWPdrRHj5g2iE+akwcvpAaaz32EZK9o7NGO4iTFb4/bLy9kqkXPLREjb3qKyE86Ki7Pf3BIj62xQ0+VHKivZbl+b3ZEgi9+KT/vfNvMz493N09aj3ZvbIeqb2jMNS9LlfwPUu6iT0ntAo9NJkUvQAyhzzh1Qc+ZHVUvoh4JLttw+S9QN0nPo82uj3xT8m9ZlXhPImdN7x98AO+vkUXPq7ewL3GGmO9S2AYvd/xvrtybo68hpRAvmk/pj337+u684A4PhBHmLvyQaK9AfuOvb2o7L3nLRy+7t7HPQr2OT0fNGS9yH2sPMH6Yr3T4pe9MKCDvV8qOz42UgC+zk9VPfv2Rj2yv6Q9SGU0vnCWAj7vsdY91lFOPhlFAj5bZj0+5QOMO3JFgb2oJAQ9SOmuPYLZh7zpnGs+ZlvSvTfHJz4M/Ks8UQG7vd7juby1AAC+hW3CvevAfjy3DT+9gJAAPc7AHb0EKPC7Q60CvoZxTD0++ek9hkp/PbqtND45eCw9OX5UPV5JkL359jC+09MVvp6gh70vBY48Pn7KvXLMW70lUCU9KuO/PMbL873ZvM29F7ToPX6+3b1JQdo8jl4PvRO8O74arg0+RbSqPTOEYT2lwk49ZiH6vYx9Rbs9he69a7nAPaAmxbzA9iK923eTPeXSz7364Ia+hZs7PrcpXr4Ke0S919yePc2hjj4a2QA+uKGYvagSOD4ozBS+1WaEvVaYb73cd3G9OWsEvRNdXrroDuC9mRcMvjTfAT6W6Aa98NASPpchxz2ResG9OodKvVAt/rziKeC9p1aGvaYXDL1ACE0+gEZvPVmyJL7PHJQ9xAVxvi/ZLj65/Xy+/rfmvGpx4b09RpA+3hH6vDdogj5eLYg+jIqRvvCzF74EW1I9FbeCPkQoUL1IKO89rVzpPZCleD2hAKY9tx+FPU99PL4Qv/K9BWFYvnXQGz2BpgG+h5QgvqJSLz6QOso8yv+xPZXxub2ClOC9ntjFPSoIpL22cKE+KCBEPm9MbL6XH9Q9TbBmvShkiryvi2g+kF9rvohv1D0DVgu8OeMHvsIwJLxsSlc+yOmdPWyVnL3X/js9hWPUvXHDBL7z3Ja+yVXdPb/CED4pFxo9Xv09vtkyxL1cLfc87X+HPeyX7b0vgqu9GmGfvBAEmb3Dgn09KCwMvpBL6byjTWi9iiStPRs7nL3MTkW+rzYYvngpGr4bwTA9bJ0Gvb9yuT5iTAg+0MkTvq/A370UFbO8xN3dvfhVN74VTii+bLCQPAjTXr2xGGC+oDLxPVrqDD7QDnu+0ag2PpP4vr0Bfpc8Mv8pvuutmjvvp4G9HEqgPuCFpr0xelc+WoXAvUPkSD6PZDi+mA4zPo2ag774k06+unJdPpKYNL0me7a9KNECvnoJCz3Lnfy9PJFsvpCIgL55RNw9LbcovkPear0RhnC+Pc+nPV7UFLsVbhW+yHC+OK+yM7wCChs+4bmovbObUr4w/38+IjFlvS+gBz3+rDM+1JyWvaUU2D0qwNq9++93vv14ujtW2jG9iPc8PRAbVjsHKky+oJOjvShbGz7SK5E9iXAyPVFV3L3javm9VKshvjTcPD0lo8A9iPhAPVW/wb1fglU9NtuXPbBO3T016i69gnvdvY7nKb71GQY+QlSFPgRyhb5ibMQ994h7vgWpqb3L1Mk8a5KdPZ87TL5B6IY+q0ggPkzuwz2R0By+UU1yvKV+Gb5b6S6+ZSkkPrd0Mr4sQXS9HV4ovXGPG75FMpw9B1N7vsjrvj2LxSe+fGidPvd/ej5A+5I9FGkWPsjk6z1ElBk+SFN/vWHKxr6k2hC+UAfrPDN+dT3946S+1fTyvI8gi76Te0S+AkxevnJHUr7TZYi+GoUpvnr8bj16bGs9pkoyvnRSFbz5QyC+FaKevBpB0L3kqRG+PJTZO942+b0AZWO+HvfbvRvUtzvHE8q8aAunvkwUhb4l/AS++BmEPlTfj7xT+Gg9AWCHvi1kgj72oyu+5vJQvMG2qz2trFU+n0RDPlcBQr0k/I09qbtBveo8AD0nGeW7sRdEPRsnaz2vzKM9BumNOkdBizyrGuW9RwImPjOPQT6+7x29WtZDPvbdTT7/xXu9vskjvMXdfj5YWlY94swmPpXvm7tcEze+UZS5PWchOz6C8129UDkRvcW2vz1oJjA+k3yRPZ3OcDzhjQM+X7souyva6D172qI9Zk3ZvNCA8j2IV0W+Lm/eOx45br0ZjKc8XyiyPe5tgDw+hwo+1NoFvozrHj7OkuI8AxIbvl0Zjz1hAom9OBUtvsa53DzD6jQ+i64xPrBAe73qy4y9kBmzPdc1Ir7iP4c9HspRvcQYxDxr5Au+udAFPSLiGL4rjKI9ZUwPPc1bZT7zpIa8ED4KPA+yrr3nKVA+Gzj2PV4NOD4Ay+09iQpvPt+5xDzXCJy9USv1vViqQr4ysz4+7eeOvQ8uyb1cwkw+fqmgvXphCr4Aj9g9S055vQACQz0b+hS+3ZkqvsFAOLt3KxA9tdjUvUH8Er58EUw9rfzMvTCbBj3fUAc9ag/fvPAnKrvkJpM9SFrqPVKr4b2WIrG9WrgZvWt12b2LWBc9pLLIO/9Smr2fkHQ8Vb38vbV+Hb4n8T69KLypPeeWNT1AkiQ9gNmJvZbv1b2m0mE+Q1k2PtYI8r1zCS882pBOPr/9Rb0IoO89cExEPs50qL0RY0a9lHWYvXxKgz7kwwI9hbPIPb5luT2V/Y89xfUluwsv+71hHoC94+wXPCbEsT1WMks+QY41PqaQ2L3OSwY7boQivoIxHT1oi249pIwePudbZr2T0yM+yGVtPnOg3b3xGnG9gIlPPk50SL6hixC+A8QRPoaZArzWuHY+DpthvKJFH77ziEq9zlEGPjmCpT57gny9cs91Ppso1jwZx2K9k9kJvVm1Ob0l6aq7LdVVPn4IFz45/RA9nHRlPqBvMz4/FAK+HiqePRIJgrs6zGm7VOfSPUbm+D272Vm9GYcRvsGx5rv1NkI5z/pSPRsNGj4S9Hq8NMGDvTQcNb4rKn6+xBwhPTcaor0PWfc9MQ3sPR/YWL37+bG9vcYYvi0Lgz7ZA1y9NjcGPeNfQj41YrA9x9UgvtYUtD2BFr69/IqEvmUiGT2oouq9qh5gO2nbcD4Bp3k+7Q+tvYjLQb7C/pU8u5xhPWT7Kr3jSim9OxtAvrJdi75vWD+9JLlJvsfq3j1zsaA+ijaAPfdR1LyF74M9Qf8HurXXyz3DuaG9OINIvp+PGb421+69nvYzPZwnij4i24895fZIvRxt5zy6Y4E9OdNYPrKAJb4b6Hk97w7sPQPK5DvWNDU8jY1LvUSa0j2uf4i+VCOHPqwNBj62Zwu9swzCvX2cVz5FSGa+jSa+PbXTTT4JDl++NIgPvaD0hDt0RQW9ZbsKvvxX3j0vnUA9zX7HvO5k+r1yr3S+nE5DvjVngD0NEPk98wG9PTdB1T0hMpK96wP8vaQTVL0yX/u96SI+vk78sT0XHKG9juU1PoELsbyETZo9SrewvGZQSrtEec+9vDMcOhiAg743Ahm+h6KrPWzjFj3I6RG90A8YvQUSCL5RA7G9muMlvlbcYT4mxBu99vKQPFR0TD7m2C2+q07HPH7PqL21Ags+hzNhvsD4XbxMVs07M0MxPnNM/jwkLuq9aXCUvebdxr0TslW9/qvEPJxlq74bHyi+vaaNPtUFLb4hBrY9iZOZvS3taD0b1cu9HFj2PUqKlT38PLM9YYLJvO6QmDsYwee9td3cvNlJhT1cxji9wsrZvSuL7rzGCs29DYUCvu8DXr5MOrQ8PK8OPelYZD1cOse9aRjDO0tJNj10iZK9lVwUPhk0Nr1Sip8+nnkoPTUIgLx7ngY9aN/UPKiL1z1SCWy98lQvPoAPmj0SAgY9UmwNvZ6tij2t02+8ptGcPfH3yD25OEs+f+88PuD2cT3YxfY8s1FFvYGUiD0UNgy+gCc5PaQAGz4ukbU9yOM8PVJCl7zkWoG87bG+vU9im74X3Q6+6m5EvBqd2j1iszO9wjImvpyHEj5rnds98fIMvSdAiz0s4UO9n97YPVyWJL1HvJ08PePjPUETPz0BAz08YivGPYWkRT153Uu+jR/QO9vqnL2LITu+2rUIvps9jL2kn9q9yS8uvgDlBT7mypQ8gzpQvUE1t72EEw4+crYDvi7pJT6SFC29eINZvcQ+7b3Vqcs9DEkQvuDeMb6YRQA+ZzjSvZcXS76ca+s9IHVyvi75VLygK4Y9RDRWPWvX3r13K709X9dyvZvRB75cBQ6+LIHwvdIL57zOXgS+L1XsvWlZ7b2zECS+W/UFPkkGBr7Qj6896OzPvegF6r09EhY9o7MevpLI6L2WJ+Y9s/1nvmnJAT4nNDu9/AF+vf+A/j1XRJq9FYRevs0/Dr5hEZ49t1LCPAp5I742XNM8xd5nvWXFRL4+Jzg92EMbPo5Fgb6Kj2G9YMnUvNqCIL4d7gY+giGbPZB5A74xyiE9HpESPlAj871Ctzo+iyMpvncsiT1gLzo9okfmvYiw4bwgb1K+VXnjvdAoiTw3Mls94VqzvQGF6jx8HEe9VTknvkU6Fr0K57I9wl7XPSJFnr3PhZw8UYchPkqizr2wtjO+GU9NPf8tgDyKXGE8sM5LvgXSSr5gKSy+3twsvh1v6b1xagK+5SoYvf/kaz0EO169TNdQvBodkL0dxho+9kKBvf9NI77Odiw9ERmQPIPOdbxGSg++l6UPvoJyPz6ESVm+4fvLPOX+nb2iKyA9RhW8PUREYT386V+8Av5APogBAD3zwnu86qNKvZ6vMD6MYWK+GxhYPaF/zz1swEU7tiuFPv7l173cy1u9WEb3vb/sUz589pA90HLuPeiX1j0AZFG8WKkBPhyuaT34FS+9nYYfvKiphL3ZCgq+My5AvbWlLr0PRzg+6T9RvrWFMj6Suw0+08FPPbsamb4oIjy+EpUZPaSjRz650Ks9oLucvpMhhD1nmBU+QEkOvvmYDL0ZZ9U9Ja0pPhLSr728HDG+6kBqPrlUoT2Yix4+VIyRPSo/t70Rvg6+td33PXuuFztw0ws9WPFwvRLyVT5/tQM+arujvcK0x7zU+xW+SajiPZ5uBb56SCc+F+LCPfnTrjvewKC7KdXmPTx0qD21Cpm9uiBoPa2roT3gOdC7TVzvPXTMRz3hTSo79tWQPURWMr5CVjq+3l5dvBV35L2fwYS9FJXlut2EgLwuXko+ttE4PuKQYj1r25M9AksNPjEFib2hhy48k7gGPibADD6m59E9nRdyvbrckT0yl+a9dxRDvsfD4r2+Dte9a9KsPB4EoD14UFU+gEguPu0njD2bT9E9BEYPPanlqD0umy28n7b7vdX5jL1xK0O+AT7zPWVrFj4uVqO8CCKNPk0sAj7nwRK+/nAtPnavED7cJBU+nBuavg9VDz4ORB++T5sMPre0Az60dRE9jzVoPv+G/L1qn2O7yaOJPsYmIT5LZQu9WgQavDwgGzwCkr69AwW5vX5NRz0eVho+vteTvSke8TzcZgC+87cCPeOP5L09nWi+nGwfvh3Pfz5OGy0+SQxiPqJ60Lv1GAE9zALgvaoycL6pA4g9Xz3KO5/CIj7h1EC+o26DvtDzlD60zyM+fJBFvqgPDD68kGw9UCDrPZp0hD45BqC+l5whPjNihLy0adO9JrmPvZ3TBL4kWJa9NshNvaHWYb7SIGY9/jkxPYZdFj7qiYY9rf6kvQ/PAj7rLXq7rLbzPOyt4722rQk+OjPUPOZN9D1QX4M+x38hvnkls75ynwO+PAsZvsFMlTs8IR09e2YQvjWTOb6WGwI+gdg0vvazf74uo2G+gfALPnkorL7gLmQ+GTJOvZrbFT7lxwm+Zz1EPT2dPb5+2jQ9bTwaPqN9c7zqIG89qU03PvLPnD0Cq/893q62vSXxKD3Xc2u+4a3UvSUYGL30vu883pgEPvsSm73jQv88MzF9vSn95j1Aixu+mC7QvKKbPL3wQiA95Bz4vpRl6TwS+8w9qE7JO7J81z11xs+87u9BvQRXWb46cim+jNUqvrS0Fb74AwW+JNPbPaZUBr4IHzM9NaVWvSMOsb3H4HW9god3PKg4kj5e7ag9a1WUPdYH1L0WM2s7tqQSPlQzZD2MSfU9dlWHvbF/Sb1skbS9EQ6cPY15PL7y4nY9gkGTveymOb6Azha+NPL3vYc54jwkYPc9/q0YvlN5vryqiGk8dF1zPHuQar64rGS9sk3uveh8v700NcO9gaTFPUCP3j3cxWq9xURWvBF/mL2PVIE9P7bIvTEEEb7OEVO9+D1HvordzLxCp4E8+wkIvcC8gT0M4bE9gFKfPU+2pDwFFMY9rQfWPIJJwT0GVP290Om7vAKdBT6Awia9Cpt6vZTqRb5PoDu+j63XvQkyV73f9wG+oQrPPddKDz2x7is9yxouvu5woz2xQOo99b8fvhALBz1MxsI9HSsJvqy+ED63iyC+6EgnO8WoAj531Bu+SN0/viDkDD7eu6I9HHWbvecgGT2imWA9i945vbOsP72sQfI9IIflPOTNdDxWAE69dXgQvqHzXL4VeL09zAcqPoJWXL0YbL28HGGQvHyz0T1wKPS9DwBtPR6rkr1FhCw9H8XUPVeWrL1kFQ29UDM0vpevk70WTV6+l853u00u+Dzeo5C9UZwmPad0Pr5vSwu+bXRFvcFQjz15t4q9OOhQPb571D2xZrE8w5+WvT66fz28+Ae9kmXmPREH/b2EP5K7TPwrvZFFwr2XI7K9ndw3vjRKNT5OkHC9mxDYvXigNLuTRwU+7RJGPh0qOj2BwBg+QGNBPHcgVr7aRL293ICDPW4ZNj3bJu68mcdhvsMMgr1ks6I9dfbyvVuOTj6KBEE+DR4wPjjFvL1JPBu+gPjKPDe3Pz61iK89YjyOPj+2kL0z8gM+HVL+vAsUP77905M+NgISPisliD0shgQ+9AXjvWeaS74aQAI+WHrKPNIhyT2uLWc9ZBfovbaf/D07k1k++dy2PGsh9b12+pA6TKNZPZzt3r3goRC+4/9vPWMHmT24NoA+bquEvU5T97z1P60+OR/Tvf2u6b3JtAW+aBcXvXQJnL6e5Uk6/vF1vPxvXz4tZmy96Y+kvakOeD3YqvG9sC2/vH6dF76IWnC9Wb/EvDpQ97zIjYc92gvqPKOkFz5QONQ98YcCvlZnG74+U+U9etsxvtdV9zyGtLm8awQMPkPBaz5oX/G8sveFOxkVij43rGU9voMPvJ5Vtb3/4z6+fgmavWXg5z3Fd5E+SNs/vUv6DT1ZL5c9h75vvbOZCT4r+is+/NQRPpfCgr2+Ta28HGAfPhoSOz0j/w48QmNvvbrnlry2yMy8hpaEPiNDdL6ka0K+n3/YPfpV3rz4UNY8gGAYPiKZEj5wfBq+F2XLvd/Lmb2z6Rq+/xNiPkcFoLz5Pom+7iYFPq2mdz4XG4a9TiEaPN6cAL74zzs+3BOFPtuGlbxl3Ms9Sv0DvkpBrz24xnu9xM3nvan2bT2R9vi9LQhtvT4dZL3FX649z64VPuEOCz6iVN09GNIMPqTbVD1TWCA9d/AyPmQ6yb3TUDs+DHlDPiqa5bswYp69V+rLPTexHL4tMCC+3w1NPSjkGT4wbjQ+ElYtviaqjT3TNcY7XoOAvvIGxb3zL+e9+J87PsLsTL7BUoY+A3odPt5SUj221S89jLXAvVq3Or70U8y9yq1UPMyD0j1pXoO80LCDPRAz870uTd89spxAvnIToj2qiDQ9zxw3vuWoNr6+m/o8aOUkvvN6BL4Nsco9k7EjPtNeSr2n9RU+kZzmvfrUoD4cxBI9/z0zviLWFz4r3JY9G9N6PjAwL74OfAY+Pnq1vSxQXL0hI/i8vjgCvquchb1OBxk7E0MJvfdMzj3vwPa9tQJRvlu0gL0SQf+9But+PtGeaj6P3Ka7INngPaa1ar0JUJQ7YqQjvGLJ2L3nvza+TocgvY/BRj7zSLy9tnQNPO6REL19kuW8hj5SPvJIsT20c5i9xrA/PshrTD7ZBKY8Krn5PBwfUz5Zhqo9CSbOPUh5Tb5WArg9wZbwvAnEhr1Qg0E+n4wYvlhoBb6wUQU8hlhovr3LaT1oAsy9uw2uvbZ+njz3Ay0+fxk/Prb5tjydkPC9jWg0Pc9dDT1Dssc9"}}}}, {"name": "sequential/conv2d/Conv2D/ReadVariableOp", "op": "Identity", "input": ["sequential/conv2d/Conv2D/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d/Conv2D", "op": "Conv2D", "input": ["Func/PartitionedCall/output/_2", "sequential/conv2d/Conv2D/ReadVariableOp"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "sequential/conv2d/BiasAdd/ReadVariableOp/resource", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}, "tensorContent": "/SUnvdFXKb26hFW9gBTnPPpwdL32FqC8sb8uvKsMgr25lbs8JCobvPVEgb1iaFa9+SQhvbJGbDsRGP+7v6BRPMHPgz2V5J27VRvqPCHFprwrs9i97WCJvNkO7bwb3Y29ab2RPWXv0TpBQz88q1/WvE2THjxE4uG853mMvPMLoTywHcK8Xu5OPWo69rzHEVW9SkQuPYvzibxSkt28abz3PEMhzb2vZ6G9hHuHvB9MNr1+CQY8gANyPOHLP7za9Ve9kEBSPMTkATsVoBy8ZKSCvKtkPL1mlB08enjVPCxI0jwr/r28XPsrvSqSPT34z6w89ek6vaheDL3z9Os7ZeiJPKtxnLxWg9W86xmjPNuTfL2NaJu8fC9xPDNkAjtRXbe9gjcpvWTSTb0sbsi7idSLOzknrrxukIc9auxavZkrFT15gsG8FOyVPT9nob1hsfm9X9TIu1m+br1wgzm9dzxxPKJFI7zYbR29jLmJvBhaX72a7va7/9wAves2WbxeVEG9w4Q4u7y4iTy1mv288AzmO5MlG7wqGHy98GMvvGFbsTtu/5w8ZZs8vKc2UjxN8iu8wlLWOwB8tbxSrRI9iPEVvdCQl727jT09yllgO41YODw9Tjm9YOveuw4X4DxxcVa8kr7zO+jaRr0eT+o8MZMtPWtgtTzNbrC9AjMDPfh3kL0="}}}}, {"name": "sequential/conv2d/BiasAdd/ReadVariableOp", "op": "Identity", "input": ["sequential/conv2d/BiasAdd/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d/BiasAdd", "op": "BiasAdd", "input": ["sequential/conv2d/Conv2D", "sequential/conv2d/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d/Relu", "op": "Relu", "input": ["sequential/conv2d/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d_1/Conv2D/ReadVariableOp/resource", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "16"}]}, "tensorContent": 