{"format": "graph-model", "modelTopology": {"node": [{"name": "x", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "16"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "fire_rate", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "angle", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {}}}}, {"name": "step_size", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAwAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAABAAAAA=="}}}}, {"name": "strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AQAAAAEAAAABAAAAAQAAAA=="}}}}, {"name": "strided_slice", "op": "StridedSlice", "input": ["x", "strided_slice/stack", "strided_slice/stack_1", "strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "7"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "7"}}}, {"name": "MaxPool2d", "op": "MaxPool", "input": ["strided_slice"], "attr": {"data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "3", "3", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "Greater/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}, "floatVal": [0.1]}}}}, {"name": "Greater", "op": "Greater", "input": ["MaxPool2d", "Greater/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/PartitionedCall/input/_0", "op": "Identity", "input": ["x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/stack_1/values_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAAAAgD8AAAAAAAAAAAAAAAAAAAAA"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/PartitionedCall/input/_1", "op": "Identity", "input": ["angle"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Cos", "op": "Cos", "input": ["Func/PartitionedCall/input/_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAAAAAAAA+AACAvgAAAAAAAIA+AAAAvgAAAAAAAAA+"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul", "op": "Mul", "input": ["PartitionedCall/Cos", "PartitionedCall/mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Sin", "op": "Sin", "input": ["Func/PartitionedCall/input/_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_1/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAgL4AAAC+AAAAAAAAAAAAAAAAAAAAPgAAgD4AAAA+"}}}}, {"name": "PartitionedCall/mul_1", "op": "Mul", "input": ["PartitionedCall/Sin", "PartitionedCall/mul_1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/sub", "op": "Sub", "input": ["PartitionedCall/mul", "PartitionedCall/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_2/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAAAAAAAA+AACAvgAAAAAAAIA+AAAAvgAAAAAAAAA+"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_2", "op": "Mul", "input": ["PartitionedCall/Sin", "PartitionedCall/mul_2/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_3/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAgL4AAAC+AAAAAAAAAAAAAAAAAAAAPgAAgD4AAAA+"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_3", "op": "Mul", "input": ["PartitionedCall/Cos", "PartitionedCall/mul_3/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add", "op": "AddV2", "input": ["PartitionedCall/mul_2", "PartitionedCall/mul_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/stack_1", "op": "Pack", "input": ["PartitionedCall/stack_1/values_0", "PartitionedCall/sub", "PartitionedCall/add"], "attr": {"T": {"type": "DT_FLOAT"}, "axis": {"i": "-1"}, "N": {"i": "3"}}}, {"name": "PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAA=="}}}}, {"name": "PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AQAAAAEAAAABAAAAAQAAAA=="}}}}, {"name": "PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["PartitionedCall/stack_1", "PartitionedCall/strided_slice/stack", "PartitionedCall/strided_slice/stack_1", "PartitionedCall/strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "new_axis_mask": {"i": "4"}, "shrink_axis_mask": {"i": "0"}, "end_mask": {"i": "11"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "11"}}}, {"name": "PartitionedCall/Repeat/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [3]}}}}, {"name": "PartitionedCall/Repeat/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/strided_slice", "PartitionedCall/Repeat/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/0", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/repeats", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [16]}}}}, {"name": "PartitionedCall/Repeat/Cast", "op": "Cast", "input": ["PartitionedCall/Repeat/repeats"], "attr": {"Truncate": {"b": false}, "SrcT": {"type": "DT_INT32"}, "DstT": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Reshape", "op": "Reshape", "input": ["PartitionedCall/Repeat/Cast", "PartitionedCall/Repeat/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples", "op": "Pack", "input": ["PartitionedCall/Repeat/Tile/multiples/0", "PartitionedCall/Repeat/Tile/multiples/1", "PartitionedCall/Repeat/Tile/multiples/2", "PartitionedCall/Repeat/Reshape", "PartitionedCall/Repeat/Tile/multiples/4"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "5"}}}, {"name": "PartitionedCall/Repeat/Tile", "op": "Tile", "input": ["PartitionedCall/Repeat/ExpandDims", "PartitionedCall/Repeat/Tile/multiples"], "attr": {"T": {"type": "DT_FLOAT"}, "Tmultiples": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AwAAAAMAAAABAAAAAwAAAA=="}}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [0]}}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [2]}}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/strided_slice", "op": "StridedSlice", "input": ["PartitionedCall/Repeat/Shape", "PartitionedCall/Repeat/strided_slice/stack", "PartitionedCall/Repeat/strided_slice/stack_1", "PartitionedCall/Repeat/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "1"}, "shrink_axis_mask": {"i": "0"}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [2]}}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [3]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_1", "op": "StridedSlice", "input": ["PartitionedCall/Repeat/Shape", "PartitionedCall/Repeat/strided_slice_1/stack", "PartitionedCall/Repeat/strided_slice_1/stack_1", "PartitionedCall/Repeat/strided_slice_1/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "PartitionedCall/Repeat/mul", "op": "Mul", "input": ["PartitionedCall/Repeat/Reshape", "PartitionedCall/Repeat/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/concat/values_1", "op": "Pack", "input": ["PartitionedCall/Repeat/mul"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "1"}, "axis": {"i": "0"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [3]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [0]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2", "op": "StridedSlice", "input": ["PartitionedCall/Repeat/Shape", "PartitionedCall/Repeat/strided_slice_2/stack", "PartitionedCall/Repeat/strided_slice_2/stack_1", "PartitionedCall/Repeat/strided_slice_2/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}}}, {"name": "PartitionedCall/Repeat/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [0]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/concat", "op": "ConcatV2", "input": ["PartitionedCall/Repeat/strided_slice", "PartitionedCall/Repeat/concat/values_1", "PartitionedCall/Repeat/strided_slice_2", "PartitionedCall/Repeat/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "N": {"i": "3"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Reshape_1", "op": "Reshape", "input": ["PartitionedCall/Repeat/Tile", "PartitionedCall/Repeat/concat"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/depthwise", "op": "DepthwiseConv2dNative", "input": ["Func/PartitionedCall/input/_0", "PartitionedCall/Repeat/Reshape_1"], "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}}}, {"name": "PartitionedCall/Identity", "op": "Identity", "input": ["PartitionedCall/depthwise"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/PartitionedCall/output/_2", "op": "Identity", "input": ["PartitionedCall/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d/Conv2D/ReadVariableOp/resource", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "128"}]}, "tensorContent": "57aPvbcY9jxkp789pM2rvT/7yj3Sdf28I/SgPUCDdb0zHHK9iFJyvdRhuT2uTcA9dHWQvKHhhj37us081WDxPJ4wiL1aFRI+WJyVPL6xP707wU89XDj9vHZDqryisdM9pQm/PCY2AT491UK+eKUCvW4uQr7sL0q9oVTDuzSApr1Bk4C+z5Jru1HtkD2fpiy+RDYqPYKx/z0MhRY+aRwKvmdGxL30jPs9kISSvLM8zb1wVjc9oDW6PTC0ab7BT+Q8r3WiPXzsbT0OUyE+J+RWvdGU+T042cM9AiMdPcAJWr7cJCy+1G4Wvk2ZPb2DdV48XuPMPQfambwKEFe9n8jEvQfkKj6xa4e9gLPgvfHO17x/4q891kWlPXr/zTvXZ5G9uAfpvNZc/LyZWea96K9FvuQXrT1jDvu8rm5bvueT4j01RzC+aTLUvavw7j0BYUO+oju9PKIwOb53zZc9VKhmvkzttb2Z/EO+In2UvFboJz7OotG7QWC/vXt1ETy4AXO+5ukVvXHDB71n4MC901xJPXt7Tr7FIIC+/pwZPjup57395Nm93RBKvgJfBT4dS9I8ZheJPQ3cvL0btga9vq5Rvp7rk70kgie+yaEAvgIiPL3Nu/S9OBMEPmxezbzy9ca9wWIUvp10ob1LZxu+yTMYvjFg0L20rXk8zdIkvvIO8j1FO7k9CQEDPTYD+j1wxSo+8YmAPs8PAL5D8QK+iCqRPo/2Yr17aAg+wZUsvrZddD7hx+C94u+3PYha0DzoqlM9UUHXvbBOnj0GbYa+t5ALvorFYD4wvu268N22vWS+JL3a1U69YZIYPj5ujTtQ4hg+jXcyPmpn9T20OHe9e10ZPgU6Qz43MdE8YH7qPFamAbyG3/49VuaOvUVWB74YfHW9TOrAPv5Zqry8gIY+mdELPUABOj5MEua9m9XgvWVfhzxZ9Bu+U7puPb00kL3eNf87JW9jPiWxOL75diQ8CbryvfIvK76ZHiI95NWxvdQiIrz8SoI8LzgRPsWXVT46amI+AVsjvvQpKT59tGY8EkjlPP5qIj5oM0o9EIBOvI6V+z3/QLo9OkwXPjBwrr18Hje+RNrHvFZMPL7BP5s+PeL6PdHcFD5n/6q9aIUdPtSU771qMDC+1Y4rPomhCD4t30I9k6vYPYghkT1LsRg+oAYyPg12LT4DG0w+f71YPYfbD75Qdym+5T+MPPlyFb2qmbc8AkD2vYxBCr486BS+bhKVPtT6or1xC0K+ovmZPVLN5TyBGJU8NFtvPsMDSb59Pso9byYiPjI6tz0WZ689lJqFvSBrKD6NDy6+12G5vdkN2L3oL1y+KG4Xvj20Mb6xZby9nOB3PSyPBr4gD6E9fItHvtYkFT6+5Tg8yXm/Pex4Cb4ialg9dPIFvvomdr4HXYi+FXgbPRC5gD690Xw+DOBWPq+0crynR4Y998E7PraPKD6fKhI+vbZpvbEjBL7xWE8+jzexPXZqWz1rvh+9t5OFPRwN1jsvBca9gVsjPnRKnD3OeOe9uNIRvgvBPj7zuRO9dcesveTDRz45I0q+5+E3PY9SqD0zKuY9RpRzPLwgib7yyUM+3ysgvmz/7b1jA9e9PBFCvl9mbT2bCK89Plg4viaQUr3dqKc9nk81OxC8ET6c2lc+5GE2vh/vT72ZPUi+w0s+vsGesr0HaEa+gzSuvo33Kb6pzdu9ec32PN2pZbpSuz89TVzfPexE/T0IgBO+E3MnPY8K470TiRo+OmTDvCXdFj7E6V8+cXGKPILeJT53Yyc+c4imPSfQ/r03tl6+u4tLPfcd57zLGtg8BQotvZDBwDyb/eS9NzVhvM0zS73YMIu9NiBGvfjyjr0F6Eg9QlfnvVMHBj6rxQA+KUwXPgie1zwTsFW7JbNuPkrY2r3id9Q9YwIbPrORRby0dzw+YmbxPADQLb05e14+XC9FPt21sTwyL/U983a4PY8IEb5eXSo+o5zcvLGnNz2H+z29WQCcveg00T2+9o69hzVtPe1LeL3ch3c9jgBbvv4qujwf3oe+FOccPgTsmrqoNQU+6O1IvRiYvDz234c98TVyPF3bgr70GzS+CUFqveypCb4PH6k83HNIPC9pKj5kHyS+NHbcPT0XXj1syjC++NKRvRjiEb7h97g9k48YvkMWV74ZorM99qP4vd5m0DzuxYO9HdKSvKESEz0yyCG+f80jvqfDHr7iWx49lWJQvqtbor0kurq+n5XwvWjpNj2QIBs9H/0GPfIIKD6Oyq89kyUjvg+RAD5a/SW9AESaPdNJFj7rJ3o76+vUPMnHCb6A6pI67dgYvgY0mT2KLPs9twUwvo6wGD2IKQQ+EG/KPef6Rb7G+t49qKicPahdmTxThVo9fhn3Pd1jEb7Ckyc+khf6ui7CkD2nlIU9jjcCvrcJib0NWeS9fAo+vkTNsr3jsKQ64xLrPWCBvT3ogUq+Edt0vh30B75MqhW9YP2TPT9o+b27bbY82n6WPtbt6b3NIpq9udMbvhHd7DziIe89YJZBvsjWNL5yEiU91v3hvYAq9rpcb829lhkOPrVWmT23haW8EbeaveMg2z044b89BcHiPHufEr5vRVe9KHpyvXFI873RoPQ9MttzPSYP573t33S+EVCZvZnLtrtYQis9LPV5vQ+B8L0eKKe92SMQPXufyr3nnfg6J83zvVUzIj73BK09Xc9cvWq3IT7Dvf89e0sRvr5s9Dwq3Ww9IGgHvdE6G72AfTC+SEeCPhNkpT1cPv469KYEvVrrK74MMHc8DVbkPF2u+Tx2hRq9ZpWLPTR8gz4VLr09K8duPESgib17gGs+HP12PWJUWj5StiS+3csAvBaKqj0HawU+fOSSvcbHSj5IkJ88IUeNvYtOeT6YTFE+l1A9veLalr2uXFA+WOSpPaMqv7313ak9SnmePb3K9bwFO4w9nE8iPs8R2r3ACY0+bNIPPuujQj3TJ3g+JFeQvtfIX70k/Qw9lV2UvQ9+Ib5qUG0+zw9qPQJWbr44uAC9SlvnvEc1Gr4H4mc+BO+juxKjWL25DhU+/FEOPqyKdb5csms+i+vRPbX4fzw6q2a8FYkzvv/qCj7b5AK+BEYZPr4fcb0U8ga93IKoveiPvLxhZ549o5wIPAyUcr50CDa+hnl3O9P9V75AY7U99a65PUarRj5HdZO8OJtQvYVoK73dGCy9uanyPQ7gAj4Sxbc9Tr4EPrdnnL1FxNM9T6g2vS7Lpr1a4L88vHXvPVfqqj1Bl8C9Cq6IPp1AyT0m/ws94/kXvlxGOr4NbKQ9dpa/PZJaJj5fyjq+y70yPmpN4jwO/sG9Zjc3PuFypb3Bg9A9quc3vWQJkTtdsaQ9R9CDvrjSLb3Ytyo9xgO2PRON4rpnDFO9/OgjvgPe1j3OF8a9X5kGvp8R573Acxw9SL/CO8z6aL3IMWA+VfVzPsqdYz2KQQ09Ls8YvgxoILyXM4u9BCTAPK+DQD5kIJq9dixgPkVI1D3L/cU9n9xRPap6/r3sY629W0exPTFxOb4rmEU+iu1FPn90bb6pTmy9AlAqvmy5Yj4S81U8O7hhPta6rz3jbM48EgJpPtjpsbsW2n89TTz9PEqTHT7yF8c6q5pNvm1Jn71zmos+tLiHu5hqT75TgJo+CRq/vfe0pzzczPA96D1xPCxt+z3CpgU9R7GgPfH4Hr7qNpC5mMUHvSAJvDtQiu+9GADmPTXOSr5XQR2+5Z2nvb8AGz5CqVq+TvKRvg3ZXT3aGTu8wDOOvT/fijuCVru9iV7UvVyc0j2aAwc+M1w7Pgpier3XMM09mGLIvdKPDb25iQ2+7bNOvtzE8TxaCKg9xir8PbTQIT7ZcxO+kxk5vlI7Yj2zZxU+XW2Vvpf9lb4HeJY+XGwSvgpbBT14QCW+0TZiPrsKZL5yiGs+08pDPCvrWL1Eekc+H/7avMzeKzymED69rVYXPWG61b3MPUs8wa2CPSes97wOXRy+lj2APg3/nj1upBA+rfBFPrXaIj6eijU+XQ3yvRKJwr1dTX+9dnVFvsbyFD7tdfm9njdPPR23Zj785P278sz/OzV6Tb1HGeY81R5jvTxAYb1TISs85cZ3PXUp6LyLzom+vN66vZFMM70TXgG+Z9kCvYME/7016ia8IB5hvTBYLr0B+VM9Y53vPax7+z2Y25c9ePxAPUMML77hixg+y5akPXPpKj1tSFC+njyIPFut473CCZg9+cctvhVbIT2kO/w9EeRAvG8AnT2jjlc9sdH/PYqmar4GthA9iMwHvYcXwj0BKGS+HgVZviRJ5r2MmG89YscsPtYhK772P8O7NoUiPsxfZr4DU0q97J48PVmj4z3/fR69UwcRPpw8yD0zsh08sqd+vpu8ar7ePiA9xP1XPhYfCT5ZUFO+pJBivTVI4z10YB0+JShWvuQrAL4Oxke+lTHpO60YSz5u6qo+rQ6CvkePE75XaeS8mcqTPSZPAT4YcB0+gvgiPX+Igj1LJy4+AWkbPdAG672feYG9afRvvuG68L22qN69rhHVPd46dL2+9Rs+1YLcPfCUer5tzMm8qIX2PF87HjyCj5A9NBRDPoSWwrwcsiI+vBRUvTCuUr1Clwy+5sYXPdHm6r24Dhk+nQB7vaZKDr7LzXi92izyvdDr5729MGe9U3QbPsgqIz5lI7887X9Evua+0rw1LYa9EfvTPXAfxL22fSE+5mIePnvatD0wg+O9YA6oPRr3Zrqgg5w9qN/yvSyY/71iKXE9BeWHvZKktz3FVkU+amPOPbY0Pr7hTDS+992PPXLQ1L1p5zo+l1FVPuwMWLwWpQ4+TCSuPQP6gL4JFLC7a5V+vRK5ET5QYEQ9F+G6Pes8jj1lbw49fqgrvqW3lD0cS7s9TSRHvOwhIj7U8hu+aWOVvQ4YrL1KnNm9RKFfPu5Vlb0BQ3k+ZzWePNIKyr3d2oC9k+QlPggCpLtd1229iNRXPqzSBz7KUyS+cC7JvVbOmz3+yZA9Dljru5kNND4PfCi9lM+NPp5WDj2Dg/O80hVUviUEOz6u8F69sGBaPSVUPjymlzE+BqhFPirnT76J+UM8FHUFPdIJwb3dleU9mgVPPUuN8b1qyPg91RaPvV3i0rx0dlo93g7BO9HbQT4sQmw+x7RHPjOVUD0UOoa9NshXvbcyPL1LUyk9X7E/vdrpIr5btA4+Qm2lPQhNDbuSOiq+ObMHu6tx+r14PA87dEETPQuSDz7iHBW+pN99PP0OQrzyZS29UAKXPnEMcD2kjkG+5Am4PVNwH76AJy49QOnbvcqeTj6je1M+1QdIPcwrRby8diu+vNxjPoJIRb5WRNK928QMvkq+oDzItIi9iduSPC+dKj77+Ra+O/IFvBgW070a2Bo8Zxu+vY0VJL7qVvg8JSxFPj9vWr6XJ0i+blFDvgVqmD0kq1++UAdnPY27zD0Q4Sa+LiXKvKqGxr3a5ow+oVdjvI9kOj5niWE9ixEyvpKMwD32tZk98jwVPsrkKT7vqiA+qhZYvsL9gr723wQ+Yhn3ugm8+r0a3DQ9yUwAPUHoq72xiWQ8yvr/PXcoST7ckHu9p/gpvqsiKj0WbjI9DXO/va8NCb4AyjM9p2rdPb8Lcz5KVdq90eWGPvLYZz4nsMk9X1/HPCk3/z0XJIq9JUChPRgYbz2ZPmm+Z+8cvhRweD3Vuy4+h44EPW18MD0f+aM+P/nOPHTwfL6LZxG+/3gAvnztNz6KQw4+jsNdvoMSgr7CA7O9/luXPoO0TL7CMpi9puByvkXODL4Fefa9c145vD+vdjzOOKO+APzIPYYLLD7sPs09Om4CvnyYGj0QI+G9SNL9Paj3I70wKBe7GjX4PR6NJT3wMnG89Dfdvebp6D3OKQk+qRY8vT8T8D11Nio+HTTbPUpCqDxIdkK+UK8Ovt/wBj6BHt+9mWNdPde0Fb7xlqQ9WtFfPUtaHz2O2rM8KD5nPj2VxrwWkTI+uAroPYWe/70RWm29mdylPdRE6D3WZoM86pzbPagFZj2NG9E7a1YovhHS+j07hgG+9N7sPfpl172JzKk9LhrMPM5gcT5bMWO9wGR/PtFiWL5A5xs97JlfvtgoBL5d8Oy9UHsdvcIqwD0jCwa+rHWtPdqEXr711jo+MMR4vrj5Hz61eUW64Y+1PcupMj4EnIm+LemUvTS1sL04g3o8hSwFvmfHD719JQW+SsQ2vboRTb7mhII9EvtFvcbyc71EZYW98wvnPYnzTL41nBa+jaDovNo0iLz3eyC+AW2KvCX4f72mm9m8S7FJvZ6aDD1gB6+9A/wRPWHJk73uT/I8/RFHvXuySL6ohAM+96pBPYi4kj37tWe+CPqxPadCbLyPgtg7sb/8vM/rG748HXu+IXWcva10sz0bsM88+NQJvojvh71Wagu9HrGUvVsPAL7bWYe90Jz+PeccGb5hJwO+ybmgPVi4S7zfEyy+/3JGvj8rID63Hjq+h7gGvlEYd71n05o6l3ajuTkxDz4udzK+srEovrpI1j3qU/48plsGPTjMYL3RMyu+whyhPfGOBT71YOA8CSNgPbOKhrz9Dze9yoX+POg69b14onM8pSpVPRtq4b2YUva82Yj7vblQjz2KT7M9XmugvWBx7j13tfS9ts0cuwi/Ij4BMR2+/gSUPUqtWD3cC949BDGbPbLYK74Fwb88VSKlvX7Lbb4sdei922a6PF+DGD7fmio9HksMvto4Ir7Y58K9SRUrPuV1Ob5Y21o7UICPPW2/2r3TbQM9TKiIPfwPoz0EDjG+SU2wOgiXs70Dgic9qrTdvRYOR74fBCg+5OFAvm5sgb0chiu+53fNPd8TsL3mnd69Dx91PZvvDT2uCJQ9iN2Uu38JOL15nza94lqyvKniYz3+/y4+V8SXuqbFNT6VbWa9QPGfvS0K2D1qJxg97COlvUhpbD4I5RC9XE4LPrSJ+LtilHW8kIM0Phi+4j2QyQa8DNi0PSuPZD1umv698Zr3PamIYz7rBts9ljbNvbCt7T2/sHu81OURvqqTrb22ozQ9gew+PQ1K3j0jU8S9Nd8VvQ8ux71IwDU+Hc7XPc+Igj6BaFQ+XGhFvvm6Sz4N0tE9fjVZPZanWT5Vchw+/zoAvqjdIDu8aSS+/6CyPOe7qr1XGQY+1ag4O7ykeb4KZoY9Op0qvgwWKz7l8uw8pOyCPTettz1fQWK9/tFdPqxxpLzExDa9TjKWPeNuxb2N9L29taHsvVwsrz3hWRg+d+cGPnn6Kr6AlRq9xxDGvehmNr7fVpy9rorcPQr+073MnC091pmGvD+kAr4c+hy+1UATvUbUib0KKuu8hcUXPangJD4e5Fw9d3UpPgCgEz5m0Y69xj8uPuCBOD4LM2U+0otBvHiOOD6IGSI+YnIVvtiWyr1qFQa9ranEPB6V8r0Gy2q93uxmPUqFcz2v88k89R9rPliHM77L9ik+FancvJP+i750mHG+lLR/voodmT25Wwu+0BaQPWqVcT1zwh++vW3RPSmhKD4QX/a9Q5jGPSZVKj56lAs+vFITvq/3uD0mh2w+D9a9PUHw7T25EzE+Xn2JPQlAHb5AqUy93T/AO5jNqL2bd8k9dBkqPkCxET6OUhs+lnCwvcfFTD6v9hQ9tp6jvHIFFL44PQA+CPbuPXPFar4fppq+zfvUPBsKkzwBdIS9gZStPiIJVT5lsyE+N0Vkvb+Gjj3iIHA+chJ3vXn24bya1b28MXwhO0kXtL3AcEU9mkv+PYlu0Dx+pCs+8pgKvsn50jyc98W8qrqWvQJf1r0d5Q4+dGb8vWwB9b1gfgw+AJJRPRQKPL6G8iE9QWCfvX1k07xT7jG9EwVaPY+MoL2A+1Q+GZ8+vsNpBL0p34A9K6GmvV9QOT5l/HG8bHMoPqW6wL15my87FRWrPSekTz3wjsk9U/gavgANEb2MLjc+vEmDvbuNRT57oBA+buGePcdIgT2uTM69hlF+Pd0Ykr1dqPE9xdT3PdtI1z1SZ327BH0fPv26kLzFb429gROdPLilgj36/fq91swRvosbRD65NRq+zt0CPjXGDT4U0Do+cXZIPqneJj57Txo+C5ozvjGI1LuedRA93Zc2PaS+Ib2gwOw9s0lQu0aPJz4RVzw+qiMMvicIJz15cQa+vIdnPeiwQz451A2+9/T6vAINu709HSS+EAEkPlrMtj3Te+s8p0L8vO/kRz5hyXW+muY4PtM2ab3SAII9Y/ZbvfKLTD1PtrY96bFbu2XP+LxfGh09lvQ6vSK4e74A0bs7GJ83vYpML713DVq78NIBPte/qL3Khm+8VA1cPNjdjj3Vxgs+lpKuPWlfn7100Cq+DsknPrKvvjyw4549IQM2Pf/pej13Z308J/rMvJIcDj75gLw8TkBUuqtnvrtHFoc9KWglPqukF76mSL29KvlKvucwyD2KMuS8DS9JvKcsx71kRty9vi+ovJUxlr0J+Ry+3KOrPeilBr4jVgM+Q6byvTamWDvXXBA+6+zdPdsN4jznsCq+iqFAveOpsLuon/89ol+dPdCMqrzQ3/m9MsAhPShOZb0/ygS+tm0HO7C6Dz3QcUO99M3VOmqRBD5DOdm9ddfovDLegzr7nFY9xai/PbfbWD2hMfK9whyZPeNOE77ob669xnNfvYDDBL5vhM08EYgRvh4NSD0Sjcg8UOwTPjpc47vc/L690mhuPXisH71wkG29nhnzvT332L2IkYa+dI3yPVyQtL1Whd48AXj/vNTqlb0OpkC+0daFPa3v+D0oZ5u9mOuOPc3WHz5AnSU8OuymPfMIqb1l86u8J8O6PLEu0byE8so9g9E5vjGHZLtVXtA9knhZPMsz4r1tqas9TaADvpDJyz396Pg9Po04vYlSI75aXme9ovYNPgVUT700ig0+fmodvmotGr2Yvwe+T868vjk1Rz3naru95bKEvSxJFzz39tk9jg0nPm+yjL2xBVk+oHDvvXV5bb3q/qO8KAIxPooqGL0pCuY8bsRKPNoNKz3ZrQC+6PCwvAcGib4QxGu9/c7bvYE58z3iJLu9rWdbvih62D0nl7W9Z5CWPYxkLj4msIE+UZ3UPZGqBj28rRW+ijC9viBiXT4yD/U9d5RMPTKGpT0mnRW+U0SHPuVJNz75eIG8WZPRvjfoYz4uI6c+NEyjPs9l6z1TZwQ+7Gr8Pb11Hj4u6kW+3mmOPhXCij1XUwS+wFnEvNbXEL5Lqw0+sqbTvTL0HLz3rVo+7IpePlG5RT5/46c8DwxLPuaair161Bk+CKHuPUW8pr5srSI+jlOBPp3QE73u4r29gNAhPnol3j1CtZo9b06zPMloOj4zQrg9BogjPgkN8T12tvc9KG2NvQGZir4fnwG+YcbgPsEfBr2WNJI9wSykvQ9L9T0uwQG+Y5uIvFowab5EwIA6kgJCPsmpPD32ikI+q6HUPesi6D1VtxU96ZodvplWFL1Bd/u82hmwvhxLdz28Oyq9IzTpPPTsJD5p6Kc9n8CFvV9zuD2vaFm+WjQ+vXJ4JT0Gcc49WnjoPYihLj6BxCC+oX8PPWm6Wr15XJa93AsuPsYnjT0E0zi+Bf9DPN36hj2HPgc+HmaDvh4zlj1PsrW9HvI5Ps5kbr44+6a8ga/1PeWxY74+zoE9YPpgPlGhRL3dzQy9BR7RvUzZHT5/3WC+sHsYvFDpArw8+mk96eYkPfGz6jw8kFa+rlz/PJ35CbxZ7QU+3oqDPIOec7wd2xk+9QLNvTqW5L3jJ4Q+NBaAPdEViL6Xbf29j3ZzPdT1p70F6iK+EvAGvg8xl7ybG2W+4kKFPVYxlLzCila+Z/Y2O1C73Tv9MPO9wkgkvRc+Kb1RJhC+dz5Tve4BID1rbaI8l+I8PqDA4z3Pj868MKBJvsL8Sr6H9e29/RbWvWStCz5VipW9IalFPp4hVr5ohYo84/IkvQRaOT0PwFM+jVqcPH7Hm76Evso8xfKIvfLg1b26cf+8NJOCPY8YzTyz96U93hIWvtny2LzluMK9RBklPVOLIb79m988Ele/vf1yO70yIqM8n5GKPEfUFr4hTq68wYczPnrM2L2myY695JOJPQz6Rb5/cSM+fC4Jvm5RLD6HfnK9zJThvVzSJT5SRpC9v2FPvqzanz0YM5e9mhmlvSb4S71imz0+BKy6uwxzsj320m08bViHPRRC9z0697C9iJDMPdrZFz6GOsG92aZKvSuLSj4IVUu+6FvcvaUL/70Xyni+I8AePp/gMD4QFuE9To9IveLh7D0OLZi9VPZHveoiyTyMcVU+CSAcPuAspjtK/t09dy4sPXcFnb3n1bW9N9DIuxlRm7wvoKY9AoCOvYLOg71SK0A9qArUPdPF8z07i3M8sk8jvuE0LD5Wb/y9I8bAveYr373jDoU9bxyHPBSYPb6ya2u9EB3ivYWclzzdrG29ZyDBPIpTFr7W5h8+gXbkPcTqsjs0KbC9v8Atvq/bCr5mHsE8QvsJvgXs3zzohUE8XN2IPd4zpj04qiw9YpW2PcccBj0N3Iu9upepPYugDz5HH809JlXNvdd/J7yC3Ty8yekjvqN2Z71vgjS+MZdTPWmKIj0VFow872BcPbSMCr6gzEM8+fnsvN2+mbzbgAU9xR2oPVeEEb78oau953TUvVMsSr6qPI09aWhcO6wAZ73AoEY+7skivtZj5L2n/Ra8YMaUPM8jD76s406+uPqAPVvQSb0P0Uy9dMgOvtMIhz1KXUg+0xUhPUJWKb7FX/C9Gg0fvmF4lj0PS5o9qDqFPTzl27383MA9qZIwvqSX/bzvawO+VYvpvU939T2oAaI9bTgLvrKgdbzU01U9NZuYPTXKFj3g15i8KN62PRH3tr30pso9oaeivJaJsz36O5c9dkvkPGKDYT33uXQ97FY9vQos+T1cTaC8z2iQOZ/HN70fOd298sfwvLnqGb6coc48l5N1Pe8Xuj1b7Yu9LSTLPRXOBL78hfe86or+vFFALr4YkAe9P0XgvUsOjL1JkZY9ZVgkvM+RhT1E72C+7tApvizJS73HsQu+fi9CPQnUN75K7R++dEoLPuGIjL7qiHI+aWSyvOgB8D0LPkS96mCXvaLO+r2iHnM99tiTvDMDS72jl6++WFVMvYNr9D2LCz29zvgzvg7XJD0zfby9U6vtvdEY2j13hW89Yc5qvpT/7L4S42G+ah+ovUKDIz5oITi+3ZCLvgHT9bwfH548Hq6bvXtr7T3ogj++W6XUvXzxET7beoC+453uvdt6NrxHZpK+DH02vM9OLb2BJkI9l4y6vc3aIT7wU6C+BJf1vVFyBj27OTk97LoYPg4Hj76Ka42+G84lPppQAL79RCk+JzuOvWLtZD7uuDW+UwjevbZgob4W01U+YtRkvsrMyD1uwgW+4aKUu8OwGr4AfFo9cZv9PD+CiL4fOoy+WZ71vFObSz4AE4I95gQHvYvGCj55LZq+pWa3O+D1uTww6Yi9xvjtvSTGsD1OEgw+HXUHvqQa970CTlm+dH07PpUgNb3GMNq9JboDvpmfl74nX6M93MsIPt1PHr7wjt47xzVSvjOdNj3E/BG+n0SDPFDtir6k4O++xtS/PHuLMb2ho5u+JUH8vZcoSL2GoaC+f3movWFaCL40OPu9rzn9PXzQDjzAbak8YVibO5kd+731R9k8ZA8MPjpSir6RA5K9mW06PqmMjz4MS5q9+UgzvScLd73g2dq95CYKvhA6ID7bBCU+bcWZvqKUDT7efEm9A7W3vm5oFT4GKH6+8bI7vveDmz3S4dO9BjmtPAD8Wz6jxdS9DUqQvndR1L179Ga9h1+GPXL/jz5wh1A+GHg6vrBuBT7620++y2JAvs64qj7klpe8BtERvc75ET7DDjq+QZhdPnA3lD5VyzS8iAkFvnJbwL1ajYQ9Y1kQvc/1l72JKk++xR8PPhdfrb3IYki+EzL9vbA16730XF4+6J07PSAhXr4jg5m9OPDKO/6jmL2sQtg8LsPxPQGAnL27D649BuGcvYJgobsjbGW9D7r+PcVVJj1fc12+aowAPfRG9zqOuyY+llyevUk0dr1eXP29+LKvPVcoTbzsug4+uPNTPoSqXz7Qrcw8V/kePsaOer0yzBS+ABiGPuHpGz5/zl8+EeF0vjnejb4Erog+VBZTOw85vT1iyfm8L+NSPdqLLr7dIGS+iffBPdFgs73x3jy+5JpEvlV74z3U0IC9xebWvf/MPj4+giI+WHCmPVxPhj7PCiw8enVmvkb6lz4kIIe+DMiavlfeFr5h7Lg78sOJvXZFjL5/ql8+dLJxvlKtBz4fajy+SRSwvkcHIb5an0U990gKPhp3rr2Vr+k8ZgwqvilApj1pOQK+ehc9vkGqqD2QGOm9ZCcwvmt4Eb6Wh+K9M6EvvXruuD2wOiW+ubkZPT0qIj3Yris+osHDvTURsLv248m9mjzHPN4coj2cGDm9gRUsvUEiLb733uY9EqJ5ve6gZDyqWFw9S8edvSMbM76mGwc+NrkXvgk+szx3byg+z83KvbEmUbxm2KO9vEGcPUvrCz1/KTq+Iy5EvfKBFLxQspg9x6QXvaccrL0lkES+8XpjvoQTw7yu/+S8Gv9+vQBK6DxBoV49lM20PUVGAL7yu6y9VvHkPXhBhbp3BAu+3/ZLvB2u4b2yfeW8Na3EvZ1ty70wGJM7PVWNvASEkD3S3SK+5a1Qvn5XjzzMxOO9nSfqOxDpC75HGeS9Y7mSPJDqsD1Z4bS90JzwvVWiAb59ozq+DlEQPaqF9b0LKtW95n1NvicRIr2+WQA+krMKvcefcTxshha+x0XnvBLboby4AxK+BxSkPcSForzJGbM9l+BjvmXv6z2+TQi8ChBPvu/nDT4+5u06lTnJu8B1xT0xNAS+uuGCvdGKyz2VFma+nRk2PcPy/z22k+U9uRrWPdcO4ryNmCU9yBHcvUybXb2XZLC9gDulPdcs0z1dnv29Z0QbvqbZMz2pLuM9U8lzvVZ5X73MwCg++2zyvTHd/7tHm5o9nfn9vQyPT753z7I7WSK+PXQ/pb4qTYo9/hTJvbBI47y63R++JN3KvG5+nj5VudA9EdOZvmRK3T3dXay+kgEuvodCz73pfDA+zg8Rvk74Dr7Hwzo+LvgevjlcSD53gTA+ffDjPY+lxbwgf+a9hjumvT5NnL2GQmo8UWDuvOvRFr4VqHq+KFkWvTua7j2heb49peOUPUDCJT7mzAe9LMqTPVE1ir5S8kM+feGCvWm+gb24khc+vIOVvJ14uDzomD89eI1buhn+CT4zVri9fRa2vNXWHz660Do9x7NCPK0hZT4yJEU+bNajPdaptD7FmMc9WAxDvPRqMz4pS9U9Q+UZvouFzb3+LDy+4pWlPQdvkb5LCH6+qauIu7cZRr0iFYS8B4yEvgW2Ij1tTtO9zKNavq5TSz6HMMq8huxevlDDxb0UYiK+YRhIPNdt9r20Cti8pGzEPVcn8LyvTMA7emPxvcZGGj4oxLw9l8K9u3Of/j1uMyM9XvmCvlzUdT5Zmfo9xWgGvj+mmTsEcyk+8fGMPfUgkb3OIUs++dpivNP6RD433SM+xV6PPnFsm74zrys++kaAvXrGl74WPhO+ZpXZvUVoz73uZS4+qPM8PV2PFj12FpW+UQ8GPqjGmb62/xq+/Ao2vfQrob4e6VS+QIlVPkdw/j18Nqq9pXblPS0jkr5b0+E8OwiZPdPoR70nBi0+RWRjPUNHsz7epI89JQC3PWwsAj51hVE6hod7Ptq8lj42WY47Fa+DPmNVEr49mS2+iGsjPhz7TD3llsG9A1p4PkQEDb7dZxK8uIWIPri0lr0PpIa9HOUXPkplJj0chwk++TjNPWseejuYvIc+drgoPEiSsD6zeYQ+UtzhvbXVdT34aTi91o89vn1gob3C2F4+hXkTPpJPaT6aRVW9uDglPuS9DT5AqDe97VdYvvS8ob01wvi9lMJSvuFovz2bseu9hjW6vTWxhj0tc5097FFvverPcz61Khu+SpQEPsFsuL0MPcU9ImXYvYZP2T0uVPU6rAoMvPossbvfNDa+aCtYvkZnDb5XrNU9PpSpPY3sTb6e/wq+EPr8PbUYvz2shxw+dd1GPg8svD0/Fne9S+1bvEQgTT6AAZE+9N3jvR17jL2PV+c6++N1PKWMjz6ZGDa+izU6PkUSJ74eEok+JLmDvfzCVj24mJo9Le0kPfNnrbyA54q979J5PN7jRb51q2Y+SkkePukgNrzvUN+9bzITPlLk5z02Tb09/2MOvgw5Gz1c/PG9+bHEvSB4Or790vS9WOJPvoP3oD3cLQu+VtmQvfPED76OExI+6qwPPUCFkr6MrQK+RnayvaX04r0UW+G9WMT7PSfHsj3W1f69JQEcPvJDBb0KKhe9mcJNPs0QBD4QPuU9ZWLovRaVwT3+LS09biZ9vW6uN745zj4+jwqTPVwAYj02ZcG9XAjtPDUxor37+769k/LdvaSOJT6ZuEy9JSAEPVq8ODxtmg49gA/rvcAr8r04+C4+y8VcPmh/nrsitWS9JLxPPntWPL3I8gg90zvivSSOhb0N0Rc+5go6vbyPg71p7YU9N3IKvtkNtT3hf0s9JUpiOF4IEb7vnAs9VLUkPY4YXj1tKWQ9egaYPVBJ+73YqYk9FvUpvgWrPj3GoLU8wVgcvtDzUj75h+89DI4RvgnhEL3Wjl09SeEevgQ3Nr5hkyC+a8rBvVRTub3VSUa9Eyv+uwdm/L3EC7w9nuFXPUFkEL7a6Yi8EppxvQ43GT7IJko+fw8BPXBChT294yE8NYSNPtns1r2fvtY9a7UsvR+Jur2n4hS+CqYSvou9oT1PoDk+VlMSPqWcrT3ALQ0+7hxaPvf6FD70lAi+2ivCvdIRpDyeCuM9faJYPIKJ871cZeU9N0T6PQlvgr3nJdC9zddGPSWE4jznRpo9pjH5vYGH/LtMSF+8Y8ouPkvtqj3bnai8L3T5PfjvJz7eTBg+yYQRPmXcmj3/NE++oe4hPlP5Bzx32gU+5ePNPdlTCz7jSf29dOTevfpxOb17gQe+hCYyPoVivLyt1TU9S9UCvm+DtL1Ixwu+M2WRPCkgOT6Ddwm+yV8IPhwrHb0JBn09e08EvkdPrz2GzsI9wvtGvouMZz1kYrY9oLy0vRX/Sb0vZa68xvkqvurA8L2KERY+f8jtOwhypTthzHc9BvfiPP0LULyMGC++o5iyvXi7Hj2ZvjU+UzJlvc7kDz7RyvA8KS+LvU8fgz2VVtS7mek1vkxitb0i6UE9Z5owvtK6kb0WycE9+wjvvDVSpDzyYbs9n9gFvJWDFr6kH0M9FJJKPZC3U77cJZk9X1xePZ2H0L3nPki+NDlMPr22XTs9eIE+1n9jvlvRtD4oXw0+s1DUPWPyozwh+xw8zOPgPJXthj2WHg++fH8kPbLDCr6IddW9c+sqPugFPL6noZK9hJzDPRQkFT2juEc+pvervK+qoT4A8hU+ws0VPit2Vj3lgZY8J1EDvVcMnz2W1Re+yqRcvhO3jr7RQYS+ivcqPj7KP76XKts8+TmPvuuEQT7+4i69qDmLvOzAfT4lTxc9FWbXvR4EEb07PzA7iCJwPaxfiL3nzo09fXpiPQsJz71G9sQ8fPoVPkD+Nz4xQqO9YbCmPSh3yD7YSIE+j89avh4tMT2fYjU9ohE6vnXnkr36ng8+0PxdPUMBGb4zwWQ9wphEvnKyI72NQWs+0KkbvgAtFL157Wy9ljGSvYqWnL0aH2O90TDyPaWmNr4NLEM+wWTaPToOdz0sw4u9tS1IPlPSRj7iSGo+hSwOvXmdiT7vHAE+ADScPmyGmD2T3P29P49JvUf1U74u9Tu+YLvwvKVcZz5leyG+FJWUPYvpiz4oHpW+bAg6PvqWILyltDi9QTAKvoLuS76Xc6s9LKmMvR5axTy527A8oeuUvnGy4z2q25e+68FzviDiBD4LtSI+gdbyPd2tBL5IIDI+sLw/PkbrYj4+BlI9XMCtu9DahL46ThS+Dwd/PgSQTj3fWCe+FX1ePNGO+z2mmCQ+M4ROPuXTED5YOCy9dR41PWnHnj5BP9A9+paavZeHgL2KXu49WyomPge7GT3oUiK+iuyIvQkYsL75bs49hWFUPo+RMz0lTl2+mtgivudbEL7Vtm8+wa2RPm9oZr1fd0K8QnMNvY6DmD6P/pS8jNxBvZL3Yr1fa2C8RiLKvaGhDr4yuyY+sDFQPgxVHz5diLI9GjpBvWhWiL0BlRI+el4NPvGjDDufvpC+Z9m/PX9axjxPOcu81nxDPtBTTD0XrHc+RXFBvYs9h72BzhE9iLxhvl70AD49uK48m3laO8twAD5Jrk69C4ptu6pGmz7+H7W8UiVOvR90Dr4e62+9ciT8Pfs7Dj7+9Ei+H5DyvZv6iD1sQX08hAtOvkbhDL4KGDs+McExvutwGb4zsS8+r6kSvlaK2TySOl+9sSyDvTbBdzzFebU8biTLvDjoHz7YLK+9/XvdPW1seL6B+gc+1JCFOyrc5bt9r289oCUfPnK0zL2Gxxs+7y41PuaEqDy6wbw9if/pvZQjFz7thgC+EteePSmeIL6TEsQ9/hQHvp4brj0K+HK9meCuun+nvb0rZ7+95MlzvtY+Cz6uSY89frA0vgUyhT1uzGi7bpW7PeS6YrvkvQm+mBdtvY85Aj7kxgE9XZE7vN+b+TzqYea92TFXPXLGMz5Bc/q7Mh8JPa4Kvj3bs0++xFLgvZ2XHb0Xxdi8YCtPvbxknb2T9Sy+nBTwPUO0wj32N6y9dJgmPFk2HL7wNQe+KnpCPXsudr0tPk++53HDuyozkbwocjs+Dy19vSdebb6wOL893akuPgkWgL3xVXc9nTELvlxY+b3LZMW917YYPvTZQ75qQNG9txw/vUmVUj0WIXc9kzA4PUszJj5yWQE+4tTTvTOMBzyoT629/ZHIvTBQUL5P9Bm+PQbcvWCe9L30vem9tHxiPcvPLD1CShC9T64IvUvXrD3b9x++liHTvCJYjDqTxei9alh7O6/w3Ty8RRG+LtIUvuy12j2l4h4+HP5kvV5TWLz6jLG9Y9y8vdnjEz6firE9aLS7vYMFhr0NcR6+v/utvKcK5rpMVLe9NwuwPU2Cvz3t9D2+2bbYPC9qXDvQxh4+wNs4viDNVD0KdI++D/llPB3Y2D6eGmK9zgJcvmrnCz405fw70ftXvTI1BD6B6WO90j46vkCmCb4ioWg+CRIOvmdnrD5YNWc++snQPUMpZD7a1h2+RqyOvbk1Ab4ahUo+C0LjPXKlF759yaq8ybbqvM1yur131dE982KCvpAX7r3WBtu6IEqzPJnFmb5KooQ9UA8RPcAlBz5Z8dA9mXYKvr3/870Mqtm8drk5vaK+r7yrN929+wOSvGw6Rr0uX1K+OlM+vi58+r2o9Yc9cvskPPb6tD2sf/m70xkRPlgVhz22FaE9ySj5PBHTiDtfrAO+T44MPu+N/71yGcG8k3w2PpqOhz3vq4s8RTA1PbWUtT0E2JE9C14OvoVJKj2/elw8r2WevdkOBD6KTEM9lOEEPkZihr245vm70U/yvQ3sr75oPyq+nyYJvgsT9j1M7FM+dCR1PXWrIr6J/jQ+X7kJPdEdeT5Ikwc8YzVgvqZZF7vVjaA9gXarvTBfPTwb9TA+PLY0PgLrM7yeQIU93jtqPsWfAD0Uyw69JioBPRAhk75Lm/W9T6/evWT/DL6CJDk9UkAwPqjzSr5ZxLW+vKBzPsHVqb7g7mQ9Ns9XPFQDF77kMgm+566ePR/WKL4smF6+ioOYvZ0sib4LvQo+oqkzPjpXjL5SOGK9IgeCulMjDT7HhLq8Iv6APm3dLr2ZG149FbmAPpSejD4sdDK+YhyaPGr//j3xOOS9mLhUvpCGtb1BlYI+g8AOvP/pSz3CfV++BEKcvIZkQb5958C9EVWRPZMiUD7Fyy0+hceZvDbfUL6JaGU+h3uPPUXRlj4rbL0+HpqUvtMAiz0mhqu+nsF4vaegJz3iJg8+ppYMPd6iHT4o4Ky9zkp9PTI2QL2YQ7m+1nAlPUkHQbxp8ze+EM7BPWnbiT2Vv2G9ZlFDPrqlkL4vPyA+VDm2Pf1D9T3V15S9mmv8PX5/Dr6ZDbk+2HJ4vlaoJz6+Gck8DuF/vu6vjj6lBU6+KPlCPn6fd77Jr288GlkBPQYA9b2Y6Ya9h8i9vZmiKb5m0wM+K59DPo+Udb59hou+76Qsvs1Kyj13qUA+Gz5EvY5LjD2SF/W9jyugPhemcT4pJAG+yS+oPqHJx7wFNJo8xpmlPbUdhr2syRo+Gnjsu6TCDL5osZO+axz9PQXZiL6NHys8Uo0PPoNpA75Y4cQ9lmyoPT1kqD5qoZC+U1AUPtRZAL6Hthq+e1sOPWoifj2Mi5o9EEcsPY4BeLxMMt69NU2CPGUWJLzf+W299TAYvofsp728v548gxoSPel0iD0fO7i9scHEvUChDDzVXwK+EXJLPg+opD2rExQ8ijMLPvfFnr0etLk96gBLvX57E77pnMa8kn8Pvmdd6j0hy2s8D2mevbORP7zCKKS9aMgzPS407jze+S69EEgjPv0+ir4F+oC9kxXBPV4rjb20c3q9ryhFO1hsKj39TYA8EzGSviWM8L2ORDg9Ag4nvSO+Mz2uukC+JwYlPS5bDr2VxIM7hhR/PWuhmb1FSAi+A8b/vaJH5bw9acw79LYOvSpKiT25fFC+ncs7vjWHj71qaps9y2qWvTM4CLuDxY09n1ERO0FhBT4b9wU+mQt7vRx6t707Cey8aIvzvehrsD2Cmzy++TkwvlSynT3udA+9myDvvSA3lT3E7kg9EhmkPCOHlT1/xQE+hK+NvRH8WD5kJfc9bT/LPD3pWb4meU0+dUL1vKnFij3OHHe+J96/PZ9Et70IaRM+5S/TvZhjqbxhJy695zd8vHzVw73IWia+p+wPPiz7hbrKGUe++0f1PbtBtTyjQww98d98viefZz1U3he+XaWTvfDMhD3iHb09BdJTPYEEaL0uw7m9v52GPaf9NL6dgA++/EKqvZMt17xR/ZY8MD/XPeitLj6pngu+1QoGO803kT1Zp7i8zP2jvfuHoz2VWI29BFTDvcrCoL0kP/Y9SNqPvHVyKT3NJT++u6ECvRM3mb2k5A29emfuPTXApj0Nc648shIuvMmgG75erJU7OAlPPjEXCb26ORo+BFcSPlwyCj09lDQ+60Opvb6utb0Asd09PM9YPgv6Vj1Qqlq+EQnOPWJHqz2z20g+5KFJvsJssr2TkBS+TuXKvU3LXD6ZsYk+Jq3OPDzviT6NEJy+ahVTvenanDuaoko+oVFCPsrcjr5abTK++wG/vVQXXjw++Gs+wO3+vaXNLz5RSAC+wkKsPcrqdb7sHJA+3SbAPWFOjj4/RrQ9R95sPXWUTL1WeSG+bis0PjMftz77WRa8dkGoPDuylb4b/Ei9TYsWvtlJQb1qVZo+CmOlPhfdvD1jeCg+lr8dvRHdHj6yNMM+LNLyvXG/ej6ephC+P3ZPvpmu772xPsO9XCAIPh1R4j1ahBe+r/f3vaOhJD6Z5VU8vBMbPR8WDz5Za/Q8jLYovieJpL53ACM+qLk4PmPfMj541lm9wYmdPgTzMz3cb/u9zRALvmLLAj6G+gS9wnOZPeaZcr6cHYI+Pz9rvr0nQD5rAYA97/SIPhgDd70IpI0+3ySOPsWSc72lmkg9Dnm8vdSEsD1cEJW7hV8NPuc79L2AVz690wIXPloAWL5DaS+94QhaPmUnyb7oUp+9r+kdO27Aoz3hNdQ7PDoUve+7UT771/O9WV68PR0Awjx5gJE9FTt8Pmq9g72XLma+dkJSPrLLmL0AtZ29j/yVPUVHG764h3w+yEipPYVdhT7tGSs8qitDuuPbI75jZkE9f/UKO7vm/T3zL/+9SOHNvZipvb3P/US+tQxzPrP3+701kmW9UhEHPvECfL6nTaO9RIuHPD+qdL5/Er29S4KLPWthSz3kHwM+h2yEu8OdTz4JiJk9ssfKve7z/71bUrY9NvCdPbYhoTs1iFG+PN3hPUPiLD76l20+KW9vvsupTT5wINa8HTMNvB92rL2Lrbq+b4bhPONW97skFlI9IjCVvhZgXD6hKrO8/t7YPZKqDL5wjh89api+vTpjdb4BtLO9yH8Tvt+8AL4IQU4+Hr7Fu9Y/0z17nru97QcrPeBJZD3GpRE9lQXVPTFcTb3iPa88CajIvf2cID7jpo89+CYwvpU6d7t3a7m8MQPUPXtT/TxOaEM9FauDvZretj1r+0o9n6YcPbJCuzs1fQU9036oPbKG1r3+Qhg+gsl7Ptkxd70B3no+VfY7PtUOob2Bitk9ZF57vXegJD50s7a8hqmDPJ8l4T3asQk+9RBdPlyjo7yzt2M+Gci0PAxM9z1DD/o9McQvPDGFOr7YvKS9JB4NPZo9NbzWtRA+iiWJPa/9Dr5CUgm+fe5EPKOZmDzQqQO7HW8rvoyoh71+r769EXkUPlS0QT5wIvc9LmrlPd/nub3eEpG+6h4lPrCBYb3WNKA97/g1PV4cszz2Erk90x/1PcWOyD2oRsc8yWPcPVEAl7z0H8I9otYtvjOUCb2fWNA9R7eaPTfy8TzRsXq94Nd9vQ6/sryJEY49zD1jvoEftz31Owi++8cBPW5JGr0An8W9VndevnOOdj3KqAM95i+QvTnIyj3OHF09MsP2PZ7TIr4IKbK9Z+zLvea5QTxYZXS9x2gHvmcRI76PcKY98BQIPeVFRrzI8Mw3r8mTPWs6ir0wrEy9XBOoPdMGGb6zG0Q9Ikwxvm73EL5K3Ca9WyC0vSye2D3c3wM+YXwLPWN9Mr0SUy0+ZvYePQaxA75+cZg8DBzuPN/Ejb1eLAi+aFmuPQiQPL4RY0q+XGaAvYNKTT2VH5m81Dd2vS2LpD3tdTA+m18BPlWvwbySQ6s6SvzSPWpUCb0fKKG8OjDmPXwJTDvPoGg983DEvaNUhz31Pdc9IL5UPob19j3Y7yY7dAC6PSANzL3KWai9iGYbPCIPz7yhN0s9OCQWvtRazb0bit49wMd5vSegtD0BdSm+wdcTvlNgCb2lfYy9zD/+PbOI9L2Rya88toCPPQVNBj1yjOS9DYe1PbwX/L2n2Rk9ktpqvXBWD77SxJa9kJOmvSUcoL2v5wO+qxQVPUTxQj2C6DK++wwRvl+RAr6Wcg69nM+pPZGTe74vXig9t18hvj1u6jz7tsA7HyyBPsm/Ar7AQ00+tuMOPutHmT3aGJ49/0q9PBqVOj4Clku+EzI9PqwmdT6lLW89Czl9vPQm6LtwmS687xSYvPIYMj5zDb89t8s9vuX0kD1PDIO+/jjRPRpCBz6sM5G+nsAEPZxb2b2Uvk49oBMWPsYMK74YnyK+KBEjuqRBf77D+1g+RygwPpb1CD4pv6e8fMjKvCWBwb1sCl4+KL7zvPh0xj2bLQs+BBRWvhwGaz3SLUG+7TeMvUtIgT1nn0k9bmhPvPz6FT1WyR4+LXu7vkae4Duo6jA+W9kuvq8WFL29/B68XpF4vjyIBD69lTw9zrVVPRMVSb0omty8LF1fvtCMf77dnIc9azwDvpR7Uz6sgUG+25MEvtNvDj7kQUI9QdFZvraw+r2EQlA+rTjRvRRhJr4Ybg8+M1EaPkuQ7b0U+ya+W0q5PcCWV74f5K+9OFBAvWTtJj6HKOW8DU3rO0ZWgjrKLF0+194lPOU/Gr6D0Zu98RoUvtn16z0K9Rs+SAyCPUUO+L0Ygzg9V06APbK97Twc/OQ9e/aOPmdGrr6lpQ49TRQzvpKegT1jJze+K2YDPpwocTty3FE9p9piPiuEKT77Qx6+aMWcPQ6ebT6Kq2m+E0WLvIe6Hr50pKy+VC9JPsIqBj6NmZO9zXX1PRKzkb2R81o9o4iCPn/Nn77IsZa9X/UMPtMZEr24IPg9IouIPhtDsL1hwgG9tIKIPppkID47uLa+6+QYvm0Qnb1vvma93NgdvrwVXb43aJo+bjravRJUUL4IBWc9U99iPgILd749XiQ+ahUxPUfFHD77vyQ+1QGhvRZ1BTudnhg+Q6HvPcKkTz5ihAo+W+acvcKKsD0lZ6E8o2wovv5keD1sdkk+SWstPqxhfb3LfI08xIaOvAb3lj29lrq+cGBYvh41qj6HXI46wyamvtihuj0I5h6+dR1bPjyBcL73Aga+6nv3vNlMML5QTNi93S54PcmRar5lZ28+lOhSPuPL+L1xn0A+KAIQvhQALD1oaZo+q9ZEPs0pIr7sPbQ+kI8UvDqcNz6gNeG8ijHYu7L5LLyJVw4+vqSCvaZIATsWzqi+5n2BPrxKAz7euU4+3z9tvjPqJj62XKm+deYWPqUDnj6b5QU9EZCqPgCBQ7vrM4i9ZzOXvY4F6zuVKtq9iA8Zvt/V6z18Eo6+vj+oPBByAL6Mqzi+sVskvpCOgT3lOjC+UjgxPRVkPD5D+n2+HFNfvmMQiLxKjBW+4HydvrQoVbwOFIk9eMYrPsTdTb5B+DC+WUOsPSvg7r1rn9Q8k/dyvjkiQ75mo3i+S4lcPk+OcT0c0Xa+F84QvisKPjxxVwW91sBWPY0XGD5up9g7yZEVPs3Rp73otdY9t4DEPbgrLb0fsZ+9auzAvRXJHz5EcNu8w+x2Pfqn6b2FOCC99l+CPf/aCj1Blti9RlUFvssskb7viMW9FQsVvbyXkrwSBhG++WeDvQgBwT1uLUS+L+wCvojTK75nXB++yTVTPYrMQ778jSY7eY8pvA6gGr5GQz8+PLM6PRzwU7wYqz89HGhNvVefcj2F82u8tBjPvIFWkzxzkKQ9sNoyverMNr0OVKq9eoIkvZ6UQ74kz/+5plUgvhCNHr6Yj4Q7j5NzPR5dBj5EQFk9alSuPc3xjT3M81C9sj2+uquPA75/VOQ9rE1ZvmJojb2PzAK+RBnrveUhAr6sUaM9iaM0PTBFiz3p3+y8bgGePD05Lb108nm9dSCEPSv5gj1JDAG+HZxFPtVBaL3ye/s8Su6Wu7ebGr5rAuA8OZmrvQczAL65z6W8ELbPPVx51z2Swue9xDtxParlAb3VWt49vtktvnwZGz6mDZ+9TM9nvjecJL5b9zW9b6CqvXwK4zsCRTO+ZQtWvrOP/ry824Y90NesPY4PqD0ZDb288hfdPVIVEz6Sq9q9Fb5pvKkJ0j0qkBO+/lawvXyiTr4m7QE9j5bQPbrz+zx9Zfy9dMYlvPJv2D0hkba96nhBvM/zmr1reRk8DB75vRDd7T0pDEm+kgyIvjxsiz3PtYM9qndJPhGQNT6rfoE81wywu72hlD1MLWi9wPj6PIX9VT2jVmA9r8eDvqR21b1mKbe9SiXUvUjkjbwdGnw9W+XkPf3h/D1EOVy+jq8Svhkair1kcPu9T/pTPhxUDj4CjZg82eUuPmTYGr3MdF0+MQLxPc+euL2s1oI9EGlpPilt4L0+wOo9aMTUvYnxED6vy24+ajM3vqXwhzvDnlc9jTiJvb9JWT7gEwc9UmUXviEagT0FsRe+PfQGvmHGaD1yMq08qIOtvX/P0ruoOVU9Y06QvcS+6rwhD1M91SKROz59P74pncW8Gi8bPi2ddD6kAIc+GuiNPYYJvzz4bTu8MoIUPn4EMjxo3yi+SycCvrgqm7uHkAy+zZ50vcqojryJZuY7mMF0vjxpYr5cWYs8GoJjvLhKB719cfC7bUATPYDhhr1n4ti8hTvNPeyI7b181oa94Lf3ve8oGb120uc96V+YvHfxk71gzEE9zAp/PZy4KD6AYok9/hmnPa9YQr6ko9c9QtOUvUfFDj30JNU9WSf/PcAYXL2iEfs9Osb8PCsJ4Tw4PNO9eeztPXgJab6RgKA9gZU1PnnS8zriKp08Hehju6TYbLzV7/i9jwMnvJeWpL2GUtI9V/NgPgsiOD1QYuo8YyyBPctzUz01LDa9W98dPuYdLb0SJYc926UzPhFxwr2onx8+deJtPBFO+j4Tpw8+MsebPKIwDT7LQtW9vBlvvSpv+TxcTZS8YhmYPZzyab5YyC8+ZM3uPHW47z2E48y9yyFhPmSEH750UtI9sm+IPtfqGz6z8LS8DVtmPp30d76Szo492Gh1PqbYFD7VTBg+ScQbvlvXxr2R0xk+32ZtvSdUIz7GN4+++NkVvcj01L2Ylgk+ThuWvpL9JD4/FEM+/esbvlROyTxqEA++yACquVlFiD4wg54+sxYfvgOHp7xmkJS8rSHZPGozK71VZei9rd3gvVU1VD36tu294YttPr+gJ71RZJs9HYXFO5GdyD0Wybo8z68tvv9GCD2ww0m+r7GwPeDROz4GO0c+zy8MvtBXAT3SXEo+k3gNvpzkrD3Ogg2+QTYCvrF0NjwdD1a8EKR2vu22rD14d1C+tdqpPSGrD77nKRC+51kcPosuOLzp2P89zy9QPIz4nb35L2w+QqPVPbTnXT3+tzC+ezD3PNqRZjw8Y3+8feM+PjJ/kD3Q9Zo+gmyvPVuV9D1UPjk+Z8pVvR0Z/jz05+K9+lFTvI8KEL7W2pM++DghPWb7rD2OlyE+d+8GvixrST3Wxr48QB0NvrX0wD3HNq4+5WDRvfBBgL14UfM86qPLvZcL0j3QaYI9biJ0vS3HVLsucLu8eut5PnbFST0Rdx29FCKePX5hCr0yezq9RWFkvWqDnL0FHry9uLGRPY+AND5b7iU+UEAqvrw4UD3jeYi9yKDoOk4hGb4Y0by92ucnPK8fi72jmjc8vWCfPR8QKT6g1QA+cR+wvXej+L2x0jS8ZpECvindNT47de09xiTPvXWHmb2oQNm9zBwBPlYgaj0xPRo99GHGvCDprzyPEv89HppZvnfLLLwzA/K9DqkiPgPwsD0z68m9qXhgPOWbUrwG6AS+O20WPvXIxb0T6Ga91egdvfUAFby63pu80X07vtphyj1+/oi7uMc3Pi7+FbyAO6+9USWTveH7+b2b6xy+Cnq4PdJqGD1eSU29nNaHPEgYSL0ubJi9AmeAvTKdOD5fewK+HPNQPaV5HT29AZs9eD4svquUCj50wsQ9xexQPsMd+z1Q9zs+NEcdvPpng70+/eI8peyhPdbuaLz0aGg+HS7hvay2Ij5tDs48bcS1vQRY87w6k/294DvEvT0bnjzMmSi9NkUnPdMjML3Abre7bNgFvs6Cdz1Vad096Zd5PRgFLT5HmS89Jz4gPQsym720Tzm+4hoivlbjfL3c5CE8J1nSvQmpR70rKSA9nRjBPMsl771svai9zLrpPYbv5L301Lw8n4QEvQdBRL6pMg8+IFWbPSfpeD3beYs9QBUCvhpxortq1vO9jHvPPSHayrymiEa9vpScPf3XhL110JC+4yFBPpHpXL74bIu9wQeUPWGfmD5TShg+KX2dvaGQSj60CQC+uG55vQjwXL16vVK9FwgPvY/rO7ybtwC+gTYMvtZWBz6pYei8xw4tPtL+0z0DAcK9ZT8yvfkHxbzxzgC+t/eWvdVa17yTVUo+E+NtPWGGGr7V2o49x+1uvqRJLT7czIC+bYxMvNo57L1wt5M+KtGWvDI6gz4wI4s+CCKVvlftEb5bSHs9ptyGPoIsfr3Paw8+u0enPVoFdj0kX5k93IrMPRmWMr7xXOa9kL1Svqz0Dj1yafG9iA0XvutyMT77K748l67RPfWesr3LGeq9Gv2+PdQcqL0Isac+7xZCPkUraL4DF+Q9QLtYvfi2XLxkKmk+PNlnvlps1z2rvNK7sbX2vR6OEL0rj1s+eBN+PVDGmL11E+Q8Iz/Xvfs8Bb7doZq+y4jyPZD0Dz6emiA96YNAvveZyr3Xqyc9/iKWPffA0r0gl6e9YvnNvMJLm71DpIM9rIoFvpLuvLzLW6C8cKKKPWiSmb1kD0O+gVIiviLED77uLkc9rRM6veqswD7zFg8+RA8JvsMw2r2dRLe8L63mvRxPO77pFSu+9e0KPP37j71SYVq+cWPpPeXnDT6SK3C+Bw45Pvt6tL1Cdas8b4opvqyaDjxmzpu9uhenPtuFs731FU8+lCCwvVuQTD6njTW+k+w6PiDcgr5gU1W+W9xTPkS3H735I6y9megFvtZ8AT3p/dq9yPhqvtuSf75wKco9N/omvoclQb0SGnW+mKecPZAZjrtIPC2+oq0APFJ24Lvoog0+yF6PvbJDXL6HSoI+BvOEvUJOtTy55z0+Yjmrva8r1D2YeRa+/ldwvhnmkjtRNmm9dlkGPepCi7khjTS+yCKsvQl8JD7U0nA9eKA4Pek7yr2OVuG9xiggvq8OKD0xedk9c8pvPaJK5b2nFJs9TvGVPcYD7D1KlQu9VFHSvbb9LL4f/BI+IT+KPgHCfL6lwOM967iBvglNnb0rxRM9l66sPTTKPr70K4k+FNQMPn+GzT2KCh++ng5HvTheIr6BuDe+0jBiPpKqNr7qM3y9N4MXvXPxJ77P6aE9zzR4vnSzxz1NdSG+QeuaPuagdT7YtL89wNwVPn+R5j2Txxg+V79ivcfW1b5TSA2+IWJiPGXGaj2YxaW+e6cEvTZxi77RgES+zgJmvpdpZr6szGi+dtAmvg9cUj1u82498uMDvjLAYbzUgg2+rgOUvJKdzb1NLBS+9lq5PKqS+L2CWV++977QvQC9ZjykTWy85myivl2zjL5JC/a90mqLPizpgbxo6Tk9Rb2avn1EhT6QAR6+xhYSukfmPT3Twjw++o9IPhUWOb3NtYM9lERFvfEDET1rn3i7vX1NPZenRD0Flq49SYeyO6H2vTy1i+q965cpPpsKQT7MQAe9kKJJPj2+TD4utoK9VFD+u5GDgT4IkHQ9KqcvPmm/8LsLEkG+75LBPYXQMz47O3q9l7EJvQdOuD10Eis+LgaBPZaZsDzuTgw+S00bu5Tm5T0kWr49uc/rvMMO8T3eMEO+KhVQPCQQgL37w6w896jEPeu9nDyVFRw+OGkHvs4hJT5N9Ac9AgQdvqjAnT2oM4i9cdYuvvotNDz3nzg+eg0nPnaKfL1zk2e97xKxPQ3jIL4+yYg9D2Iavc7W5TwHNA++K8QQPT/kHL651qI9q68CPRMYYj7Ynxm8/lWPO7JxoL2jAlo+6eoAPovEQj5GO9c9ad90PuWS1zxn4a+9TUzqvXzVRL7nAUE+riiKvV7xxb2bxFQ+NYOXvVpZCb7UYNg9iF2FvRQSNj3jnBa+X8sqvlMmIrvRVx89ilXOvRJjFr7ijz89azbDvYhw5jxbeBI9j2RzvI1jGry/+pE9/hD0PW36372xmMy9FaIgvfO52L3hYTY9ThfYO9Hjn73v/pE8UXH+vfRJH77kmlG9E/6pPeyXKD2mFS89FGiFvdx21b3KJ18+g5UwPkkg971pxdm7UDZUPrenPr1ikfw9C1BKPlA/or1fiEG9TNWMvasDdD7Dgxc9wZSoPaySsj0M3Zc9ruivOx9f/r37aZS9KbpqvLzgij3GAD8+ZuQvPsRLur3kCoa8WxQhvsudkz3LApU97akbPiGXP73T4C4+zBZ0Pi8u7L3moEy99TM8Por2SL4yZhe+kt8ZPlmeQLw3tYI+VA18vMQMJ75Ga5i9cyYDPmRnnT4f5La9QZF1Pmh6ED1QQ029RApBvRbXWL2Upru8aORZPkWjCz4e1jo9U8ljPn5AMz5hqhW+yOq0PUb2d7w5Qr47TsKoPYx48T0WaXG9cLgdviMwrLvQMQM84OU9PV6lFz7w39a883OMvU4ZRb7HbIa+dUqnPGlSr70F2f89y37aPdYVWb17gci94/EWvnFXgD4YSUO9/YauPABbMT5jKM09Bk4fvsnpvD0m7Zi91cWCvvUFAT2Mcga+0R1ZvISXcD4lCIE+pEmvva1+RL401zQ8NK1aPb+VM723vkG9YOxQvqU7oL5LUn+9Kj5FviZExD2kqJ0+aRCZPbjYX7ypcyA9I4LWPIrU1z2h46+9dntNvnfGE756WOu9b6UtPdNDkD7QU5U9oUVZvbYZXT13RYU9FCxvPqq5H74qTIA9r/IDPph3hjtDR6k8p3BHveN9vz0TAou+Lql8PiBINz55CQS945/XvS4dUD6chGe+SQ/CPaJ0TT7pMly+VWsdvdJnELxRDSK9fDMHvspl1T3h/oc9Or+TvFPIAr4UNnq+ystHviUQSj1h8BE+YUWrPX/pxz14Ure9PLz/vTAfe71G6da9MzUvvgjmmD1zCKW9OSMzPpL14bx1kJY9ZarLvIFAlDznIry9pMAou1/Bd774HCa+PAS/PXYLbz03cze9Uv8zvSjaFL4cXre9JqE1vs6/YT6nxRO9xCucPCijSD6/ujq+AKTnPBJjnb2gKQ0+vGNkvli8Q70M5wy9+posPuBSHT3cWga+J1GAvQ7n471HX4u9EEP7PC/5rr5FKiu+0HeEPt48ML5M3Y89ZDzYvQvtRT12Wdi9z7gAPgLB0j2YZtA9SrwHvRerSbzlj9C9uCTuvKF5gz1FgUe9UgnAvdCn3Ly9lte9pbsEvqV5Ur7Ez1E8aIYOPc7fOj1XPeO9RCvaO8/pLD3TZay9g18SPnXnTr1aCKM+o6ImPTIC97xhyLQ8Yg4SPe8c0D1Wj1W9X7cnPmcujT3YJO88pXw7vUOIjT2llDu8LLuqPf6Ktj2whV4+3DtbPrg+Bj0NZKM8iuskvcCWhj3PYgi+7zg3PV9PED4OlbE9n3/qPJOW47zdo4e8hQjCvZ5enL6+nAy+b2+KvL303T2iLju9CM34vVNSCT6i1Mc9r0cmvTn+Hz36ZBm9c9vVPT+2Ib1spKg8n3/ePTsgUT3jQAk84lzJPatiYj3VflC+MPJJO+8QmL04wDS+RGgHvguGkL3H+9y9b4kxvhMYAj7hSMg8QrRxvdbuub3YtQ0+HM8HvljzJj7hjje9KVZlveiq6r2euM09/ukMvrzaLb57LQI+VHTPvfwhWr4acAE+gRpvviZ8pLzIbH89CV9YPW/M3L1oSbE9AShyvSMGAr7NLwy+qHvtvUol37zXLwy+ncjxvSez9r31jCO+73cHPm4FB75zlq89dALTvdWM671SgxU9sX0YvoKb8b0FQd49tENnvp3z/z249lC9SguIvSrT/T397Kq9JHRuvqH+D74U+5491bznPB+pH762wcE8/CZfvSK4RL6s8jo9lYYePlwwhL5IBWm8ZzawvLCaIb7ikAM+l9SVPRG8BL5iwSc9mW8MPmkS6r0RwTk+00kwvh0NkD3egz097EPhvcORy7zfz1K+bRHlvViatDxFLVo9TPi7vejY5TyQI1y9c6srviLv/rzala09n17aPa2xnr1HOJw8snEjPr8R071vojK+wdJHPY/zpDxQnyo8TzpHvg0mRr65VSy+SqMrvjyM4b3lewK+wIMlvURsUT2c8ly9ZshTvGzuk71kphg+JJCVvTFCK774xyA9qjuUPISYjbx3PhG+IvATvmsjQT6h+Fm+gQzOOU5Jm72R/EE9Qg6sPVgtjD0WheK8DMQ2PvLRSj2h1h69OdiUOp93Rj4fr1a+MuFbPYCivD2MtzU7RjmHPrjE9r2TPo+9OZruvbc2Yz7Lh409vs7LPXj6zD2i0Lm7fC8GPsXEXz2uvni9w0LhO71Xgr1xHx6+fX4/vYMyeLyRDEM+GnRUvmihQj4zUxg+AqobPfhrob71xTm+FK2APCklQj6Qx4w9WOyZvmpeoD0TixY+4WcFvnAcq7zHzPs9cysuPqaowr0XRS6+aalxPrbatD2bTw8+g4+uPQC8uL3fmxa+5wXvPVPpszv/RHw9oJdgvUZSTz6dvSM+xDqDvfllrLwJkxG+OHy8PciEDr6RGho+30/LPTbS7zxtE6q8xErvPRvlmD1a/bO9mTVIPXjllT2CRnG7Ep/qPTC2Vz0ufhw9HGC2PVGDML4zYDm+0+TqvHgH4b1TMX29nMGxO1WdhbwSYEE+dLlGPoS+hz2J+L09Sb4IPmZQi726SyM8t7IGPnFWCD56BeA9K9CzvVHpkD16mgK+JYhfvlC13r3K8rS9ArgYPYFDhz0yrUk+sv4uPsxXWD2A3sk926D0PCkmuT2uXJ+8aYD8vYISdL0ol0a+rFbfPTP8FD7lrWC8BryTPoIZwj1nlQ6+RfMoPkPpGD6xPx0+DzCWvk/ZCj7SXyS+HxrwPWEcCT6q5XE8rrJwPtfo+b1bJ8q7RVKGPpd4Fj6WH2y9pOYWvJ6p9LnJn+69dtPFvdQiUD3mjCI+MJmsveSz/zy2v+a9aJOxPBXI3b3IA2u+hUQovg+VhT6aTjI+ZLNgPho/U7xztkU9b4vnva1/hL5iUac9P91JPDvGJD7aRzy+sHSKvqT3lj5rJSA+Z4Q2vpiOCT6Xs2E9TSz1PV48hz4VN6O+YJotPpvhmLwsxvC9t0eTvY2zDL4f4qi9ptdmveEyPr4CJXQ9XU81PdYIDj7cVqA9/gqlvVaTCz639Em7J4RiPclGAr57AuA9sWHwPKSjAj4YWIs+IzUYvrG2vL4woQi+G+oovjSnsDsVhOY80NMavomeOr6ythU+duggvloWhL5Waly+9owKPh5lr75bF4A+OLEovemWGD4Z/xS+N+c6PaAMSL6S5Q09PFQhPuYPrbwp/Zg9l8kuPnQphT1bdOU9GSvlvUz/OD1i7GO+ama6vbK7Hb3rEfc8+oLoPVA4tb1vUgw9KqJ8vfY70j0Ljey90jc+vYnZQ70Rrw89R1YGv5A91zwWwdQ9ZPqtO63vzj1dVAu9EVFEvdYvVb4rES2+HPggvnjKFb7NghK+IOvgPY1gyr2mJSM9AoJLvTZzpr0SHIe9pjJkOyrhnT7QX6o9mcqQPdPS1L1o1+I7QAwOPmFNVT330es9p8iTvT3aKb0B7rG9ZlqVPa39Or50P1U9GhWWvdNxOL4fjh++9g0Avk7xqDyNUOs9Puwbvjh46bztFHE8u4wsPEcdZb4vrGG93D4JvrSv0b3IVsm96HawPaV50j2fpGy934GSvNPRpr3M9G49pH3LvXh+D75INk+97cNRvhAntLwPM5M8ksIgvYnVgz2407A9tMCcPRHlSzxK4bw9eQD1PKhAsz2yEgK+DumgvJhW/z3Mbie9Q/dbvRZvPr5Ndz++lATZvSIleL2NfP+9NzfNPcwK5zz1nR4987kzvlZWqT3cX/Y9rxErvqr3Gj30vb09WvYPvp4dFD65jyC+kNuMOxlf9D33OBa+I/A+vgHABj48lZ49syuhvZnR4Tyie2o9A/UyvWG/Ur0h0Oo9RICuPM3YPDzQvWO9uysPvmOlXr7hFbw9VnoqPgOvgb15h6K8ifSnvKOa0z174f69jKJWPVp9j72jrB89m27QPR3orb3IuRq9fjg7vvrdn71rzFy+PPYyu2OI7Tx306O9V3ohPUT+Pr5+JAi+JAtjvQvfhz2G0Jm907FHPYcI0j1ImTs8VB6hvaMYbT1veyC970XjPSI1AL5wuPu7eV84va1ln71lvrK9eQY+vpHSMz6KIoO9lOnavZ67WLn0TgE+bpRSPigKVT1GlR4+x1wwPKu7X77/wNO9XflIPbn7QT0D8AG9GhNhvv4oYL1XHZ89iiDWvQZ6Sz4cb0E+7JQsPr3pt73jiy++RiDyPF1EPj4n12Y9YDOPPk7bgb3sZ/g92pPcvO/iML4ry5c+MywHPpu9gj2K0g8+d6z0vaJHTr4eOAs+e3aAPNJHpD1zw1096brivQq19D3hllg+uJnPPHl88r3MQ5o6FzYMPXpw672mfQ2+1smbPXpSmT1BtHY+zvqMvW2Tv7zh1Kg+LpnuvbOP6b0K4A2+FbBHveD1l76ZTim8+CGJvI/XYD4HaCW99Fq+vXhaej3O5BO+YEYSvbslFr6aJ3i9E0pvvDCvjLzCr489H4jTPKZVED5Z3es9qvr/vesgFL6y5/Y9EA0wvkJRKD11Mq+89iENProsZj4YUru8sFFuPAwsgD5AHys9j+3Fu168sb0oqzm+/NKPvSEu7j1mSY0+6NhAvcpk+Dy3vKM9iTF9vcoLED4fzjI+NTgWPtufVL15lfq8h3QPPhlJSz3H0eo8z59wvf04xLzzFyG94G+HPoTIdr6jeju+L27ePcSO8bwjvf08fFcRPqkzGT6m5h6+xVasvS1gk71DASa+pM9hPm1Mr7tCVIq+xCQMPi6fcz6E48C9mPCLPDF1/r1nQkw+AJyJPpamZryg7dA9CMUKvsLa1j2sPJ691ILxvV1jYT1uEfm9IKh3vf3Bcr2+reg9iQEpPjahDT62Zuw9TosWPlHtUD3WvCo9iR5HPrt3xr1RojM+t1NIPtMh2TseS5+9HbDKPUQNIb7qzxi+o7yJPbUDHj64Ozc+hrswvkwuuD2n6RA8ziSOvo5j0b01zgS+aYxAPsA9Vb5vt4c+Qx4jPsb3VD3iDDY9HcHEvetZTb6/Y9C9PxIePOJGBT7HNgi7gomGPRbF5b0Xf+A90s9Fvq4jlj2E9Ww9KK42vqcsMr48now8rHgsvnAn671dRqw98cINPsq/1DvcTCk+Md7lvdX1nz6Oar07wnA0vk+mIj7S55A9Z7yCPuccMr5Pywg+Y7LSvcULcb2UXw29hZERvjx5ab0Uaa888h0yvQSc+j1bkwG+eOlQviJonL1PzOm9BAZ+PmWaaD6SfLy7zGPYPTEFg70abGW71e9VvFKL5b0vyDq+5ADavAftNz6UO8O9fLvdO9j6F731RIO8Cv5iPg8ysD3LIpO9VuZBPj+HTD5gLPM7VP0GPeA2Pz7RQbA9+lXuPZ+eUr6u3rc9ScH1vNbodr2LN1Q+BVj+vZej/L1/nLw8QQBevgwwaz1dSsO902ekvVBfBzywaCc+0WZPPsfhBTz3Xu69Ei0vPaGSQD1coco9"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d/Conv2D/ReadVariableOp", "op": "Identity", "input": ["sequential/conv2d/Conv2D/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d/Conv2D", "op": "Conv2D", "input": ["Func/PartitionedCall/output/_2", "sequential/conv2d/Conv2D/ReadVariableOp"], "attr": {"use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "sequential/conv2d/BiasAdd/ReadVariableOp/resource", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}, "tensorContent": "05knvegOLb1H2mq9MaTkPMV6d71s+Kq8/R9pvLGKeL1+NsU8kLxfvE8HhL27fFK9ln1LvZJ4dTvv9Au8qz0NO92Eiz0Ygvq7kXvdPE12+7xRWt29ghuzvIgT4bwfBI29tpOfPf5p7zvo3288EkzSvN76Fjy25si84tKkvExMtzy3p9i8c+5IPQTqCL1C64G9JnQpPa9hj7yMxt28veLzPMNC0L3NoKm9xUd4vLDtVr3H9Kg6sYetPBLfhbzZW269X4SgPBwesTueywS8mvysvA2UX70tSp47bNIaPcd08TyTJO+88kFRvXHuQz2fC3k8g9pcvfFTJL2WYcM6wvBbPOTU2Lzlat28k0+hPLCmgL2uEJK8N7afPNiEhDhbhLu9gAYyvX5Ch72JdpG8t27YusbGC72mCJE9Ds5dvQw0Gz1DOPK8fFSXPRk2rL3//QG+r2dAvKDPd71KBjO9K+RgPBBw1btobRa9wfpgvDo1eL2EBny8F1zkvBbBkbxphVK9HfpRu9euvjwHvQq9RlA8O6rXA7wmnHS9PEk6O/t/njsZ44g8EMFivKXLCjzjuxa8b94IPMaVv7xnaB097rIrvWJPob0Dki49YbiFO8dgEjyfHUW9vgYVvE6n1jzJ2Yi8XuocuxAqSL19NRU9bppmPf4WzTwGgMC9REsKPXQ0jr0="}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d/BiasAdd/ReadVariableOp", "op": "Identity", "input": ["sequential/conv2d/BiasAdd/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d/BiasAdd", "op": "BiasAdd", "input": ["sequential/conv2d/Conv2D", "sequential/conv2d/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "sequential/conv2d/Relu", "op": "Relu", "input": ["sequential/conv2d/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d_1/Conv2D/ReadVariableOp/resource", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "16"}]}, "tensorContent": 