{"format": "graph-model", "modelTopology": {"node": [{"name": "x", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "16"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "angle", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {}}}}, {"name": "fire_rate", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "step_size", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {}}}}, {"name": "strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAwAAAA=="}}}}, {"name": "strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAABAAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AQAAAAEAAAABAAAAAQAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice", "op": "StridedSlice", "input": ["x", "strided_slice/stack", "strided_slice/stack_1", "strided_slice/stack_2"], "attr": {"end_mask": {"i": "7"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "7"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}}}, {"name": "MaxPool2d", "op": "MaxPool", "input": ["strided_slice"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "ksize": {"list": {"i": ["1", "3", "3", "1"]}}}}, {"name": "Greater/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}, "floatVal": [0.1]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Greater", "op": "Greater", "input": ["MaxPool2d", "Greater/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/PartitionedCall/input/_0", "op": "Identity", "input": ["x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/stack_1/values_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAAAAgD8AAAAAAAAAAAAAAAAAAAAA"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/PartitionedCall/input/_1", "op": "Identity", "input": ["angle"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Cos", "op": "Cos", "input": ["Func/PartitionedCall/input/_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAAAAAAAA+AACAvgAAAAAAAIA+AAAAvgAAAAAAAAA+"}}}}, {"name": "PartitionedCall/mul", "op": "Mul", "input": ["PartitionedCall/Cos", "PartitionedCall/mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Sin", "op": "Sin", "input": ["Func/PartitionedCall/input/_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_1/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAgL4AAAC+AAAAAAAAAAAAAAAAAAAAPgAAgD4AAAA+"}}}}, {"name": "PartitionedCall/mul_1", "op": "Mul", "input": ["PartitionedCall/Sin", "PartitionedCall/mul_1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/sub", "op": "Sub", "input": ["PartitionedCall/mul", "PartitionedCall/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_2/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAAAAAAAA+AACAvgAAAAAAAIA+AAAAvgAAAAAAAAA+"}}}}, {"name": "PartitionedCall/mul_2", "op": "Mul", "input": ["PartitionedCall/Sin", "PartitionedCall/mul_2/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_3/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAgL4AAAC+AAAAAAAAAAAAAAAAAAAAPgAAgD4AAAA+"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_3", "op": "Mul", "input": ["PartitionedCall/Cos", "PartitionedCall/mul_3/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add", "op": "AddV2", "input": ["PartitionedCall/mul_2", "PartitionedCall/mul_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/stack_1", "op": "Pack", "input": ["PartitionedCall/stack_1/values_0", "PartitionedCall/sub", "PartitionedCall/add"], "attr": {"T": {"type": "DT_FLOAT"}, "axis": {"i": "-1"}, "N": {"i": "3"}}}, {"name": "PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AQAAAAEAAAABAAAAAQAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["PartitionedCall/stack_1", "PartitionedCall/strided_slice/stack", "PartitionedCall/strided_slice/stack_1", "PartitionedCall/strided_slice/stack_2"], "attr": {"begin_mask": {"i": "11"}, "end_mask": {"i": "11"}, "shrink_axis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "4"}, "ellipsis_mask": {"i": "0"}}}, {"name": "PartitionedCall/Repeat/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [3]}}}}, {"name": "PartitionedCall/Repeat/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/strided_slice", "PartitionedCall/Repeat/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/0", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/repeats", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [16]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Cast", "op": "Cast", "input": ["PartitionedCall/Repeat/repeats"], "attr": {"Truncate": {"b": false}, "SrcT": {"type": "DT_INT32"}, "DstT": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Reshape", "op": "Reshape", "input": ["PartitionedCall/Repeat/Cast", "PartitionedCall/Repeat/Reshape/shape"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples", "op": "Pack", "input": ["PartitionedCall/Repeat/Tile/multiples/0", "PartitionedCall/Repeat/Tile/multiples/1", "PartitionedCall/Repeat/Tile/multiples/2", "PartitionedCall/Repeat/Reshape", "PartitionedCall/Repeat/Tile/multiples/4"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "5"}}}, {"name": "PartitionedCall/Repeat/Tile", "op": "Tile", "input": ["PartitionedCall/Repeat/ExpandDims", "PartitionedCall/Repeat/Tile/multiples"], "attr": {"Tmultiples": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Repeat/Shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AwAAAAMAAAABAAAAAwAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [0]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [2]}}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/strided_slice", "op": "StridedSlice", "input": ["PartitionedCall/Repeat/Shape", "PartitionedCall/Repeat/strided_slice/stack", "PartitionedCall/Repeat/strided_slice/stack_1", "PartitionedCall/Repeat/strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "begin_mask": {"i": "1"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [2]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [3]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/strided_slice_1", "op": "StridedSlice", "input": ["PartitionedCall/Repeat/Shape", "PartitionedCall/Repeat/strided_slice_1/stack", "PartitionedCall/Repeat/strided_slice_1/stack_1", "PartitionedCall/Repeat/strided_slice_1/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "begin_mask": {"i": "0"}}}, {"name": "PartitionedCall/Repeat/mul", "op": "Mul", "input": ["PartitionedCall/Repeat/Reshape", "PartitionedCall/Repeat/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/concat/values_1", "op": "Pack", "input": ["PartitionedCall/Repeat/mul"], "attr": {"axis": {"i": "0"}, "N": {"i": "1"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [3]}}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [0]}}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2", "op": "StridedSlice", "input": ["PartitionedCall/Repeat/Shape", "PartitionedCall/Repeat/strided_slice_2/stack", "PartitionedCall/Repeat/strided_slice_2/stack_1", "PartitionedCall/Repeat/strided_slice_2/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "1"}, "shrink_axis_mask": {"i": "0"}}}, {"name": "PartitionedCall/Repeat/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [0]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/concat", "op": "ConcatV2", "input": ["PartitionedCall/Repeat/strided_slice", "PartitionedCall/Repeat/concat/values_1", "PartitionedCall/Repeat/strided_slice_2", "PartitionedCall/Repeat/concat/axis"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "N": {"i": "3"}}}, {"name": "PartitionedCall/Repeat/Reshape_1", "op": "Reshape", "input": ["PartitionedCall/Repeat/Tile", "PartitionedCall/Repeat/concat"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/depthwise", "op": "DepthwiseConv2dNative", "input": ["Func/PartitionedCall/input/_0", "PartitionedCall/Repeat/Reshape_1"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}}}, {"name": "PartitionedCall/Identity", "op": "Identity", "input": ["PartitionedCall/depthwise"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/PartitionedCall/output/_2", "op": "Identity", "input": ["PartitionedCall/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d/Conv2D/ReadVariableOp/resource", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "128"}]}, "tensorContent": "oy2TvSjY5zwbEbg9d0yovViQzD17Iiq9wxuePTlqlb2nyXu9j0d7veOItT2ATsM9TuqnvLV6fT1ey6s8+gr4POT6jL0x7Rc+bvNyPJlwUb30YGY9Hb8KvQ6lqrxqh9g9csaNPE7HAz6duUa+DE34vPj1RL6y5Vi9/ZBFuz5xp71hxJS+ovTpuu46jT0dHDK+kpYiPfsfAT5kNBk+Y20KvtVHwb00ev09Hn+DvPjE070fIio9ux69PdQmbr40FMg8a5KkPcTsQT0MoSY+O7tZvabd9z0xHro9jAUiPTu1Wr5JNyu+OvsfvjvGNL2KJ0k8O5/TPV3BjLzk+nC9rx7OvcqLJj7zVIO9HOPovYMOtbzvn7Q9mrmtPX6kCTxATJC9VBr+vE+oFb3kmOK9MqtLvj48oz0Yowi9MOtavv2t5z1qlTK+7prfvReB6T3zEUa+z57HPNZ9Or77c5M96chpvhaAtL1DxUC+z251vKPFKT4JObm7Dg28vXv47DuV0XS+zzsLvVKa+bxmCsC9VUNGPeB+U764One++ZcoPivH6L1iEd69X/1NvlcVBj7fedY8ODSKPQkHu70DvAy9IpdVvlFTl73xpCm+w+f6vbV1Nr3j3Pu9K+MEPvIUsbxTyNK91SQfvlF7kr2UTRq+l6Iavghbzb0kL1o8pAglvmad+j3fkqs9r+djPCL58T3teSs+6qqAPuI27L0r/eq9uAqVPr7Hfb38MAg+iZ8sviZCbj7tmvq9QeTCPThttTzC/YA9dSTzva6Kpj19Any+7u0Pvog0YT4wTzG44wuwvasXE73P2IC9Y3sHPtjrizuPOCA+guQwPhJw5T0aIUu9kXgNPtMDUT5bOvs8QdpOPONnHrzilAg+cmZZvbmbAb5WKIG9mM7APkCxurzbQ4E+zrwSPT/WPz78R+i9ijXvvaWLVDtYUyS+iflLPZ28i73f0QY8c4hfPpWwPr6hDWM8ceHpvQAqM75CnDA9xi+4vWdLk7y/C5g8xAYSPoEgSz5P/WI+71AovhFtIz72JrE8TUNYPRwsIT4u3T89ySqUuycpBT55OLw9u8cVPqupsb1YBzC+ma/evNIQQb7G6pk+iQjzPbl2DT4H3aO9yYIgPqDH571gUTm+p4QxPtsRCj53JC89SIjaPV/ofj2g0iQ+dWo0PgvfMj55OFA+uWtZPd5QB76YVSa+hG5yPBdmJr2Gn6Q8MDfWvTZsF7652xC+yuCRPkEdtL0KvUO+dpuZPRNPBT0ZPwM9U1ZuPm3sR76CDNg9wsccPrxPvT3KGqs9Kz+ZvQuIIz6ktDO+mhHOvbW0zr2qlVG+cuoOvs2HMr7kjre9DXOEPYzyCL5BRIo91ZZBvghxGj6Us3k8tmnGPdP4E75eQUo91X0PvpqRc747goC+vyIVPaSXgj7CtIE+tcxWPgmAz7zp+289G7A8PhoxLj5djhM+lHiBvU4C+L0jiE4+tqy3PY+iWT0qbka94/m0PduDVzw/Qc69kIMhPvoXpD1vQ+K9yRcJvqhzQz73Hjm9SuK2veBvUD4ARlq+pv1+PWV4vD1so+Q9eIi3O8G8i75hEkE+NY0Wvq1IAb56+Me9DaNBvo19PT1RF7U9gXI1vtaSD72J/IA9FTyTO7mWDT4UN1s+uVcwvhptTr3Rp0C+JrBBvkB+vL3plVC+PEervmaYMr5L1/K9JeEpPVuzXTwxAxY9s/vnPdg7+T1sdwu+XbEfPSD17b28gg0+FKXrvGwDBz6ypHM+ZufUPOnNKD4cSic+vrw6PZfJBb4pUnO+NqBlPcjjg7yhmtU8VXhbvVHaGTzA1gK+XanmvOFGTb0f2E69Cvj+vA7NqL2A1V09WNaxvYTR1j05qAI+BMQWPuXLuTzU7i28KNZpPv96or2YAb49RkEQPvVVDb1jbTk+tsLZPAzdLb3mgGg+MocwPi3kuTwbvAA+FL63PUYvAL5khUQ+nJtFu/vlvTxT9OC80mahvUtNrD1zBpO9iNsSPRBohb29y2I9DoxcvuZdmDwgvIG+c+saPr/WNby6JPg9WK1PvS9Esjx0VIM9qgl6PNZPhL6mtjy+HO93vS10Kb7JS6M8lmclPKqwKT6hFym+3z/jPcTDTT0k7Te+LZWUvXHQFL4dcbs9hZ4dvgeGWr7s07w9rZ/7vXjn1TxQ0I29leO+vESDFj3CFSm+3gUkvm+UI761PBc9yRZKvu+Pnr09IM6+TcXuvQWbOT0UWgc9LFUAPfLoKD4gWrs9KawjvvyvBj6YxCy9P2mgPQKxFD49RIQ6+87XPDWRDr47V/W6034ZvvA6lT2H1AA+Vs0xvkH0GD0I6v89zJHHPbblRr6cYOI9DLyZPfjc2DwACko9Jwf8PVFUEr64DSM+2/Cru7eaiz2XQ4w9tqUGvmfxhL3XROC9RsxFvsMRsb0aQKI7RYriPemGuj3URkO+J4N6vjm/B76iliq9OuSiPYj29b2jW6I8OdydPmfj772DsJy9YMYXvk6S7zxsRes9zalEvnF+M74hVjA9F6XavVKMg7oLBM29M4oTPshnkj2Cvay86/eXvZDK3j0t7r49ZA3iPAtjE74H0Cq9rkNtvQ7y9r2Sifk9BAGNPdnx872uX3K+u32ZvcWosrtoHyk9Y2N9vTN89r1QD6q9UQ4mPb+41r2pFQO7GK/uvUOhJz5/D6s9PQJ1veZiKT7/Rgs+UjEVvgLt7DyIimg9y0oUvbRVDb18dDO+apRyPgxSnj2iLIu7N5EhvceeIL6LzwU9s0VBPVmDvzwUey29d46XPY2MeT582aM9aFSFPB3wkL33X3c+LBxEPeqUXD5a2Bq+Wu0ivIhYjz3oywc+mAuKvX/wSz5KLf4743ShvbzOfD4g3lk+81U2vbMeo723Elw+38uSPaKTtr1vJKw9gmOAPenC+Lwynak97jspPj220b3sAYs+tD0SPslLQT0RQnI+XhiQvqPLTb1QzPU8l5GivVdQLL57Om0+2GJzPb2fcr6EfBG9p6YCvW0UIL6kkm4+OEpXujnLhL0kbRk+DQ8OPkPDgb5lGG4+o8ncPQqmlTq3OS68H1I2viHIAD42jvC9Tt0uPs5Fcb0Y+Aa9B1OPvTvAjLwOGqU94kAZPNS4fL5layq+4LCROqPiXb6vfLU9PRTAPfuJQz5Wmnq8FcM8vWrKHb0H6Eu9t1v5PSibBT61lLU9OksHPpt9sb3QUu09dlY4vcBjnb1avus8nUrnPTqKtj2YuLi9wOyIPmDztD1e+Ao9uh8LvtzCRb4zv6U90Ga5PTUXGz7e6zK+PCc3Pu9GCD0vyKu9BUY1PjTjsb3EhNs9jSNfvbrY/zpRFaE9IlCIviEPO70zqxk9SZijPRKB2Dum1Dm9XZEcvqm33j1DA8O9k0wDvliT/L0R2PA8y0BVPDY4Yr0GG2M+eoFzPoDERj28aAc99XclvvxUE7zByWC9UNbPPG7oSj4HvIO9/gtePrvOwz1Jw7w9ppRRPdHi9L201Ky9r6WyPeMgN774dEQ+lgBNPnVcb75L5Xy9cnIZvqmXZj7Kzok8WxtiPvAtvD2/wuI8TQVxPrmqCTqmhGw9NUH+PL+4JT5VvCy8fiQ/vrhGi71r1Yw+rcobvGVWVr4SEJg+V7SlvQd2Vzwjjv89EnFiPLzh3D0WVRI93LalPWtC7L38P8u8yv8PvU8L3Ts0+vG98inuPTLLSb5ZKBe+m3+wvccLFj46b2G+w0CJvrPvPj2KcWq8bkKNvaRJeTzqzcy9W+7VvRwJ1j0f1gw+jSoyPo3AjL3aWrY9q23XvdcqTL2g0P295o5HvliZ/jzWkKQ9Ry63PZ7hID7L5iS+bbAyvhRFgj2WdhI+wfiZvnvMm75vtow+/LkhvvE66TxV8xO+kHl0PuLgYb42wXE+M0UPPe0wir3xVEo+8CyzvFNR6Dvi/F29Go4QPZsCnb1Zphs8AaBUPb1fSb1Y5R++QYR/PuuQrD1a6RY+sTgwPhYjHz58pjw+nu/4vR6Npb0DSSe9Z285vkvm9z2Nj9W9VrJFPYThVT4u4CG8Y5p4vLxmaL04wZU8tLg8vWaQd7277cY8Lhp9PWTPBL3GYom+Vqi+vbN6O70PQgW+tG0DvdcgAb4CPZS8dD9ove9XmL0bjj49WKXtPT8a9D07DJE9a6U7PcIXNr61BhQ+wyukPSPAGj2t5FO+Sgp+PF5u7L3Di5893ngvvup3Jj1bDf89DuObvEC+oj2Ja0A9uZgAPqWoer7/wvo8FzDmvGONwT1inYe+EVVdvhVQ2L0QdFo9cOArPgR3Lb4qdQq7ZEUiPqJBZ74HlU29zAVKPdJp3z3ZEye9urITPpNCwz1mGbo7XJ2BvsSfer7nvTE9ZsVaPulcCD4d01u+HfltvcEL6D1lpiM+UCdcvqIW+L2pwEq+zasXPODbUD5Q8a4+r2yFvhnyFr7DzrO89eSNPdUPBj5FwCE+Kd46Pee3ij35uzA+g6kcPXe3873s/3K9ILt0vn2j9b2Rnt693SPaPUrybr2toxk+0nrjPc5EgL6NRsy8jMURPe6MBjzBtIo9hK5FPtIkxbxoQyU+0eRMvfaGS72lwg++auobPYto+L1ohBw+dvFwvf6iGL65FH69G6v6vZow+r2GFEO9EXIlPhiWIT4ezdE8Q+JJvlFL5LzuP3K9bOTVPQ4aw729ZiE+FIYbPu1mrz3Glei9OdCxPZ8iibtsVJY93s/qvayP+b3usGY93N+XvVZaxT3jok8+O5nNPattQb4h4Da+KKqMPRanz73nljM+5/c9PnIqZ7z+Tgs+xGuuPSdzgb5mP+g7lLA0vVNsDD5wBjI9YUvKPYOJgD3QIt889w4zvpr1kT064dM9heTHvA1kMD5O8Au+QU2kvUPavb2MhdW9FaZkPmqNgr21dW4+/9CTO+txuL3PQGu9LewjPqDkprsHW0G9PB9MPlY6Bz4J5yq+Dr33vfdzmT1nw589vwQBu9uQOz7kvDy9XGeTPmFvBT0e9hq9PWtTvrQrQz5SNWa90zowPQ4ByTo/fDA+AkZBPqmLS74ynRo8PYgVPdMEz73RiPQ9DlpfPbdeCL5t1QA+rAWevai/Bb2wYEo9Z9EQPAmvNj5kfHY+9lVLPo6HOT2N+Gq9jG0XvQBsKL0j7jY9FYVNvciII74ahhE+PY6dPUKa2jrHVSO+TTgCvLsiC77UXs27NIcYPUR8Az4EVRu+Ts/qPLIcIbz9z2S970qYPtYFfD0BxEG+fFTEPQZ0I75M5jU9EYDLvRkXUD5fJUw+P7koPUNOBLzPDyi+d9RmPlhYUL4a88m9Ab73vWoYFTxcgZ29Mbg9PN/aHD7P0gq+MLETOOc7xr1ysfc8tbq7vbfiJ748TRA9kOJCPmZEXb7RBE2+HdtBvky8kT3tAGW+anE/Pb0m3T1dJCW+ExuyvEmxub1x6I4+4j2Iu71+Lj5kFzA9sFYyvpNLwj2QEJ09w0gUPtRoIz4/3Rc+/VxmvpbAgL5eNBk+1dEruzVA672UmjQ9z8voPMiptL1Yxj08l54CPvm6Tz5K2YW9wBYtvicWST1fMCY9APbPvc/cCr4+ISQ9PlMCPkRkdz7sG+69SC+FPgFwbT4Di849hTzgPIm2+z15HI69AxKbPTkSjD22XYC+72QSvl8Tgj2gbzE+yq2XPNe1Kj0ObaQ+thcFPZRqg74+WA6+GG7/vYaQKz6rVxA+2HtcvpBudr6nH+e9lBCWPotwVr4DqJi9ovpqvnbCC75Pd+i9qK/wuxtqPDyYS66+VPn8PeklGD6uSZ49eKQNvp7HXj1Bnfe9R8oFPrTxJ71B9WQ7lNP4PcKi5zwd2p68vKPyvSLI2T2+zhk+yarZvFD68z19yCo+b4q+PeUyZTzpGk2+F90JvhA4Fz401+q97gA6PRzfJL6aYpo9TrkjPUmCIj2oKuA82At7Pqq8Gr1pazY+jegBPn3ICL5ABVu997CjPVr37D1H/cw7jHvvPdWcrT2XrVq7lsgxvtRTyD2kvhG++FHYPaWGzb0hdrM9LOmGu3UDdT6XRT69YNp9PjvKSL4uFDo9M1hVvgkLG7641Lu9qygfvSu7nT2X/wW+F7xWPZaZY76K2iw+Qmd5vmZDGz4FjTA869OyPSgSKj6d4JG+PW2WvTbVs71sCko8Us8Evrj+GL2AyA6+Va4+vbM7X7789Hk9PC5NvaFjgL0nb469PpDnPT9lVL5klh2+9sXUvCpgp7yweyC+C8qjvFbcgr3QYra84V5KvS+ZCT1wrrO9OpLsPMKNmL1Srtc8ja1EvW8MS76opAA+J2NXPapClD2KNoC+7SexPcQaWryW3Bg7RlQGvXFEG75NKnu+LzacvehfuT0EhcM83iwGvgEBjL3qEB29icSTvcmXBb6hQ469fogBPuatIr6XDQK+GvKgPXI+bbyZXTK+8IJHvoh5JD50EDe+N5kNvvSoX71aNOq66ScoO9avED5itTu+rkssvjr7zj0clgI97L/gPL+xXb3+5Ce+JtGiPYzzBz4Nn/A8YHRWPcqXkLzVBRy9ez3/PPOd/L21u0Y8oTpjPTqI3706Ku28l2L1vRuEiT2uKLM9djacvWv17D0Hu/q9NrNWuzFnIz4gZhm+dh2bPaRaXT1ck9499OCdPTSeL76MJ6s8syShvVhBbr5v3+W9fse6PLmgFD6ckFA9THAJvkkwI76rsMO9WjEwPhFqPL6dObY7L/+OPUVN2r224/o8JfCFPV9Snz1YhDC+YOStOzr5tb2l7Ro9tJzbvSKiQ7701iM+HoRKvmU7Z73NBya+KRjIPWVVrr3Md+G9x/NuPRTJFz2YU4s91RzQvGSJMr3JQja9gJBXvJF2gT3djzw+IsItPNfzLz6YkXG95ReMvfAhyT2gotY8OC6XvZyBaT7neK68GfP/PeHFt7nrhVe6JjsxPld/0j28jAm81DjIPQpAgD2H+gq+X67ZPXF2az4Gkeo9CbLMvdW75j2SWLa7dLoavnClq73Fokk96wEEPSjS3T2kKq29BqOvvK1Cwr3U5jE+1nXjPUzkgD4P00g+HBVEvnctVD4Hks09yAk9PYIiTz4JFRc+s7T/vbx2/TpIHim+/zDAPA+Utr29cwg+ATnsO5zygb6a24k9RAQwvkwgIj4YxAM9cviTPUrhpz2nzG+9z9lePkFc5bztsxy98rrHPfX5w71HmrG9hUHavVcBrj0h5hg+G7YIPlCfLb76iBW9teTOvSvRPb5aF5a9dODSPQFJ4L0uJy89iF0EvC4FBr4RiSy+CiECvR+hhr0bJOy8qZQkPdsbHD4+pYk9VncwPvURFz4bWYe9Jt0sPqo2Qz6mBWo+oD5uu87ULD5L5B8+VL8JvmRs5b1F3P68wEiQPM5vBb6k31W96o+IPSjyhz0ZUCg9I4NrPmDANb5dRTI+1kIovQuhjb7RFna+KIOEvpNalD0q5w++NehnPdgFhT3F/xa+GgTqPYoDJj6YK/C9fnXWPTpOJz4e5v89xVcOvoHttj3iZ3I+fxy9PSGa3D3KVSw+lw5sPV+lGL5djgG9MMWTO5gXlb3dBdg9sOcpPqdyCz6ZQhM+88SsvUUIUz7mSBE9z8TbvM9QEL7ouP896PTwPSJXa77Ly56+xhBQPaidzzwHlIe9R1GtPtiKWD5FWyc+mOpEvXscnD2mnGk+3++TvTwGyrxdiA29S+NRPA1znb2sQ0g9OsrnPTpKtDy6xCY+CoL5vQIClzyO3YW8r/SVvQf37L0RSA8+MAT1vQvsvL3HEu49waNNPbH9Rr56KTQ9GpSSvW3+vLwAVBe9Xx1KPcQzqb1cI0w++PIzvincMr3gTW89Vz+KvcVUST5ZtKW8mOEpPtdtv72qgMI7E1WfPVVwQz3Nwq098BgkvsxIUL3oKEs+dUpgvUqqQj5eag8+4CBCPepOdz1wyem9Vv6CPUbLeL1pv/s95a3iPS78sj0rDb+8UygTPrCOn7yngm69VdQNPQPbcD0IOOq96ajvvRHRMD6yVRu+megBPimCBj6TATQ+FOJEPmkQRz5Fzw4+zzM/vkY5DL09WgE9+k4OPT1J8LwIVP09GBn4vEpeKD7ItkQ+X9sNvk/EYT0/r+e9rTamPflELD4qoPy9f1oEvdKW4L3b8SS+YmwDPreUsT3+fow8j6vMvHUVPj7JtWu+ruE3PrhIcL0ynIA9ycdjvbX4SD2xV8Q9PIfku+m8Ar3Jzys92JRAvaEobb66ugQ8VfVFvYUkY701lYa7ETgAPhyorb1JDx685nSdPAdKhj1rUw4+hyOvPZqum733uSe+AJEqPmT8dDwO+qs9evAuPRr+dT3ob0E89VD5vC0zDD6yE8o8VZ0KPMGXKrw9R6s9/LoePuuuH76Lxse9ChpCvvjIxT0t4SO9Hi95vPg4wb3OKu69jv14vKualr00lx6+yTSvPZhRC77YpvY9A8X9vUKId7vUlw4+vLjbPb4C1Txlkyy+G4pOvSKidLyTSfs9RhqlPYtOi7zXcQi+oP8GPSirbr1I5Qa+SapKO/QY5Tyvhj29gDbSO8J7AT7JeuC9ZKP2vLbd0boLm0w9Qj7BPVmtTD1n4eC9SaWVPWqDGL6ML7C9YjN5vaX1Cr4KteM8YZ0UvvF8ND1gor08ycERPol1HbwlUra98/lfPcynKL0zd2W9Rjzhvadd0r3Nvoe+IkL+PYHDt726ygg973MHvaCXj7047Vi+ElKEPXI++T10Ypi9dgyGPQheHj5YZ3u7RPqXPbEBpr1GD5q8NnSyPLLcsLyrfMo9bho+vuBcOLsjRNM9OEJaPBM6570n2aQ9AAEIvhJqyD1ye+I92J4QvZAdJL7D4Wa9/YwWPoGhQr3cfw4+4+YdvhUyNb2+aBe+vVC+viTBaD1DK7O99VCMvfDpXTyGCO497+coPk18nb1kh1I+gogcvh/aAb2D0+G5Kh8rPpucJL3dctk73PYVPJQvaz0rWP290ll9vOWQir5AoG+9gvj4vUyp3T1Buci9cyVVvtAczD3wP9u9gFOQPYJhOj4+YXw+aRziPYojBz3NSiu+dBDBvowWWz6uu+o9j0NiPaDjjD19qhq+k7aMPkhlOT71P4q8m4rQvpTSaz62b6o+hSOrPgnJ3z0hEQ0+SyH4PXqVFT5HaFK+IRuQPrRDgD30b/O9SC/tvGknEr5PWBg+k9fmvRe5HLz4hmc+Fb9oPvWnRD6NadE8Jf1SPgnhnb1dfA0+eL7qPd1vqr4Xxig+ypeEPl+/Or06tqy9G98aPhi84z25U5U963/lPKASIj4rvK097nQkPo4yAj6JqMo9upuyvf6Hjr54BfW9be3mPrJ0Ab2nvpU9oBiCvU4dBj7f/A++0R/2u8yXTL6T6IK8cmE9PsV6Qz2CEzo+IfLhPV/I9T15E908Ydogvr3mG73jWx+9SXC0vuXzZT3U8m29fpwZPXb9MD5wMqo9khx/vcG2xD2YNlm+Qx5LvS3dCj1il9E9nDPuPZPfLj784Ce+LSS8PHJABb236aO9BawkPnFUcz3JQzq+aM9lPC/OiD2D5xc+UZOIviQOij361ra9dWEePlY6cb5r2ve8IYwNPu4kWL6UsVs9qstVPql6Kr1azTG9uZrivYPdFT7MQGy+C1y8uxt9jLzyFRo9EBcDPfL3+DyktVO+2QTAPKRZILwpO/s9gIp/PGZrBb3n9ig+OgvTvbU+6b1W9I8+4DpbPXz3j74B9gm+zH1TPdAnib2aYim+Fg8WviOMyLxq2mK+D29yPfKxi7xSTFe+ZZ3RO6JeiTr07fW94K0hvZ66Ob0mKRG+C6xLvfTmPjxs+D49OSA7PtiT9T0OwoS8HZZQvkdjTL4Asvm9xfzavUmOED4YQbS9pwhMPkpNU75aiLM8F2w/vaNATj26C14+6GsYPTzJl772MJM87O+xvb5swb1e1aS8AxhRPVVk6TyJ2rA9PxkOvsME1Lzdj869nLRePTNgJL5FT0o9Dy/AvfauEr1qzo08D5aNPIUSG76j8y+8Mdo6Pks9472V0I69YiJBPeY9PL6zdCY+l9wAvomqTD5GA5q9pzrYvVxAIz4we5e91SlgvgFIAz3DM7e9jlfcvSoJXb2mO0A+XukwvHc+nT2TW4c8LaiAPdzf+j0/4rG9f6vLPbywDT68U/m9XqpFvXE5WD6odEy++CjYvbVV9b3MyHe+8Us7PvFfMD6yhuM9IAiFvUlR4z3QHqa9MJlMvYAHCD16JVA+b84cPkCWkzujatY9NRsRPSEEpr0U/8699L7GuwPm6rydpZI9AMuRvZybir2MiTQ9CgjKPeua7z3HDoc8XwQ4vpphKj5ZWvq9hWTQvfKV2L3D+oI9EOS2O5c5Pb5Sezu9rLzaveHd3TzEXYO9ImaXPLxjHL45fSE+d0v8PYQUHjy9iLa9dBMyvuE0A779W7I8bbAJvmDk0zzUw0s8AuGHPfCIoD3huH09k4vVPV8CAD3bAYq9O22wPWB/Cj68h8c9VgvFvShCGbxvSRm8LJgjvjPFX70TNzO+NH9pPY7TGz38uJI8XoU0Pfyr/L2Tmbg86460vKyAkrwqn/Q8YRChPZJGFr5ZCq+9s8fUvQxARr4zQ489WoCHO9/Ccb2Opz0+6Sckvg2C/L2IqWg78aTSPNFjGb4zQU++XJ2CPeyVOL2tTka9J20Lvk5Vgj2dQkU+ijY4PbyeKb4sUvO94+0jvqKHlD0RhaI9+e9xPQmz3r09Kbs97qcwvkWT87xbggG+vQsNvkDp5T0Ww5M9iEUEvm7qkbzuU289lWKRPX3cGj0sMZy8qSCtPU+5sr0J4r49Jf+fvECBuT14bJY9tz/kPFEqaT0MRHA9fqE0vSb2AD6SE9q8zvRGu8B0Ir3i6Ou9NpfJvHgMIb5UCDw9GZCJPQPLwj2rYam9Yz3LPT9zDb6xJuq8TPsivVjSLr72aMe8qKgKvoQdhr2emaE9TyRkvKoKZD3iN2i+bJs8vqAGCr2xexK+cBFPPepHQb6I+Sm+yBUPPheii77UDYs+sAafvPKP3z3j7Dy96lOSvfrO773/vl89TcIjvQfxZL0IaK++hMYovVeZAD48SNC85XlIvnhlSj3UFt+9S2/ivUEx4D1NtYo9O3KAvgi07r5nHFu+2/ubvSEjEz4GjU2+SrKOvsqc4rsszA49MxaKvV9J7j0330G+QjcYvpWEFT420YC+DJcDvjVUPLwAsZW+j2mVvFOOJ73P9SA9NYzHvVnzMj79+KO+YXn1vcPCAT2x6gE9NUoYPlpOjb62ioy+Xl0vPhHL6L2Uyy4+1DGGveY9Xz6ljDG+OlbovfZPpb46OVo+EUZkvhgK7j1hnNi9a7VBPGsjH762bTg9QAQMPWVSir6hN4y+cZUdvTWnTD7LM4U9UzLkvLM5Fj4mSpu+hy61uiQJDj1MAKG9AEXQvffvnz1VkRw+niIOvn2G6r2RTlq+dmJGPuZYkL2sctm9ObT4vUUBpb5RQpY9W2rzPZ9cGb5oAQs88gtRvpGTMT0KBgy+evXjPFtOkb6h4fu+E6gFPTlrL71UJZ6+ObkAvu9GXb3QP6C+joS7vZjF/b0Fj9m9FTP8PXN8ITxk2U88sAGrOnSUEL7s2hQ9lFIRPqT2h75R46u96uRDPuuhlD4b3oW9ZQYOvUiFSL0gm8W9MQMAvgD0Cz7gUC8+KLqZvm0BBz7MPiq9Kj2yvgstFz6m9X++50sqvu59mD3RY8y9F2iFPdkoZD5h/q29/3KOvuBh9L2XrCG9SQeaPTRPlj4qo0Q+i7QPvrliCT4iQGm+RWpDvsa0rD6ni3G88SkevUZ5Cz4enhC++b5dPqH2jj4E/IO8Ts0Hvj9cr72684s99GEovUjdgL1pejq+/08FPiFZsL1CG06+ASDYvVo26L1o3VQ+UmkvPelQY75jO7u9/4YWPIDczb09uQ49uem0Pc0mjr2H0Zo9JyqAvcDi3juqzYC9NBD+PcbPDT0NBFq+GNEnPR5Q9rsuwjM+hALGvR/5Tr0BiAS+SJavPbagFTycRQc+B2dQPmodeD78IjY9HU8ePpeEjb0EdAm+zfCCPnI6Gj4teXI+2el6vs9Mkb6/jYo+LdvVPEbS4j2T/T69dO1TPSy0Ob6mg2e+H/abPS6r0b3nWU++plhVvrly9j3vPri9ERfzvTayQT4cnCc+QW06PVvKhj5wh6k8w0Rcvtc2lj4ImGu+ctiUvsUwFL5nnQI8NqeRvRhdkb6MIG8+SV93vjLdFD7adi2+slSxvtHnJb7aFIc9kyENPoGEhL0MfYY9+ngkvoiaoj10Mgq+HeA2vqU2qD3obe69pBUzvkpWDb6COOG9/mRFvS+xsz2kyR6+BCEUPYCdHT3zBC0+xdrLve5qi7paaLq99oiOPG+Dmj1w7jO9iBo/vTM4Lr7wTd09/+5+vSGdkTy1N1o9cd+ZvZimLr6udAk+HwUbvqKyqDxveCQ+nwLgvaAPqLyUOZ+9q3yePRezBz1hYDO+E8NPvYZt57uLMJM9DvFLvYVftb3AjUW+DBRovpZfxLxU8/a8wCqHvYg9/DyCtXY9+6rHPbeiBb5oI6u9Ux3ePbPWeTolDhC+vWo9vKvt9L3ulby8utPDvRLiy72M/Zk7ufeyvGbElD0IFiO+QF9WvgS8gzyY5eO9KNGbO9LKEL7AduG9q6/5O7IDqj2rxuW9aUj0vVtYA748Bzu+E0QTPZB2672W+/W93vdPvoeUDr1wcPk9VDcRveU/kDyCphq+JRfuvKesk7ziVwy+rzGZPflypLxEK7Y9Tvpovtn93D3QeYy8I8RMvh7ZCj5bL1q6wMeIuyRdxD0s/gu+Xrl4vQHV0D07a26+kX9IPcDIAz5N79w9oDHVPcA937yqtCA9hCfMvbsAUL2GYrS9DgCwPTDb1j3d/P290u8bvvL/PT1dHfE9GNl2vVIsX72o3ik+fb/3vXILHruq+pQ9w1D3vSrRSL7nB6E6JhXFPfXlpb4l/J09mMnIvcND8bzxiDO+SRvFvGFVoj7Uas89nm2Xvqq02j3LbK2+HEMwvkJF8L3ehy0+Dp0WvisvDL64yDk+U1Mpvs6BUD7iTyE+JwDUPePWyLyFx+y93eKXvctfkb1XqaE80ICYvFSaFb5wd32+sgcqvWnL1T1zBto9bV+rPZHPJD4pVzK9HqyHPd5Sib6pkEY+vQSFvTNngb3kORs+w6urvF3LHjwy+yQ9RM+kuHh3BD6SWLS9LwmOvLHyID6mXTo9qtqzuh2Laj6pIDw+a+m2PfCEvz5mRbo9QEuNu1hNNj5vZs89hp8fvrREzb2jszi+anazPe4okL5sfnO+4re2vCEdTr1yR4+8eN2CvpYWTT1nKMm9Rl1bvkfuWD7eUJ68hglnvjdPzb2mOzC+mWtqPE0ZCr7ILgW9na+6PWP667wlPxg8rdgCvoFOGj4oQKQ9wN99t993BT46vhQ9kFyAvrS+eD4kQwo+cboKvt/ylbp7eTE+dzyYPaE2uL1e3kw+xZr9u8H6Tj4kNCg+zWePPs7Rmb7SgCk+ofeQvedmmb76jxS+vRPHvYMG0r2ANS4+KN5bPQgUKz0ucpW+iPwLPuJZmb72gSK+Qd9Tvfxmob74EFu+7EFaPuYz+z3aia+9vCPdPfC0kr7W2yE9pHKyPRjQS70ogCw+VoZcPU7QtD7cIoI9sM6lPbfhAz5TD7C5l8N8Pu6Akj6zziy8z6J7PiZOD764FSm+uEUcPuqyUD2MEba9DDN5PjGeCr66lHC8AveHPmRXhr3kmoS9Q0UQPhSUpTw+mA4+b0nPPTZt3TqJbIc+8KKsO5v+sD7tXYk+Z3TVvYsHJD1HLSe9vgc9vn80sb2uamE+1SgYPmNdaD7U1m69SGUdPsjoGT4pnT29NqZZvlLyob3WV+e9FhVWvt26tz3C4++9Z5C7vTEncz25j1896w+bvd6dhD6NuyC+5McUPskUvL0rtMg9E+3gvXEW7z1msC28CDGWvCZeNrynLjO+S8JvvpH6Gr61F9E9WYu0PaX8Sb7DAgi+mkUJPv2Ytj1FRxI+M+FaPodovz3YnoG9kZQ2vNf3SD4G1pY+vg/KvQ/Gib0NXZA7wvPGPF9FkD7Rjj6+LxQ5PhhLIL7dIoY+FHB5vbgIVT3qdJE90DEVPQ4Z5rxOTJK9Rgtlu0lcRr6CT2k+a2M0PvDP3bxU9s+96c4iPpdt9D3A1r49iIgTvp7PKj3Luv69wSmyvXB0O76rj/y9I8BQvgu5SD3OpQi+3Jd8vUanGL7Onww+/PovPTpSk748IQ6+bLujvTYE6r1J/te9RcgBPiiNsD1v1wG+mcEZPghhDL2v5P+8rhFJPhLRCD4Qe/U98y/jvTX+vj0ebjs9a958vTPcNr4qZUI+PVuSPYCRcz252Lq9TCwQPRGXlr05ar69hMS+vfYMLz50BVm9n5PxPNt0SjyeWQY9hC/kvQqk+70GiCU+7P5kPjoGAjymS1e9DgNVPrata7tKcvg8kOravcCzf70YLRo+AcwtvWlrcL3w+XE9fh8TvrOwxD3P6mM9vQxlOiojE76x1tQ8cJYYPWmoVz15ZEI99eGfPeMW6r11NpQ9kfIvvuu2ZD0Xo4I8Jl4ivn8qUD5cseg9IsAWvpF6Gr3UlVM9XAwavjphL765SSi+PnutvR1ZvL0MeS+99OxHu8uqAb5G3Lk9Q/hkPdjHEr7LqS28yCqDvaycLz6RV1U+1iIhPYhGhj2HhoS7OSKUPhkB1L0smNc905AvvWzrwb3FDRG+lqwNvj7ktj1UXUE+H+cSPh9bpD22CxE+uy9UPk57FT6CDA2+dSLLvaFKnjyD9dc9cP3LPLjl7L2cSto99aXpPZTfYr0yuri9aUMUPSmJ3zw/n6g9Ld3+vdW0bLwFy8+8a34lPo47oD3A/F+8+Un8PaikLj4ulBk+YLYPPt6giD1sykq+EbMiPktZzTvD3go+pCzYPZNbCj5uCe69wIXsvXlJRb0u1A2+8H0/Pjkq7rxR1Ws9QDgFvhcosr0fxQy+iI/CPK3sKj7lQha+VMwRPvH0BL1W01o9pnXfvS3gpz1+TMc9FV9RvmovUT2yN589OaewvWShFr2Tub28ZpMvvk4B571CKxI+wtneO1T4L7rG8lI9R9YKPQ+OiLykJzK+V/nGvRQ7ID0/M0c+6+hlvRFcCT4UQ608iNp8vUoApj2gl6k6eYw1vqvssr0w/JU8tXg6vuy1kL3rSMQ9A+y6vGUygzxTr6Y9cIM6vO+GHL5XPjc9Qu09PQzEWL718J093PCTPX5+z71sUUi+lX9hPqi3VTue+3g+flBhvgxYtD58MxU+nzDFPemhvTy1DI88TU7kPPtUjD1bHAe+QCLyPFu+D74XcNK9S/MxPqv9Pb40lZW97HuvPeByRD30ITo+w3IYvQmunT5zuhY+G/0UPtr9Fz24/I887CY+vUrwmT3cUhm+xWRnvrwnjb61loS+xhMtPmWOO76xbKs8gCKPvuX/Qz7OwyK9PN7wvGPMiD606vY8ebncvRvMJr05lxY77px3PWnNpb0d7Ns9fi97PQfAub2Bv4k8QAcYPqfnPT7AppG9qjq2PUNEyT7PuYE+vKVbvg4UQz0x1Bk97g43vvEXkL3adRY+M/VXPUupH74VEEg9VM88vguGOL0HIW4+w5cXvsXblbxgeGe9cIiQvWfUvb12ODy9xerxPaADLr4xvDQ+QcLbPWSGiT14R1m9cc5FPpM+ST7WV4A+i106vXPpjD4N3Pw936ihPofzqT3naPq9tglGvaUUXb7/AUa+zWF5uzJXcD6Tahq+m858PapAij4BoZa+WnoyPrLzaLwQsJS9Bw8FvkeRNr45lMA9+ASvvQVRET0M0xw9EEGMvrjX+T3foJq+gkNuvsoOCT4gWyU+4LnvPf8ZAL4kw0I+txtBPk9Rdj6gi2M9SH6/vLGmi77NXRe+kFSAPsAhPj0TIDq+kBGAPM2V1j0+yzI+JAlGPinOCT4LUhW9hmhUPb1xqT6GuNY9NeK0vTMdrL00Lqg92hcXPg9rNz1Wmym+LCpYvefarr5apsI9H9tUPq8PyzyEB2i+FiYavpHxGb6u72E+S1GuPjs7ar0AoII72UVmvbxnij5bBgC7x4k5vRWDab0l3r+8UlHJvW/1Dr5RkSk+BipSPnMCGT4cE6s9tLAsvc0Keb1QKhQ+3fb+PZmUfryyf5m+RwLOPQQppTxaEIW8O51LPgT5Oz01rIM+RKscvSUXiL1ARQ09Z7VJvmmm9j2IoMI8JLspO4tjBz5M4FK9AVO6uz6+nT4zO6S8I5mQvcfaBr5nUIO9m9wFPu0qDz4oV1C+/18KvqN8fj2osgQ9IaZCvjpVBb5vrT0+iPMnvlEcO760HBI+iY0Pvsy0yzzcK4e9+rVvvSPJajwEu408Rr+cvP1dIj7TDbe9If/TPejNcb46KA0+KXn6uXplUbsk8Ws9y0oWPg2vxr3tECQ+LMkuPrD/iTw2UbU9j8DyvdzVGD5howG+uciSPf2UEr6hX8I9oFYIvubyrj1eKm29evrgugbuxb1lAsm9y1lvvmqoCT69cZE92eo8vr9Tij2te7g7Lv23Pc7OCzpNDQS+enB2vew49z2wUgM9BwwlvBhK8jwXCtm9KrRIPVhTOj60AK27rJ4XPZSDuz0KiEq++8nYvZDgCr0iy6q8P/FWvVA8tL1OKiW+Rwz+PQT1xT2y+ae9cv2pO4rpHb4KKwy+DTJKPfDuer1HdFa+DXI5vGn0kbwRPjw+CYuFvfbEdb5s47c9apIvPlPbh70xL2s93S0KvtoL8b1JieS9m3sUPrBFO763Zde9iVQ9vTQ3XT3m8WY9KgIkPdT2JT4H3QI+Z8revbmi8TvG25u9xgnKvbJkVb5Ekx++ntrhvfGr/b3yP+u9ynt3PfMoKD0FASm94h0PvZJcrT0iry6+BqnxvJlkTjuK1O69WI6TOypw6jx9thS+fesKvlKb0j2SHx0+nXFTvVS/G7zCyau9CfXBvfTyEj4rwNE9fKHEvSSHiL31PRe+5kDSvJWg1zoWysG9clKzPcCWxD2mzkO+gljVPCstTTsj+SQ+3DI2vnAKIz1OeZO++AWbPH993D6drly9SOpbvjuUDj6gxRk8UZU1veKU9T3bzH+9bLNNvuTRBr4JOXQ+CiERvh+rrT5YcVo+9RLKPYIVXz56Sii+ik+UvQay+71Lq3Q+V//uPRWWHr4nkt+8dr5KvSccv73hP+g97Kd5vuBs5717mS68MbyUO+pYm756j5g9esjAPKeFBz5MNNs9u7QJvr8G9r2H7Ba9TD1KveavzbwKz9C9z8ezvK7mVb3nUFe+4YpPvpMp7L2FH1c9VvaUPCrK2D1zNL27ZBUYPhUvbz1THJU9iRvEPCIthjy1+AO+mpcOPtXH9L0eosy7Ev4tPvdzjz0KGC48OrYwPfyk0D2es7Y9cyILvrXAUD3T13o8GkGIvbJU9z2CLyI9KsUAPoCxib2ZYPK70776vZGBr76sYCe+7dYXvqq79T303ks+vIWWPTNyJb6tATU+G9TcPDM7hD7Fuq27/ztcvsw9VDsCYqs9vqmJvdG1/TteHlY+KM4xPhqk6DrXgow9fpNnPmjORD1RsNK8uyPVPAvglL7LG/K9NSDPvfehCr4dHVg95/Y3Pmq9S74fKbi+OlpzPh9qq741Plo9kA2fPPhbGL57dQ6+djPGPZEXML4T71y+ZYygvYOUib5xWww+y90/Pqpkjb7SIHG9eBMuPGH8Ez6zlNO8eYR/PjEJQL26iFg9n6eBPn47jD6FLjC+8i9wPAqEBD4Wo8G9eVlbvvDCsr2+hIY+LUlfO/m3dD0rE2S+tJ2ivMb5Pb5ST729mJuZPavXUj6mPyQ+hMFJvKCaWL5uQGs+4NmgPZLymT5v478+3B6Qvg9HcD2oBay+dDNivdh1Jj1TmhE+4aJPPVOHGj5O5aC9bYtYPTF/Pb3uqri+CxUYPaGZObxNJjW+rt65PU4Fdj2XnlW9EzZGPi0Pk765oDM+vKG5PaP27T2tyrO9uVj6PWvBCr6wl7U+ATaCvqDeHj5vzXk89SyLvkdTjT4HtUu+BFI8Pq5ggb7sp3I8xyQIPa418b3s13S9vkSlvb6lNr5CRfg9sh9QPgmPcL6LPYu+gYEmvlNh1j0jk0M+FrIpvQJoij0ulOi9yeGkPqENcj7eJQi++uSlPpp0vbwGVag85Y6pPeoSnr2bFBs+nGNzvBg+H74F2pq+iEfsPVFmir79VnU8pIMMPmCmFL4JGdM9BOXDPROspz6y8pO+THUYPhTa/b03cRm+ByxbPSWwhj1zAJk9QwxEPYASgrygPMG9H+zIPF8sKbxGP4i9NlUTvkTQoL1VFPw7rzwkPWTAjj2nVKK9QD6vvUMN+ztIjPC9UPpQPi6Tbz26Jmo8T34SPrw9nb16nLs9po9BvQZVEb57IgC9fx0XvmCa7j2/+Zg8BWa7vW0B/bse26C98Ek5PTGyqTyexDK9SqciPj4kjL6tfXy9USG8PZIhlb1l+my9+OTFOUrgLD2FJqg8fHOXvsXp/L0MnUA9MjQ/vbNRHz09yj6+3vsXPSx4Hr0lrpK7zldjPZlLo71hngW+5KEFvkq79LwVTse61N4QvahFjz3cwVa+hepAvk0Fkr2/v5w9CMSUvclXE7z754Q96R3du9Z3DD5w0Qs+P7l4vfaGtL0cocq8VwcEvrC1rT3RiT6+r2gxvkmckT3QeO28uUT9vdCVnT0JtCI9wGEwPHGDoj20FQA+wtObvebCWz7B5/89ojTjPGxkVr6cM0g+zkkLvf8bhj20Wnq+D9C9PcaLsr0S5g0+yN/XvWkm3Lxr4iO9oxZavDnty73yWye+v0kOPm66UzvqrUm+y4cBPoquizyWSDw94xSBvgm3eD2SiBu+kNemvb0scj3GDbA9tUdvPf5uab2D6529udqSPdnXOL5bChS+AbWevXgn7LzShBA92KTXPa3HMD5zfxG+vxiQO9XCkj1QmLi8X/OwvazBlz1fH5e99FTYvThbg73wjvo9npq1vIhmMz3juDa+IZTxvEWglL347vO8o9C7PYIHoT0wlGA8bqKgu92sFL6luNs7jtFNPizAK72/BCs+Jr4VPiDvAz0Hskk+zxuEvUrjwb1AU+Y9ngJoPjVrWD20B2O+HKH2PaipnD1cu2I+Hk9fvnxQw73JdA6+8NHGvfvLZD4uDo4+jg1fPCKRij5XDrC+NmMqvROtFDywnlo+enNHPjzekb5NWR6+okPJvTRnsTvkwoE+WDgXvmfRMT6rMfC9IwPrPe60cr4j344+oXyyPRIzkz4/zL09kIdNPY7Zer0NkSi+WdhBPqBIvT4J/iq8OGnlPGdalb75Fjy9m/oqvsnA87yMv6M+QPaoPr7gDz4dXSk+dPj3vHFnFz6P28Q+w2nwvTtAeD6+ARm+g6NhvnTQBr4KS7e9G1oGPrl14j0SeiO+aFHkvZYkGj6MSr48JzRaPb1gJT6vjNY81BEmvjEKp7640h8+ULU6PsVxMz7U24S9FI2nPkMIHj3+FAS++18Lvr7bAj6QZES9BC6wPXAwgL6m2Yc+y7pZvpD9Qj4PEcM9Sd+FPqL9Xr2WBpA+6a+ZPohJRb3k6kY9ir7uvQNrtz2+q4c8gIUDPio/AL7ULJO99g8RPnfpY77XTAe9GBRVPmIgzb6gNZi9viOkvIzQjj0Uiao7DhwhvYvzYz4nIOG9AEO0PdYkWTyD8X49v9d/PiKjoL1+7YO+4mJdPvGkZb2reLe9gqiVPTOVKL6y7Xk+uFCUPVOsgD70aJc6n2oQO+0iJL5KqFo9TvigvNdr7j33Veu9ln3bvWuPyL2PTUa+jsJ3PlCk3r1CMma9jNPrPdbSfb5xqZu9Xf1nPL2Cdb71HsS9n9WDPY6jij1EF/M9muFSunoMRz64ZJw9167Dvc1oB74SyLU9eotiPY4MNzk3sVe+++zgPVmUIz47lHQ+0L97vme+QT48p9K8tLE3vP7lw73fYcG+WDwMPQ9n0bo8o1U91XyUvko6Zz6Mxxi8hIS/PXqEEr4WP0Y97biuvcZxYL7uFrq9PEMTvoZUGr4b0EU+mMAMvECC+T38WqW9GYCHPZFogj1oCD49CAqpPa4qf72PDtw8dlHHve1NJD6FT7E9L5NAvoj73bseO7C8BXLmPU3E3Dw8iug8mx2HvSz6lz078hA9dU82Pc+5qzt9lhI9bx2iPbog6r15Qxw+OQR4Prxrd72Zm3U+GN9WPs90or3AN+g92DjxvERlLz4qjHq83iTePNz/0j0vhQI+6QZ4Pr8SRbx1V18+KsChPCTmiT1NZfM9+dT4O9INRr4Bx7O9/ns+Paybj7xa8xM+5OyFPQQUEr6AUxG+iwa3PGeTUDw4b047iXwxvlLxmL3R9ua9pLYQPqLXPD7Caqs9HYLTPd0E172U8ZC+bdwgPshZob0ZnIs95qVNPUuEpjxsELU9eQHyPfq6xT28fdA8hk/WPSnyiLzdXb89UfMxvp55E73IkNI99yKXPTiZ1zx5RH+9VxuHvYVR2rwJnIw9sC1fvjzPtz1usgS+vzrpPBQrI714wNS9l3Novtx0Zz0Nc948PiF+vaOLwT1xNj49o7IAPugKJ76vQr69fkbMvVNZUjwxgXS9m3wGvgEgJL69P6Q9zfMBPaDA/rsP2Ii7EXSMPSIBjr0q9Ui992OlPcg3IL7mvS49Cg84vn0sFb5wbBe92hGtvZXMzj3vlQU+ufXkPKM2NL3AQTA++q0HPbCYCr5dG8E8UvjLPPJmgL0dNQS+jRakPUKfNL4DY0q+5CeAvbbWST1J/868dDxjvW7emD1PTyw+4zf1PRMesbwl1JY6+n3PPWQGDb36mKW8j1vtPbAorTs3PGo9kbHFvcwLZT0nvtE9er9WPmUGAD4SWDG7Fwa0PR2d0r3xNqO9+qBnPBfYtbw87zk9OBQXvmNYyr2vldU99HNhvfotoj1yXC++8JcUvvYoI70nQZ693uABPtkl9b2eerY8J0aKPd8TBD2sge+9LW2sPZkPAr50TRA947ttvRg3Fb6T/5u91O2QvaACo715DwK+Fx4DPUHIRz0meDW+BEcPvsWYAr7IDSu9QD+HPXArfb4W3Ao9Ycgfvtz2/zxaZQq7N2GBPu4LCb52d2U+vd0FPqcHfj2OLo89cX30POgwRT7aQVO+6s5bPnOzeT5GHYk9HiWYvNZ4r7zs77C7H3fTvOYnMj7SYLo9KUhCvk22sT1ME4i+rFjBPT4qBz5L15i+gXQzPUIiwL0FJVI9XdkePthCLL7byiW+GQHTu2wNe76g2XQ+EFozPmxnBz4bfDG9FykVvPxdz70hOGE+RK3fvDj8tT13ggg+SmBYvhT0Vz3RVEW+r9d+vbZEmj3g5Bg9aOlIvAvnCz1Tuxs+Y0G9vi0ddTsinyE+kfIVvugdyryAo1m7S5V2vlMQ9T3mAiA9iDshPQr5Pb35aRm9fgJUvqmXgL45UZQ9rDIPvmBRXT5j9Uy+jX3uvdmCCD6zB0U9nVhdvr2Ax70sJE8+5inSvSVTPb6iUgY+PXAXPlyF6b1hWiK+vR3aPY+lWr7rlsK9gBlTveI8Jz5Be8a8aYRKPHTmRDqwoF0+/4igPPN6Jb6DBXO9aBQZvsXDBj43LR4+BaaoPRxFA750ekA9LsBVPV1NRD0AZe09jCGKPvOCrL5/ycU82Sk/vgockT1lCTG+VkMNPiWWNDw7knA9dFNaPu8PKz7BWSq+92O1PcYYej4PjWy+1UCrvH3OAr6kb7K+ChpRPs9k9D027569osLmPZUTm72vOk09XaSGPo/tob5Awai9X0gFPuAu/LyapuQ9d4uKPh3Xs71pHhu9DOGIPn+1HD4mnrO+eIgdvibvn70NwFq9wtsnvqe6TL4cFK0+qy3yvemUUL6i92E9oXhdPtqPdL4luBU+FtIEPUGxPD6xkyo+YZ6kvTaZD7q6mB4+myr+PW1cYD6pSBU+gee8vVXPuT3gXIY8sgMkvtN/iD22lk0+gKBIPpVvkb098og8CuKRvAOkWT3CxL6+vt9Zvi1NqT7GKIM8XdClvpjcmz0EECi+vbFsPtB6bb7J5vu92vYdvQXAL75Tlc29Ia2APdTxar7ITnY+1RxMPsKM870BADU+pakdvimjKj0SR5g+L/ktPjbIML5fJ7w+G1ZAu9rrLD6VU+a8m9eYvFU5WryQfgw+cIvDvWxhgTr5uKq+xuSOPvZpDT6HZE8+c7RmvtC3NT7UUaS+bMYYPv/Enj6HKdI8M36pPl75ojqFcH69cXy9vS3zELzvyNW97rUvvlc06D2hs5O+T0aXPMLvCb49SUG+KigVvspoKj0v6iu+ph18PQvBST6cZmy+n/RlvjUIQrzapBK+MgCavimB5LuD3X892403PsriT76OCzy+s37SPb0M271Wq4w8gx1xvsgvQ77huoC+2QFxPqgEbT1vDou+Da4ZvnZSvDzOvBC9a5Q/Pa5QMj6wvEs8uTISPtoQsr3dUco9gUC+PccYL703N4q9IMuzvUmk/D0ARKC8G6ZnPf7yv70JKjO9d1mCPXQCET12htW9V3P7vSJJlr5l6sa9v8ECvfTyj7y0YBW+63pRva3t2T26izi+KTEIvs8QJr5pkB2+uoouPSdRR77nAK87NeGnvA5HHL7ePEE+w7s6PRldgbwIjSk93DQ4vezDhj3s8Fu8m0/MvO6VSDwJKLA9Xl1JvdmzHr0KH5a9ikgovYRCPb7XgYI6G1wdvn5+IL4OsAc8Kct+Pc0hDT6SKTo9fCizPQ9aij3Xsly9ixoku0TZBr7ueOQ9qx9avmVMj7128gq+uWblvTybAL5alJo9GZYlPZGRnz2qRKy8hsmiPBLCFr1YU3K9F/SEPYbNhz2NxQW+0nRKPimKgr0CniQ9GL0HvB4WHL5eZaU8R7mgvTxt6r2aIou8mOPRPfZWzT0Y0eO9t/SFPZLpAL2QfeM9kw0zvuauGz47kIC9PENovjIfK7438Uu9R3SxvepZgzvy/TO+x+ZXvtE4Hb0q84g9na+dPXs/oz3XKbC8vaPwPR8YFT7ef9+99qg0vEP8zT0SABa+MKOOvf/mUL4iWRc9wODIPQJRFj1tCAm+5oclvIfY1D2zYK69bcd2OvPJfb3bVj48iejwvSwk8T2DOEu+D56Kvq8tjD2MWoA91uZDPk1sSz6IYZk8TEFEPOPVhD3moV29EGaVPB7GUj32kXc9H8aKvvXg7b1MG6y9YOnsvWVGgrtQ2Zk9nnTpPSEMGz4KKWu+h/cWvrjIqb38jwu+mPJVPtrADj4cSdA8oA1RPnLs4byNSkk+vnfQPUQhnL2s8bA9WKFnPpWeBr5BjMo9uVT0veaTFj5ed4E+ynU4vonnNzxzVzw9Bm1TvdsHdD69By491HcYvjUqaT27Cha+RQX6vd+dZj0SPxM9S2HEveDSAbxtSTs9ZdWVvbiJcLw35Vg9DJObvPYiTb5nfhq9eWUSPg7QhD79vpI+NBG3PXm/Nbr2UE28H2oDPo1oz7sKRDC+psPuvRcQjbyWowe+1uqQvaQP77x2qtK7KTlbvkzxar7Mwt48FW3WvHG89bxHD1w8O/UVPZTwsL1If++8RprbPZmC/L0iRIC9q+ThvfkzML2xKuk9VDcOvQYQc72FhzE9oB+JPeAjTD4tdoM9rwo3PUe6Vr7aXtE9Dj+EvSkMAz3DJOc9UGnvPQhkcb36Aus9qDj4PFNTELzS/dC9KhcJPsODcr6MzqU97Z4qPqFYyLtxXqI8BdjmO8Cbx7xahOi9IAdVvPMRz73AMbQ9EY5lPkeeJz1/6H48f56RPVohhj1wf4O9JuEwPs1Zgrwyep49e2IsPnUr5r0tqSU+pSMWPJzxAD9y0wQ+f0YZPE5mBz55rMa9f7lovVvi2TwyNJq87mypPYeEVL4uISw+/AcLPcFJ4T0T/Oq92xFXPkxoGL5XzMk9H2OJPp3HGT5kvAu9rBZqPix2gr68RFE9441zPmpoHj6P3CU+vLwTvunrw72pcRE+TaZAvY9YFT4KOZW++38HveG50b1uJPo9sZmZvnH3LD5EJlA+AbgWvgw96jzsFRK+z+yrPKIcjT7oE5s+2QkkvvpmgbxiiZC8Ji6oPA5KYL1SLv69QTvYvaszhD0W1uu95PZbPmWSJb3By4U9ZSZIPBxi1j1yNRE9TNotvlcIIT3XJUu+S4XHPUn1QT5UmEo+/sILvkYdYjy9iVk+dcAQvvlElz1guga+hwX7vYKggzzJkTW8HW2CvmLQ0z3rzTy+3CCUPdrVAL7WDSC+unIePg0jlryZNBQ+P6OqPJFEjL354W8+WWrnPbUHFz1ljC2+tNN7PSFxxTywXqa8035CPuS2lz2Zgp4+b/PRPSq9mj3EFTc+poaDvS1RGz2umgm+PcA2vI1GEb7465U+GgZBPYWcyz1bTSw+fl4Dvug3BD1YbRs92JQjvhvPjz2x7bY+W+DXvTxwg73+gCQ9yvvPvary2T3qd2o9pQ92vUPDgLs7XrW8f2h0PhasDj2KFDy9bFqhPYz9G70PMSW9h8k/vemLmb3LwbG9EESOPcRRRD6qSi0+c1Movgozfz2m9nO9pcgUPMh3Eb5XWri9/tb6O7HZlL3R6aw89e+MPRYtKj5zAAI+XdO1vWJI+b3LO+Y6R/IEvnhMPz57tPw9cMvavXT3Vb2Pmt+9YdYFPl8VWj2k6wI9NJKkvC6foDzng+09I3xdvnJSirvb3+a9Hx0jPuhRqD1MIMS9dND9O7Sq3bs9rAa+foIVPkXaxr1UhGa9Yfs9vc++5LtRLJu8kK42vniK1j1Sl5y707YzPlKCg7yYUL+9EzmKvUNFCL4zqCK+r5aoPTmCAz0D0Fq9JrZXPDO7M718dKq9dZh6vVcoLz53pvi9fQA2PSUZKj1qWI898S8jvhXwEj6AfJo95vlQPlkTAT5gQT0+WbR8vKMmfL0CD8g8Dr+YPe2sBbw/O2Q+SdjrvUCWIj4PT8k8be+7vSdMC73XOQW+Y4zBvaR5sjyw8lm9+4VtPbhSPr05xMa721oBvvuQjj1PitY9qSgePb4oKD4ovTA9g38UPfS+mr1+QD2+U2wovoWLgb27JcY7LT3OvSD4Nr3wlR89Kyz+PKWY8L0ee6C96k7xPaFs5r1SbLE8EzThvMdmSr6RLxc+yf2dPaWylT2bnJc9/kMCvlgi2rsqJ+m9+BvePQAnpbwsxYG9hKalPdy4cb2bAJa+fKlFPiMvW74PI6e9qJO9PaQ2oD4K4Bo+ZImivZtxUD6xrOK95Eh5vUMXRr3GF1G9oaYCvfUWOrymRAG+fZcPvkyPDj6qae286mk1PjEp1z3lX7+9OcKqvInkl7ymvxe++6SJvTgJx7yXRz0+AtFEPZxbC77vhZI91nhnvjeZIj5Qy4u+Q6eku687Br4nwpU+0TlPvB9wgz5Po4Y+QXeXvoAtEb4R8Yk9AjyMPl2Nhb2Vkw0+NoChPTbLQT0erIc92x0DPlosML76n/S90QNQvj0YHz0SnNu9HI0OvlmhLT4dxec8i1LXPfObkb0q1Oy9lOOwPWfevL2SlKc+Koo0PjO4X74hJNQ9bU1YvUVhpLseeGs+JS1nvsNk7z013RG8byPxvVOmP707YVg+aP0SPRMdlL2wr5E85aHavS1CBb5W/Zu+vdfcPTxDCT55UAs9SHpFvs96sL22E0o9laWPPRLZ4r0DO7G9NIDLvDTfqb2UO4o9DGf7vUa59LxuX5Q8By6QPVXImb2SmEi+yeYpvso6Ib5IoB89Fq1cvd+mwj7KnRM+UcUAvlDzwr18u0i8PS36val5OL6mBzq+l8qCPGLbmL0oJ1i+T3DvPZPSDT6gJ3m+gyZCPso9qr2RndI8he0evqn4izxQIa29ABytPqz8tb0W70s+gwOzvSECUD6pUzC+9EI+PuOJg74a9lG+97ZOPryHDb3Qra+9H5UHvipP3jwBg7G9pS9yvtQpfr5jOsc98Rsovu8aR71BsXm+cVykPbFeSbx9rTW+++aTPGSNNLu8Ufs9D7+QvWavVb4UxIg+D3GfvSXTzDxEAks+Wx+YvfrYDz5uMS6+HUhpvrC33Du3z3C9/Wo9PYXzPLqk3jC+BPqvvWkgJT55f0s90hInPevgzr0qCcu9H7ghvubTAD0ri9E9l0udPVl63r07lbY9E1yQPfTF5z02RhG90MHWvRFnLb5U3h8+fIKIPk0DhL5mjLo9nmaJvk5spb2wcR890gjvPZ9dLb4lDow+710NPpbVrz3tYRi+/dBqvT7WML5MJDy+P293Pt7IL74mT4G97sg5vQuQPb5q0ao9kx+Cvhkt4T1bcSK+UhicPvWDeT4jGKk90P0VPgSl1z3SFxs+qxxzvcsR2r4YrxW+kf0pu8hUoT39Zq6+wwFOvaQqjr5onTq+XaRsvi85ZL5n2lm+J7kvvjrolT2x2IY9ESnHvena6LwN0AS+fZG2vKiFwr33RhW+1AgQPU7t772IKly+7Or9vdBOBz3YYbe8ZK6gvpPOjr7cKfi9ywWQPjZoArwpkgY9GC6gvutdjD676iC+/NbiOzPqKDzu4jU+mrFLPkySN71l6Ic9/GdIvb3HGz2GvAC8aIxjPc60LT0D1609ju4KPMFuwDwT5O+91bMqPkfiPz549gC99jRQPnPTTj78eZS9qq2wu7VGgT6CSXA90DAxPv0EILynrky+7DLIPWb9KD57m369XCXWvCJcoj2gmSk+TGxjPX8cmTzErQs+yiF2uttO5j0fXM494LYLvZK+6D18v0e+ZDFxPNvQhL13WZg8YaXEPXHhpjwFNRw+HjUFvl+7KT4eRCY9eLQaviZdoz2xRY+93nI1vlaW9DuCrkM+vnkpPvTHYr36UV69cZymPWAgI75G6Yc9Ca8Lva2E+zyu+Ai+4s4WPXtXIL6OtqU9gaQTPSX9Yz48VX68i1IEOxtnmb21/2A+MVMGPs42Qz7N7Lk9ClR6PhsY2jzKzb29hzjpvcx1SL4dEUM+kJOFvVHWxr1Qqlo+zJGXvZQCBr6nx949YyGIvSs5KD27WBu+ss4qvkJbvrpaADc9NDvJvUY+E74evXI9EQzHvakD9zx8TSc9OUx7uw8WeLzT6oo9azbxPY5Q4r1nJ9C9BqIjvYIA2b1irEs9dvvXO2aLor3rWJk8gLsEvoQxIb7fRl+9ELujPaOAID0h/j09Il+HvQKR1L0BNV8+ynwlPizSAL6kXsK8AKhZPq5nTb0X9/49dBBRPqKZqr0BsSC9NHB5vU7yXz6OXRo9v6WHPcJ5rD2aW409go6gPD8zBb5dO4a9KWLbvMe1jj2dGjQ+aBwjPjMGpL1MtyC9CQkYvmk9sT0BOpM9L/YZPiWaVL2jFzc+80eCPhYx8L2xuBC957ARPgJ+Rr7BVBa+8SscPoZDpLx2P4g+IieyO2vrG75nxsm9dZ0EPi5toD7rEtu9DuV1PipcJT1Vyiq9WdJyveQDfr0NZfW8dZlUPqsZBT4XvHU9jvNbPuHiOz4YthK+vJ2TPRX7mLw6zHs8beytPUwF1z38TUO9n98gvhMu0bvGubO6349IPRFVGz5mCRu9k7WIvYm8XL5zt4q+Xy4PPKZCt70Clek9cSrbPUDdN72EtKe9JIchvjPigT5k6w29EfckPDT5LD6tWuM9+7cfvvk59D0b40u9e6B3vvOmQDydwxW+NkKbuz1/cT7Un4E+Lp2OvdT+Pb6qMW08zkJZPYdDUb3EDJe96KdavjxIuL5z6LC9uCJEvomznz1FnZc+pV6iPc7zsDzSn3k8ixTRPMiw8j1ZrtC9x1NXvsnKAL757rC9LL8zPRyTlD42AKM92stcvdiJdD2npWg91m2EPiAGE76vMYE9bHQFPoNeGjs6rZY8ZdY6vc7Imj0MS4m+YC99Pl6+Sz4orbm8eEH0vcQsUD6LVnK+xzW8PVJwTj6sMWO+yl6vvPuRz7xfQgm9km35vYQnzz3Ra5Q9iNs+vES5Ab5ey22+zBVKvr1+Hj1hNyA+M9unPYx0uD1k5c+9e7nevXFXhb0UBLq9zNQjvnsSiD2Sda69+9AhPgWNurxDhKE9+rfBvJ4UEz1iF6q9y3q/u/+Tar6TdCG+xLCkPQ1RrT2RG3+9HTpDvdZpCr73K7W9CGM/vgXJYD4pTRa9ydfNPA3TTj4LV0G+6D/7PB+qlb1Gwg8+pS1lvjDYhr1ToFi9w6siPgDL0TyCEe29tfuUvbqrBr5L/Ji9ZL8JPV4dsb7j1Ci+kot6PgTMMr7jLo09uFQBvuBUgz2nff29Nab+Pe+8/j0wweQ9aP8DvYkhhbxxTMa9+a8QveB3hj1LUVy9kBHkvZOozLzSfOG9GVADvsSiTr5qLmI76mIHPX+vDj2sZva98PGVujL7ID0G1aK995APPpHubr1zXqE+uJMtPeWJWL03aYQ8vo0KPbBvrz1Q7R+9TvYiPolahD2FlMg888Ylvc8dvj3wgzq8BRbPPWO+oD33zGw+H4F5PtwAjTxkIY081z9OvWtefz2gKwi+Zms0PUeOEj43vpU9RNXTPIJijLytKdm7h/jBvcEzm74/2AS+AwRevMjC3D1UG0K9lHH1vVd/BT5i6cc96mEnvQvjPD3isRa9dxnWPemxG729L5g8xTrlPXBIXD1YPGW8ymLJPT51gD18gEq+UhCSu04Kkb3qBC6+ZbkHvjMPmr1AF9O9JMk3vjwgAD7UMfg8DG56vYyXur2r1Rc+TIUKvgpDIz7uWjW9MZdpvS2Z6r19AMs9gckQvlRmKr7/eQQ+hdXDvZDwWb7iKgc+EkhwvnJmDr0QYm899qBhPR714L0MRJw9PyR0vaHv+71++gq+syHfvWQu37zsXA6+ZK3yvR0FAL6/gSe+Ms0GPgKlCr5V3rg9UqTDvf5J8b3sHvE8qi0Zvqln9b0XTN09EnxkvpeJ/z0wP1+90EuNvcUXAT764b29orp0vlKQFL59G5090kH/PLBIH76IktQ8zWdgvbS4SL5V7zY9yPobPvejjL7bzzY8AfHEvFw0Ir5FYQA+3E2bPTDeCb5MtB09uvf3PSNx5b0sHTQ+WE86vshZmz1r/kw9F9/hvYzvvrzQDEy+dlPqvUUx6TzE4EE97K61vVaPnjxTKF29shQxvq4D1bxtTJo918/XPe7Umr0xx6g8EFMpPv2a0r0ruz6+CAJSPYfXzjzG6TE7/pNGvg3iRL5duS2+98ouvnHa1730QgO+L0MqvY0Hfj1V9mS9AA1hvDlSkb0BUxI+IiyhvQi7KL6bbiQ9idC1PBbzc7x4Kh2+GIQXvgErQT77ll++dhlAvFJXdL1baVw9WPWdPQ9lnz1oiya9bKUzPuinSz2zjUW9r1EsPVP2XT5UYUq+NWOaPS8xmT08EkY87HSHPkPA4r1K7HC9XXPivcSXdD5IcZU9MUzCPSgU0j2K/Yi8K9gRPiuJJz0LKY+9kwjaPFNoi7322ye+dcYvvRPaKLxo6Ew+N3dPvsbOQD4ZMRo+pNJXPewfo76sxDm+v9kIPBNaQD7wr1E9jlKYviJgrj2aViM+RWLjveh6hLzbzAQ+7CIVPifa2L2UVC++4F9uPmPtvT0YBQg+itqtPdy8qr07ECK+djTVPewfmTtGpcI943OQvURVRj6c9i8+qpoavX06fLzpDQ++i2eaPSg5Cr5DCBE+l5HiPb/X+Ty1QuK8WHEJPgr3rj3VGMC9RLMuPddjQj0Xxj68T1ffPVojkj3pvks9NfzRPSAQLL7RwjS+64stvToZ5r0bsna98ocyPHbx1rzzHVA+08pQPuWq3z1Ho8s9FAUUPh09rr39K5k8v2MhPmfnAj4FEwE+ANbyvQkCiz0VpRa+pYp0voZQ5r1HmrS9/sL/PA6ydD1AKD8+CuIoProCgD3yftM9XlnpPBpfwT0f2M+8TYcLvnFUXL1sxUm+q33VPVMOFz7ogXC8ugOdPuFxhD0oQRG+0QYcPhqbHT6Bmzc+hhmSvm+fAT6VeCS+etHOPW76/T2zGDu79ttyPnPE7r1m7tK8RBWBPqiyFD70k8S9luwnvKQnkrxgUwW+4P63vZnzNT22dxk+ZiHBvd24KT2UVsi9tuhQOxQ00b2Rj3e+Kf8xvtGVdD53VEQ+TQlVPkZVsLtBqXk9DX4PvkRhh763D7c99KgDvOl6Gz7iNj6+b2yIvn89kj4MAxo+TfBCvr2hBz7u3JM9ueADPngqkT5q966+dcwrPrlNz7zWLQW+9A+XvfMhI76pXoG9jkWDvQ5cOL7XCQc9iXU0PW/dHz4Hj7M9sUiJvSl7Az4ng1U84oWKPcLxBr4uBNg9ObAjPTY/Bj5ZuJI+sZYRviPvvr4XCAS+LlY9vpNOyzyxDtk8hWkpvtsfIr7LvRI+63+5vSIVhL62Amy+ktUZPvgwsr7ZuI4+feQSvcRkET6IICG+VQctPYi3U77THUQ9u0smPvF23bzLyKY9FNMZPngJhD0fOdM9YaoPvgLTUj0K/lK+XUy7vatbNL2gbDI8Gt/LPfu3vL1rtQg99eiKvav9wz3Fvb69yWNbvRbIOL3agNk8YVEIvxLisTzDGNM92qexOg4NtT2MIWu93BpNvYv8Sr5JgDC+NhoYvtbKH76xtgu+hy/3PV3ulL1R+a48lxKdvSvbkb2ri4e9pZUwvMk/oD5WWpY9t2iWPf/E2L2ggvc6zvQKPgLlUD2BvPA9NLGKvYEmJr3FcrW9ceaOPbKsQL43P089l76avSjgPb5jiR++TwkAvoqRoDz6VOo9sAEfvmdI/bxmc4U8LDoiPHsGYr6Ay3y97wcNvkoS3b1lj8+9XwioPVCbxT2avm+9V3iXvPB3rL2nxWc9uXfhvawLFr5zSVK9s75PvidPrrw8vKQ819wuverShT0xDqI99eWPPZjxLDyEVsE9Q+7nPDdZqT3zSAS+5vu2vIU58T2MRg69PitKvU30Pb5kX0K+SObVvW5He739T/G9dv7EPb7JqzwKIh89WQI2vgS3qj3KHP09J28xvmBBID0pe8E9TJsavrSsFD4tkCa+EL0NPN0J7D3ifha+G1BGvunJCT7Xopg9dXSmvVeCrzzHWXo9PvdBvTZpTL2vBNw9o4yKPGGByDs93nG9ujwQvnpkW76gcLM9TGIrPgnGlL17CIS8IR7SvFH+0z1W/QC+SnJVPdpqjr0zLg89IsXbPSkMvL3jzRm9ZIxEvufGrL04tFq+b/+fOiYH5DzNgKG9xr0jPYzzPL5TvQi+P5RlvUkrhz2GHKG9Nqo2PbCgzz3F0tQ7Lr2YvRHXZT3g5ia9LqTiPe1p/b0sx0u8a4oxvYMBob0/Lby9MXhDvjgHNz6eG4O9lPHcvYQtBTtkiAA+DRNYPg5mXT1DRCo+1jgXO7PQar4Ttt+9BQKXPAmHXj3npua8ueZXvi5NT72StKE9koDVvXAzOD5TUEE+e8IrPhQBlb2Q2Uy+QiWpPFE+Qj5Lp/c8vrKNPhQ0gL3f3fs90TiPvMxjK76B+Jg+ANEDPpe+gj32uRU+uzEBvm7HVb7AbhM+6OjFPDCYmj3Kk2Q9Xy7avYED+z0QG1k+0ULpPLL/Ab5i6W+6bB8LPUrLBb6jega++MiiPbXcnz2KeHQ+1A+HvZiGw7x2DKI+lk4GvqrJ8r20fxi+0qFgvZZgoL6juTk6Ff+bvMq+XT4Q0e+84WbKvVnlSD367im+yY8SvaZPEr5C9FK9V6h/vErgjbzCzYM9dwwhPTk1Dj4O3QI+UfgBvrAKLr660AI+pjEqvvWeXz05vpO8Hk4WPjrjVz59ikG8NkyqPL2/eT6uuUA9/rjfu1vWtL17K0W+BqOMvZqr6D2Who0+g6A1vY3R5Tvs+dg9aP+KvRcDGT4qgjc+SdQYPhgSZL2AD1O9bhoTPhRSij3KAzo92ICgvUso2rwzyVu9FnWCPvwCfb6rNTe+FhjuPaFSpLw11DE9xoINPjmRFT6ClCK+FX6vvdPai73U3DC+gUVgPrFWTTziU42+TkgOPkkbcj5F/eu9gVZrPNlP5b3cmFk+FTSQPr6ZlryUQM899ZUHvh1N6D2FMrO90wT8vVL6Rz0jgOW9mOVuvS6acr0598M9ffI1PkujCz55cwA+u4sTPkKbej2oDEQ9hUVQPsn3xb2nCCc+WcBKPlq2Njwhnam9lL/JPVgBKb4ThRi+eXqXPZCTKz4+kjw+Zscovsr73T2y+mE8ftGLvvbm172rKBK+vt9GPhbPTb6sgIY+fUItPrnzTD1gVRs9EljDvQoPUL6zjti9/iOjO0aAFT5ze0k8edeKPXFJ1L3jItQ937M9vnc4Zz2MAxI91XpDvpIqLr75x547ckU5vj8V7b3NU609K84BPkXIJj19+iw+R5MAvuJ8nj7BJBy8WpQzvjn/Iz7g15M9Tp+CPn6kKb5rYwE+KbvfvXThcL2Bp3W8+8AkvvzoXr24zsA86XhGvYPnDz5eTe+9++dIvtzSiL2aAdy9akKAPsdoZD7IU4m8Ez3WPeyKhL3uuTq8ltguvCLvAL5ddzm+vEKqvGzmIT6IMMq9r41avJM3Ib1ejp27OtBZPgKW5z1SLaC9VpxNPnjSYz4SvPo7IElaPEjeMT7zQbw9Q37nPc8vTL5NpK898PXEvM9Vdr1cnWg+lgjpvaa3Cb4rVXc8GKNYvkvKVD3lNrq9z1yxvdX4B7zbRBw+Wf9RPpnyOzzawu+96TgsPVXkYT2lQNc9"}}}}, {"name": "sequential/conv2d/Conv2D/ReadVariableOp", "op": "Identity", "input": ["sequential/conv2d/Conv2D/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d/Conv2D", "op": "Conv2D", "input": ["Func/PartitionedCall/output/_2", "sequential/conv2d/Conv2D/ReadVariableOp"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}}}, {"name": "sequential/conv2d/BiasAdd/ReadVariableOp/resource", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}, "tensorContent": "330hvbeiSL3ZRIa9fcLZPOc1fr3DH+m8iphAvBr4i7120Ic8OHSFvLtamb1o1WC9AY9tvZsr87o+zlS84AQ6NkmFkz1kbC28Zur0PP6qDL02sN+9xbjVvAHoAb0AV4+94iOsPVW+4TtIbw88FfblvCO7sTo497i8qjvIvJwn6DxP0AK9L+VNPQd8HL0XJom9sdA3PdWhn7xCvAO9XF/SPMB+2L3rMai9zsSkvOuOYr0I+Jq71sO8PBSIqLyTA3u9V1ufPGeK7zvmukm7Pl/KvPDSXb3i3eA7KvA8PW61Mz0IM9O8+jJtvaK4OT3N6pA8umU/vXUOKr2O9bI6w7fZPLFIEL35FLm8XmFgPKifgr1vgIO8adi9PKWtxjnVR9G9NnBWvaSniL0yHrC8f0dMvCwkEb3++Is9iERavbAYHz1M1eC8mdWoPXqtrb1kBQa+eyM6vKvVd71UqkC9RaCCPFYN27vLDQu9TolVvBaFf71kr4y8R4GdvFkLr7xU1km9+awHvMkS+TxknBO9WrdDu2ZsIrt4hkG9N0AmPKbqeTvTFRo8zatyvLB6FDxD9R+8u+1APODKvbxDSCI9Faw5vSdhrL399S499FeJPMCTDjuQo0e9GXACvNEJAT09qeG8G4HUuyUVe72/zQc9mhqIPZ0OBT1/+8a9698ZPcsxmr0="}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d/BiasAdd/ReadVariableOp", "op": "Identity", "input": ["sequential/conv2d/BiasAdd/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d/BiasAdd", "op": "BiasAdd", "input": ["sequential/conv2d/Conv2D", "sequential/conv2d/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "sequential/conv2d/Relu", "op": "Relu", "input": ["sequential/conv2d/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d_1/Conv2D/ReadVariableOp/resource", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "16"}]}, "tensorContent": 