{"format": "graph-model", "modelTopology": {"node": [{"name": "x", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "16"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "fire_rate", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "step_size", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {}}}}, {"name": "angle", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAwAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAABAAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AQAAAAEAAAABAAAAAQAAAA=="}}}}, {"name": "strided_slice", "op": "StridedSlice", "input": ["x", "strided_slice/stack", "strided_slice/stack_1", "strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "7"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}, "end_mask": {"i": "7"}, "ellipsis_mask": {"i": "0"}}}, {"name": "MaxPool2d", "op": "MaxPool", "input": ["strided_slice"], "attr": {"ksize": {"list": {"i": ["1", "3", "3", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "Greater/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}, "floatVal": [0.1]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Greater", "op": "Greater", "input": ["MaxPool2d", "Greater/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/PartitionedCall/input/_0", "op": "Identity", "input": ["x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/stack_1/values_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAAAAgD8AAAAAAAAAAAAAAAAAAAAA"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/PartitionedCall/input/_1", "op": "Identity", "input": ["angle"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Cos", "op": "Cos", "input": ["Func/PartitionedCall/input/_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAAAAAAAA+AACAvgAAAAAAAIA+AAAAvgAAAAAAAAA+"}}}}, {"name": "PartitionedCall/mul", "op": "Mul", "input": ["PartitionedCall/Cos", "PartitionedCall/mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Sin", "op": "Sin", "input": ["Func/PartitionedCall/input/_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAgL4AAAC+AAAAAAAAAAAAAAAAAAAAPgAAgD4AAAA+"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_1", "op": "Mul", "input": ["PartitionedCall/Sin", "PartitionedCall/mul_1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/sub", "op": "Sub", "input": ["PartitionedCall/mul", "PartitionedCall/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_2/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAAAAAAAA+AACAvgAAAAAAAIA+AAAAvgAAAAAAAAA+"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_2", "op": "Mul", "input": ["PartitionedCall/Sin", "PartitionedCall/mul_2/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_3/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAgL4AAAC+AAAAAAAAAAAAAAAAAAAAPgAAgD4AAAA+"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_3", "op": "Mul", "input": ["PartitionedCall/Cos", "PartitionedCall/mul_3/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add", "op": "AddV2", "input": ["PartitionedCall/mul_2", "PartitionedCall/mul_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/stack_1", "op": "Pack", "input": ["PartitionedCall/stack_1/values_0", "PartitionedCall/sub", "PartitionedCall/add"], "attr": {"N": {"i": "3"}, "axis": {"i": "-1"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AQAAAAEAAAABAAAAAQAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["PartitionedCall/stack_1", "PartitionedCall/strided_slice/stack", "PartitionedCall/strided_slice/stack_1", "PartitionedCall/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "11"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "4"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "11"}}}, {"name": "PartitionedCall/Repeat/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [3]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/strided_slice", "PartitionedCall/Repeat/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/0", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/repeats", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [16]}}}}, {"name": "PartitionedCall/Repeat/Cast", "op": "Cast", "input": ["PartitionedCall/Repeat/repeats"], "attr": {"DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}, "SrcT": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}}}, {"name": "PartitionedCall/Repeat/Reshape", "op": "Reshape", "input": ["PartitionedCall/Repeat/Cast", "PartitionedCall/Repeat/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples", "op": "Pack", "input": ["PartitionedCall/Repeat/Tile/multiples/0", "PartitionedCall/Repeat/Tile/multiples/1", "PartitionedCall/Repeat/Tile/multiples/2", "PartitionedCall/Repeat/Reshape", "PartitionedCall/Repeat/Tile/multiples/4"], "attr": {"axis": {"i": "0"}, "N": {"i": "5"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile", "op": "Tile", "input": ["PartitionedCall/Repeat/ExpandDims", "PartitionedCall/Repeat/Tile/multiples"], "attr": {"Tmultiples": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Repeat/Shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AwAAAAMAAAABAAAAAwAAAA=="}}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [0]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [2]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice", "op": "StridedSlice", "input": ["PartitionedCall/Repeat/Shape", "PartitionedCall/Repeat/strided_slice/stack", "PartitionedCall/Repeat/strided_slice/stack_1", "PartitionedCall/Repeat/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "1"}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [2]}}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [3]}}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/strided_slice_1", "op": "StridedSlice", "input": ["PartitionedCall/Repeat/Shape", "PartitionedCall/Repeat/strided_slice_1/stack", "PartitionedCall/Repeat/strided_slice_1/stack_1", "PartitionedCall/Repeat/strided_slice_1/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}}}, {"name": "PartitionedCall/Repeat/mul", "op": "Mul", "input": ["PartitionedCall/Repeat/Reshape", "PartitionedCall/Repeat/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/concat/values_1", "op": "Pack", "input": ["PartitionedCall/Repeat/mul"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "1"}, "axis": {"i": "0"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [3]}}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [0]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2", "op": "StridedSlice", "input": ["PartitionedCall/Repeat/Shape", "PartitionedCall/Repeat/strided_slice_2/stack", "PartitionedCall/Repeat/strided_slice_2/stack_1", "PartitionedCall/Repeat/strided_slice_2/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}}}, {"name": "PartitionedCall/Repeat/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [0]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/concat", "op": "ConcatV2", "input": ["PartitionedCall/Repeat/strided_slice", "PartitionedCall/Repeat/concat/values_1", "PartitionedCall/Repeat/strided_slice_2", "PartitionedCall/Repeat/concat/axis"], "attr": {"N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Reshape_1", "op": "Reshape", "input": ["PartitionedCall/Repeat/Tile", "PartitionedCall/Repeat/concat"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/depthwise", "op": "DepthwiseConv2dNative", "input": ["Func/PartitionedCall/input/_0", "PartitionedCall/Repeat/Reshape_1"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/Identity", "op": "Identity", "input": ["PartitionedCall/depthwise"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/PartitionedCall/output/_2", "op": "Identity", "input": ["PartitionedCall/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d/Conv2D/ReadVariableOp/resource", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "128"}]}, "tensorContent": "5+eVvcYd8TwrFb89Ig6jvZfQ0j0Gszm9XZybPaX5nL2sjoO96gJkvYaVsj20qcQ9MNmpvABZbT3jQaw86OLCPD/Tkb35dBw+gsRsPD6uXL01LV095L0SvV8ylrxYVtI9FAR1PAYuBj4oAEm+y4ULvfS2R74eIlC90vQRvH0nvL0g2aG+vNU2uziRhj1B2jG+Q/AgPW5X+j0ywBQ+L88Jvskevb2hcgE+Wn2OvG4i271G+j09HibAPf3hcr4CPqg88nSsPXhrOj2lOSg+pd5qvXnm8T0RVbU9adsMPZwFXb4pxCm+bWUkvvheJr0VLJY8ueXTPU0zVLwXT2u9y4DFvQ8RJj5Xs3y9vbvtvYBClbx+Xbg9iVe6PXxAVDz2D5W9uDUDvQiSJ71xcuK9uzJRvkKsmz0Olgy9FsBevu5t5T30RDW+L7Tuva+w6j1lPUa+wCKtPKPPOb7q7pU9wmhuvkjLs70STUC+rJWEvLWuLD7TtgO8R7bBvd7THjykqW2+vLQBvRlk6bxqYba9AsdKPQ6TVL5+cnG+KtosPiYu770c7d69XntKvjOeBj64A9U8ULGGPZaytr1qggm9xj5Zvsopl70BbSK+hhb7vQ5lK72tNQG+kRYCPjfelbxfLNy9eWMrvjj7m72CpiS+sv8evrJbz73Tl3A8zWUlvroZ+j1l1p49J0DtO/Dz4T3SYR4+M0KAPicBAr6/1Om9xTKPPiGUer0xTPk9diItvqA7fD5GPAK+rdSuPfvuPDxF6Jw982wAvkHTtT1SPWS+Rj8VvqLRVz5p/h85fQCfvcCtFb0iFIm9f3MDPvnBnztVaSI+aGMiPk724T3FcBi9pz4OPjW0WD4ZvMw84ahjuwpuqrzGdgg+gtg7ve+EAb5tHoG95N7CPsB4AL3PJnc+GMwDPVSrRj75V+y94QYCvrJYALysJTO+GVIZPcMBkb0ioR48PMBXPlpUQr51x+87jM7ovSvUPr6GuhA9gV29vWRn0ryPo+o7mpwiPiNGRD4y9Xo+C60wviSVFj62cJw82uyTPWw5HD76zTE9qk3GOulsAj7iiLE9yuAFPodYu72jrSi+Uz0IvdklS75noZ0+YIXdPeDDCz5PLKu9SS4mPmGM6r3MiUG+G+05PukxDz75QRM9DS/cPTzmhT27rSM+sxMzPkU5Mz53w0c+1CJFPQvL2r1F+Cy+lc85PHnLM71I3JA8fQ/MvfVNFr7M6Ay+DJ+PPmx8qr3Qejq+3ialPVwpHj0DMQQ9MyxzPtUsRr5I1tA9nzIePqaGnj10yLU9Np65va4RFz7mVDi+eTn3vQkVzL15bEy+IDMSvsRINb711pu9EEqCPdPMGL66s2c9xFY9vj3tKT6WDpQ8yHuzPf2mKL4fiF89MSwbvjW+c74Po4C+eGc5PXgkhz7dK4E+H6NgPlJYOr1p2mM9P4dAPskmLj4vPxk+rgyEvYUf5707qU4+dieoPbDVWz1RGzK9FSfEPV+SoTzsYLy9jqUjPuwCpj2mBta9LqoMvumFTD5rdUm9BsqkvbezYz4vDmG+0+ubPQ0kzz1Wcd09qu/qOhUyib7Fhzg+kqUSvj72BL7VaLy9Dho3vu3bDz0BoK89i1I0vmKTorxFTUs9zTSjurXSAD4xVUo+wjg1viR1Wr2K6ja+V2dIvjg8xL3gj1O+Q3+pvhXpSL63NgG+DIo4PZp5yjwHyGQ8dVvWPdbN8j3uqQ6+9W0wPW/++L1wxfo9Tj4GvTNP/z1++X4+e4nVPIdVLD7MZyU+5d7/POoVA75qeHu+MGmIPVqp0Lyuckc8RZRRvdb2b7tVVxe+X2sovYW+Tb3kqyC934LXvBDosr0+LzU9ah6cvZrPzz0IcAQ+P5cjPoMupDzgtGO89Y9kPpohtb3STqA9SPEVPsELW70U/zA+F1CIPLq6O70a/2U+cZ0RPp98UTyaXgE+Qne1Pfrs+r1WulE+T0itPKnE9Tv34rm8IRiqvaBOnD1BRKG9/2wIPf+lir2EqG49YtNbvmBzFzzUn3++nxgePuGtDL08r/U9nhJSvQzixTwzVYk9rDyVPPbChL7RCUS+7cWBvXoGQb7Hb6k8QWOBPNtNKT6FlCu+FPnqPZGbQT1iTDu+4PejvXxFGb6+P709OH4fvtOkX76Al749Vu/+vSan7jwNzZy9gG/XvMZaGj2UGS++vrAmvoXcJr61hyM9JSxOvkmArr3tqtm+PhfzvUOZKj0Jyww997nsPJSNJT6X4ro9yh0jvlGpCz6E5Cu9/XygPTfNET5O9pc7Z+DZPLCbEr5yL8e7lpMavmqzkD2u2QM+PXE0vvLmEj1b5Po9vJO8PVYmS755ceM9p0uWPYc3Cj3giVg9tlj9PYSqEL7faCU+UmZ8uxT2iT0tDpY9FGgIvg8ofr0CI969QOZJvpBrrb0ROtI7KXDhPYkZsT355EG+hyZ8vpNOB74UUju9Hb6jPffG+L0K7Y88fHChPk3d8b0VLJu9M/UYvqDk5jw+hPA9hIlKvmO7ML6u2TE9PGjcvcaZyzq7udG9GGcRPtmHkz1cBma87KWQvRf44D0Bfsg9RmHsPMp8Eb6Zvw69Iwd1vZPE+71xb/89CAOiPTrw/L0ioHC+4tadveRDMLswHzA9UGZ+vQzX8r0uEqG9QwQvPQRe3r39NLG72qb1vce9Kj6oha09/2+KvWzWKD4LNwY+/mQbvr4d1DzAkm89P5wjvdOEBL1B9zm+mE1sPrl7hz1xNWi8oopDvR7CHr4g6xI9Ymc5Pd+54DzbNl+9wJ6aPU6Pgj73EYw9F8HBO6Ysqb2m34I+6oUpPRhRZD53WAy+zQ0evLQ8aj03EQc+P/qCvZadSj5psio7lyShvX7/eT6Pvlw+HdNnvbDdq71/bmc+LTeWPRQOtb0GqZs9D+ZZPfhCKb1v1aU91L0tPmfL0b3jYYs+Ox0QPuZ9Kz2dJmg+iF+Svg1GQr3zwvs84322vUd/NL7Bm2U+APExPUbee75TERG917IjvSi5IL4PE2o+uG+DuEkHn72eRhM+f9gPPs+ph74wSWM+rwL0PTOlLLzPlqo5u6VAvlWW3z1o6+S9Cqc4PgXler3QZxW9x4RzvbgKuLxSzp49RlgXu5/Fg74nRiK+5zG4u5zOY77DIsU9yKe2Pf0jPj4ziYq8tO4RvY4rDr26D0i9aNsBPneFDD718J89BncNPjnEsb3zfvA9UbdcvaqinL07Uso8ZzXcPcwC5j3Bcci9AI+HPncKqz1SLAY9F6oGvnvoRL7oV6s9RQm2PfkwHD6gnii+UIw2Pkt6Mz3mM7y9hEo4PoSRtb16ONM9nFdivZLE5rsOZbc94BGTvjz+W71+VhE9v8uBPTpqkTunGT29+AkhvvOx1j0SBqy9qdECvqH/D76mKb48d1qXPCSlI72MD2M+xfprPtt1GT0heC09YDcxviUgMbxYG329fJMMPd8sXD7gA4O97LJhPoXspz2dC7o9VFhZPWUx8L25M6G94lmyPTtLML4udEU+/rpGPpzXbr4SxHK9NRURvgFbbD6SoQM9QKFjPlu6wj3f+Ag9SmRvPrABZTwYB3I99VEvPWWqOD4B4Eu8g7Axvofbcr2j7Yw+a10dvCbLVL4Z1Y0+G5aWvQ86BzwOqgU+Dj29PDrjwz1xyAc9M7OoPaTFp73vySe9ixM1vZyNg7sKsQe+PEHjPfVoSb4f5Qm+vMq+vRKDET6HdF++8ImGvjR27zw0Mai8x4KdvZPQljwdGf69z0nzvTqG0D1unAI+UKc0PkEon70Qw5k9aVzfvYP4br1XY++9XI1NvmcXKD35kZ89G+yjPR5iLT5hWym+zpclvqZ+TT2pJQU+5x+ZvnXAor7dyGw+pzQwvrfR5jynmAS+BsN3Pn9EYb5zb2k+Sk89PePjj72b5E0+HHggvOdh8DtCSWm9tYYGPQQYsL0VL3U7yAlsPVUWjL0f+iO+NsZ5PhqjtD3XcxA+A20TPhKjEz7Qh0A+GhT/vfDdob109Ae9ONkovtKY1z0fRdW98YI0PQ57UD6+l4y84bJ6vETTYr2Qo1k8CcQnvY2dkL2hZO8883KMPd9QVr2bjYi+zPvBvdDhNL2W7wO+NyDlvAPKAb5239O8o01tvVxL0b3knTs9Q0AAPnla8j2f2Y09I88+PSknPL4QaxI+7WSQPY8FDT0KVVW+hmh4PKKW+b08KKE9DX4zvsP0Mj3Hd/g9WuTAvMIpqD0Pky49eIP7PQfPg77mOQY9KbLsvGr0tD3D5I++jpFcvmgT2b2GUlw9aMQsPgGqMr4VzdS7q3QiPmD6Zb4msEu9Ht1OPS4u3D1oBBa9kTQVPsNVvT2/WMM67jaEvvT8gr4N20E9o8RcPkelBT7NnWC+5X2DvcgR5T2Oiic+i2Vevitk7b0LEUm+VoL8O2/kWD5ApbI+1yeGvm9pGr7of4m8SPeJPZscDD4bESY+49hEPTf3lT3SlDU+p0gdPQE++71/aXG95c93vldQ+L2JTuW9Ty/YPfR/db0qnBc+9tvnPaZygb4Y8Nq88UsLPRba8jspiY89Uh9EPgMpsLz//SU+TzVXvWO5O72CYBG+NtsqPZciAL4iCCc+6edhvYgcH77+R3e9tB8Dvp2i+L0oTS+9olAsPrU8Hz4LYd08wQZJvttP67xFVmy9WKzVPS+Zu73XWyM+g+wZPoHwsz2WCua9nXOvPbVTU7vyX5E9KE3svbB69b3PwGQ9hOGwvVP8xj1D5k4+wGnHPVvRRb5kKja+hDOLPWL0yb2i8Sc+kgk1PoRmqLzhE/o91ReyPYctf75OuvM7EtFLvR+3DT4VV+880/7EPRbDmz0D4qo8IVJIvoFrdD2W6e49yn0OvagXMz6E/OO9Utqfvbv72L2NPM29lIJtPsAhcL2G3mg+90IMvO/Ov72i02K9sgAVPnlU6Lt4wSi93mJDPsGAAj4x60G+SX8EvuLHhT0SOKc9qtsLvOP9Oz414ke9S8SUPtrW1TwaLkS99mNWvmUeUj6KlnO9Af7pPL9i/rt4vCo+UHwqPvNPT76JwQY8kpb9PCLi0L1L6fA99Lp1PeXfFb5oBPc91ZGgvdAZC72XBwA9vR2SPGVqOz7BJYk+WYZQPpHjyTyKl3W9VsKMvDAOPL0Nfkg9j09yvTywI76x5BI+oeaEPanRdjvs0CO+2NSTvMhLF75Juri7k+n0PKbS/T2DtyS+/uktParB57uUWHG9MyCZPstljT1vSES+JpzQPU7THr4BvkM9gNTQvUpDTD70gjY+zkApPcj+WDyauCq++xlhPm0MX77DYsm9+L/6vTQANzytLai9yDKHO/SvGT4TzOC9CzYfO1/sur3dnfA834qwvdMNL74gI/U8snlBPocEaL5Rz0m+udNWvshEej0v12e+cUoJPV/nyj0Bfx++IVXBvMNjwr3KhJM+LxQnPFecFD5NB+o8GAMyvrhZzj2jPaQ9qh4OPptYFz6WqBk+TxmAvkiSgL5cPyY+HK9+O9oX1L3Tuy4952MFPTaovb1XnX88VUwJPuqoVj7aY4S9rqwpvur4bj0V0CA93NPrvQJdC75vwis9xsQTPkM8fj5hBeW9paGEPo4Ccz5GH8Y9DMe1PFVtAj41VX69qoiePT4Wrj25eYO+MkwLvvgPeD2+jTE+BSSTPAyPMT14d50+IkQHPXvxh76tfQa+GdHkveLbGD4jFA8+cbpcvjpkZ76yGgm+zkaTPmePZL6WpaG9guZxvsIoDr7BGde9m/EsvM4JLTzqwrS+yNkMPixc6z3aRzw9e7civkuSij2aCQm+/Rn5PU/LN729Yaa60+YBPpM8nTyfOAC9j6D8vZd51D3QvSE+loPHvBEA8z1i+io+TjDKPaNA3jsIMk6+KL72valXEj40kwS+92ZNPaFINr72lFE9My/sPH4VOT0AGho958eBPjGIVL3t3DM+qYYBPvbpEr5/Rk+9BXm4PSig5j0kSlo6hKv7PY2wmz2DpFK8sgctvqtKkD2Nrhm+bUq8PdkGwb0885897z8VvZzqbT5MhCe9N/J5PtZZR768kD89IOxCvldGKL7kqrK9mvs8vdXzjz3vBw2+wiI5PQhvYr5DdiA+6+J1vkVtFD730HU8mpy6PVBJGD7yEJm+VqSVve63r72samY8XPcBvn5CG70N8hO+/zlCvef2ZL4pynU9NzM5vWIBhb0OTpW9pmroPR8XW75SrSC+O9v8vF8Zy7wULiC+W1utvO+eiL1joL68TUhOvVFrDj0a/729+drOPGv5nL0W/8c8l6pLvVQATr6cswI+/NVJPa+ahT3WzYi+AMStPXiggrwyQ4A7rBsUvfoBH76U1X++vnSZvVaquz1Qwb48LDcGvmbWkb2BCRa91ciSvbs5C77akpa9ToMFPnXkJL50sAK+zhOcPSY4krxL1Ta+59lNvpWXJT5YxzW+quwSvgqSS724kAs7BCRQO0rLFD48r0C+ey8svmmHzD3ihwg96jDQPAe0WL3stya+E8SoPfWxCz4hBug8hw9XPUecp7xbWRy9ybT+PKToA75TYCM8X6BaPV3z4b3b8eq87a34vWiCij2o57c9f9ecvWJb6j1LRPa9WzTiu4b5JT7YEhm+VfaYPa+cZD1tKNw9MIaZPU/iLr4p4d88nImbvRSSbb5TrNS9ApfBPBjgFT4/22c9UgAMvrDhJb6cw8S90P04PhrJPr7pFdA75uqJPRyC170WEv88sT2DPV3joT1bjCe+SK/SO/7Crb0UjRA9O+DkvQ6EQb5ebCI+JbBZvj93b718eiu+Yy+9PSsMr72JBN+9dfdrPQEAFz30sHw9KWYCvWqJV72lnWG9wJ1TvLrQZz1HSDs+Ue/VOoDdMT5Z9pC9GxyCvXYT7j0gR7g8A8irvcaTXD4WYgS8kmT0PVlcJTzX1qo8vVEvPghwvj3tgQ+8hwDhPRa5gj2Fhg++enXUPXzYbT6Uw+w9AQbvvX1N5j2ZCZk7H5oWvs5frL00fSg9Y0KZPJY/zj1NUae9Q+pbvEqxwb3u1y8+m+zrPYyjej5f0zo+g7JFvpniWj7DpMw9FWAJPVcMRT6EDw0+pzgMvlztLbtubSi+yyqYPLu+u70UZwA+oNOrO6rPh76m7W89TYIxviRFGD7BG6U8yYS4PQRQnT0ySS29VF1ZPm/AR736Iim9HMnxPRIXxb0Y9a69V/HOveKBpD3c7xQ+Tyr6PXfnMb4vSQW9uiPdvS1VTL4BN4O9JLe1PfpX5b0b9A49bNhFO+rwCb6GkTG+lirevB2zeL3WxCm9ChwgPU1OHj5UAJA9DQQwPrPDEz7waJ69kAomPoAVXj7WKmU+D/8au9HRKD7K2hs+s+wGvkW64L2gy9S8bl8jPOGzBL5A7SC9j/CaPSFGlT399SI9ehhvPoaeNL502C4+r38wvbhnlL4TAG6+uniNvkaXgj1P8RG+CaUJPXeLfj2wUxO+7wzrPXq5Ij60eNa9ntjoPS+DFz7pLes92XALvki6yT1A+nk+8cmtPX4CsT0YJTY+YvpFPfTXFr6esNC80WcfPIbYer1+d9M9CoI3PiaS/D1OeRI+V+SivaxFUz5ApyQ9Igz+vIRjCr5eiQE+rW/mPfyYar7/epq+g3uSPZ15AD0T5Wy9YriuPpaNWD7l8DE+oiNTvaDltz3eoGs+aUiKvdfdkbwfyia93SXDPDWfjb2AEzY9HoXePdOIpzw6xB8+0ynpvYs0fDzYVSy8zWRpvUDZ+70SLw0+0n/wvahOjr3I0+Q99/E6PUziXb6MlQA9slqfvfrNrbxTXwO9gvYwPReHrr20E00+dx8xvsaZgr3tCVw9f/V9vf3DUT5pRg+922sdPhISw72bxPA6pe+hPfdCMj1RdI49ZIUqvnjBaL0Dtlk+dRdqvcskQD5ilA8+FkQFPe82hD0/vu69P72SPTgKlL1YWOg9OefkPbFloj1ktVu92N4GPp2Am7yf+VW9CpgAPZ7TYT34c/q9/ZjTvZM+KT7F5Bu+xAoOPgSyAD5JJDU+/WU/Ph4PRD6ylAM+kuY5vtewf71zydU8+LK3PAhtorwxGPY96OtuvfVqHT4AT0Y+YEoNvp9wXT0PVNW9i0vYPTgwFz4eBvm9ZDUVvQvG7L290Sm+s330PZNOrj2x6hM8Qb+vvH0uMz6zV2e+HOg6PuCBnr3R4os9lTVGvZUySz3COMQ9228svKUx/bwpCB89rsA+vXuecr7QJno8Aa5tvWb2U73CWec7SI79Pcg1r727fUa8AMKTPGXjcD3jLBM+/xO5PcGmp71yGiC+VU8qPkdNmDxWA689hacmPdRQYj3/gEE8JcoJvauKBj5DD/k8NAKMPF4to7ytYck9QHUaPsQeIr76Kc69JVM+vjpWvj1G8Bq96v6NvJRevr2EOPa977WavCQvjr2lERi+kmOgPb8SEb5fvuw93RoFvgSMTbxa0Q0+3dPdPXR0wjx/ADG+Tl9cvaPlsrwmYvk9CAeaPTCuvrydXvi9bYiyPOdRYb0B+wu+SM8YO4j20DxS3Ua9RY8bPHkeBj47IeC9OwkHvfC3JbyT9WM93gK+PfZYOj1Oitu9lWSSPYcJKL64v7a9U8RmvRVRFL5tbRM9ywUTvsDvIT3BN7Q8e2oWPnjUd7y2ArO9nVRpPd1CNr1LnGe9GILkvZEbzr2sI4m+uvkEPqcyvr2XfzE9KXIkvXbHlb0KBW++fLKbPWKo9j24NZO9dRBtPYmgHT7TYzG84TObPT3Sor2ip4y82YicPKpKYLyMhME9W5lAvie4CzstLNA9KpV0PA/s5r1ncaE9TpMOvop1wT3JKuQ9uToYvXlVEb4lMFq9lMUWPp0ONr2sqAo+fOYXvgrMK73HkyW+Mg3CvmNQcT1h1J291OOgvb5PlDweOQI+859FPmCspr3Q5E0+EgtCvmxM+bxUAuM7f4kpPq/5Br2grZy7R5u3OoPeiD1XMAy+weNBvGSDib6PMnW9PqsKvjk0vz28Ura9jAZFvsSQyz2T1Pe9BDyBPQVRQD5NHHo+bS/SPTR3mDzYVzG+gDzAvhQZXD56VeM9ii9/PQvVhz3U0x++vW2OPnnuNj68fqC8TxzQvjywYj5uYao+XCC0Pj553D3cjhQ+nwEIPruUHj61E2W+qLqUPslecT0r/eq90W3uvKQ0E74C2ig+99jsvTr44rvesmM+XNllPoPlQT6xHEE8gyJiPlQag70uFBM+pLDsPZM5rb4YMTA+Y5CAPnOiO70NUKy98P8ePk3Q9j3/xJI9ZZMLPT1mJj7U2oo9EgwiPgvNBD79WL09Eo33vRjFkr4Onee902zmPgwSAb2+E5o9BjGXvW8ADD4IgBS+NFNyu2bFU75mZpC7cGY0PhoRnz3hcCU+XPnwPfUO2T2C8E48QcgWvhkkH70sJCy9MHC1vlm4Vz2D1ni9ZHElPebxPj4LF709ki2SvURwuz0Q+Vq+Kwl+vVk1yjyvQtM9wqD2PbzMMj5JtjC+h4q+O48oDrz516e912cWPi+2cz2t81G+K7ZOPINXmz3mVSU+sXKKvsYseT2J5bC984MQPvRccb6HvS29UAAaPi+dS76yyEU9gDhSPmF6U71VI8W80P/wvciBED6kD3K+fJsuvMFvoLyRErA8JUrBPKI3xjyXtFi+vCERPWGC0rvrPvE9ZXPnPBiyHr1kkCQ+1rzavSVh8L20xpA+ashvPRzulb7G6BG+2IxZPQp9aL1TPCS+IrQcvu2nEL0BTmS+n7qBPRUNnLzOSFy+vB7dO+cvyLsUMPK93WAjvWjUfb2Q9Qy+Rs0wvXfHe7zNuCE9a4JAPkIuDj53F0k8uH1KvuHrUL7iHAa+E8/Mva2GGD4cd8a9U6FPPiJ2UL4v7I48nhdvvdqyRT2KpWw+N6+APYROlr6PxwU8ZBjJvVXAxb3DU4W8NmgxPSMh2jwgAcg9a0ELvmK44bx1U9e9wHGFPW/zLL4+al499B+qvbYzwrwEXgU9S1e3PFQGGr7VY4G84ulBPntj6r2DZ5K9NOVjPbtXM74MiSo+AznyvXB6XT6WxZq90/TnveReGz7L55q94FVsvlRF1Dzidba9ApP0vdstL70kFU0+ECOqvMAUkD2YNjY8z8+KPdxiBj5fS5+9IR6zPRgx/D2fAQG+6FwlvRjyYz5ygki+69javZ9F571+Xny+BxU5PmXIMT5e6c89t0mNvW+a6z2PeJe95ziFvX8Kaz13dVA+0MAhPmVoeDunPtw9HDX/POZgqb0NO/a9Wb9Auw5Jy7wp6IY9ySePvU5clr1U6Sw9LRrFPdv35j3UNIo8OOpCvpsRJz5oVvi91AXevcqp670/CmY9vtwRu0CRO75YN0y9kc7Sve3SEz0+coi99lmPPIlcF75wCiM+tDIHPviAlDtczKe9YWE1vrwU+r2VjcM8CNILvlHGzjyGrQo849aHPYUmnj19WpM9ga7kPY9r+zyyEJG9LkuwPUV7BT4WasU9R4vIvewyKrxkwwi8Signvk/ucb1Icyy+Dj9zPZBbCD0ECGs8zrovPeL3772NkLw8pfGhvKoZirz/tP084ISzPbloGb4VdbW9xC/Wvdc7Tb4sroo9lZ66O+qegL2Rbjw+dH8gvlrkA76TnOs5OiPIPNOaJb4ccEu+CAltPSkkFL0L61q9acwHvrJagD3YFkY+HXE6PZkyKr4wOO+9YUYivgcakj1im6I9Ch1UPV8z3725rrA92VE2vjzYwLwQ5R6+h6ARvsea4z1hP5I9BCwNvlSIj7zwgIY9bNV+PST1Fj1vy5W8YPGfPT/Drr2uaLU9tkKOvFMKvj1WQ5U94iLCPHbBXj22HoI9SQE7vRdLBD75+M28i9CZu2jWIb1Zl++9CLzlvJzOKb4jJXc9ljd+PSJRxj38acC9HdbFPeBEEr4D5du86GY4vayuJb65G7q8LL8WvshZaL1wbqA9dTWQvGh7RD1G1Gq+y7k/voKJNLzUTQy+W6RAPY4GPL7Nvyq+3DEQPiSDiL595qA+6FK7vFdJuz3kcDi96tWBvUTD5r2daUY9VzR1vR3xeb3dHLW+d1dBvfjKCT4BEzC8d65Rvs7nUj2kPwW+vxXYvUFb0j2N4ac98rKKvpu38r5vTV6+6e2XvTbYBz4/2mG+TgeLvjnqmDskvyI9ar6Lvfyg7D0T00W+fLsgvmlIHD4Rf4G+Z5UGvmJc67vY35y+g829vOr9RL0gstk8+h/XvcBEQj5Ws6u+CnXivQwLFz0TzvI8FWIePm6Wlr4aAo++H7Y9PqOc8r0OCy4+Mr9ivWaXZz6Gezi+lJ77vUigqb5SoVY+t7ZivuSBDz5Jprq9qqpOu6qvHr58dTo9qGQ8PTI4i74EEoq+PfNWvRrVPz4cRI49Ni8WvfoIEz5SUKG+VP+KuxSwEj1/l7G9phWxvU5WpD0DGB0+UW8Qvj1WA748O0a+AphLPqz1lL0x+pW9BwEBvnqDsL7sGKY9aTzxPfuuHb7kMVU8L0Vbvk0ILT11YBu+DC82Papzk774GQC/yMkHPWS/Ob2yG6C+PPAKvt0gn71iMJy+UOvYvUagBL5Ov7O9yWsDPhzPEDx3oC08CUvZuXP9Hr42LSw9WBkRPh0Si76N9L+98EhSPhTdlz54Ylq9T/EUvZZpQb1Jlp69d6/IvT6D6z0LASg+F/WfvrbzCj77bPu8FmCyvtipGD7R4oC+w/Amvv86nj3GdbC9vFKzPcHmYj4IkqW92n2Kvvv9Cb40q8y84aqsPZ03nD626j0+qAr8vbQT9j3DZHe+/MlFvjQPrj7c1O+8ctABvcCzDj512wC+eANWPkKviz5K1K+8HaXLveIBoL2q3FM9QUEAvavOOr0dNVC+E8L2PS0Awr1xK1++hVu/vYyx2b1KMlI+8YgkPbMrar5gvc+9MK2PPPt+5b1KZis9D4KVPZutjL3YY189GsmrvR8QjTsEp2y9h0sQPgtTGj1gVlu+gHM/PSKKCby6vjg+tvPgvWmuRr3C1w2+Nqa7PbJ0/jxsegk+jpRSPgJNgT6ms0Q9/LwjPmzTnr3hjhS+0z95PkvcGT6N94A+cKN9vnixjr7jmog+ljhWPUNr+z2s/JO9xMJFPbkmTL6AC1++A4hUPXyHv72HBl++PwFZvr5s4T1VO7q9BIECvqhQXz7hqho+LJ1ePFh6gz6fkZ48QQRWvlcfjT7jxFC+PjSPvsJDH75+x2i76iKXvTrGkr4KLnI+y5OBvkp1Ij5kmyy+lH6svhHJOr7DBps9LxwAPmcoU71G2Mo9TJsqvvVupz3HPRC+9/wzvh16qz1S4+a9d242vqigA77+POK97M9QvcLtoT3nqxu+oCsPPS1XMD2vOiw+Aoe6vYV7UTkF07u9mJLPPPPYlT11YUC9mtY+vS1KMr4dS+Y93DqJvQF3hDwZ6VU9ff6bvXZ/LL63TQg+yY4ivmEspzzwYyY+Cs0AvnQyo7zwQaW9mJWRPbDd7DxYcTG+ao9RvShhELxSk3c9MlpavSudub2TWky+bHBmvpwMtry/2RC92lmEvStg/zzQF3g92lvKPdR6Cr5/NK+9nF/ePThwYzs/Lw++7hl5u+fy+L3QBNC8ac+2vS4o0b3kShs8aq3BvPB9oj0d0CG+goNWvkkyYDwoRt29cnIwOxdhDb6oW+S9NlScuQBzoT20iOG9P8EBvp7n873JkDy+f6cRPXVR7b1aMwS+oDpQvpnZAb37YvU9RDEdvUzflTw0Xh6+wZ3wvAuXhLwupwm+FaiZPVGmvLwNlbI97SdxvuiK2z2UH+q797VNvs8fDT714Fe8zdkuO/wIyT2Iihi+57p2vQR+0z3lj3e+5jZcPVbFAz5YOOc9p7nTPV3BEr2PfiA9+di/vQKTS73CO669hsasPacP3T3ZwQS+IuoXvrkXUT2PXvM95SWBvd8Jb70mhCw+T872vYDUjTtewpQ9XTsHvkYPSb5S9gg8xf/KPV4Kp748KKc9+xXFvRR/Bb1yljK+J6ARvX6lpD5MU9Q9DBSYvqFGzD0CP7G+SK8qvkd1Br61ESY+OeEfvjTbCr7sNkM+xEk9vnsgVj7LRRo+HbDOPQCd07xeNPm95ER3vXnxhb2tZts8m8CvvKB/Fb5JGYG+zNBFvUDAyT2M5O89TFmnPfc0KD5Dkz69EdZSPdsMir6R+Us+2qGCvU8feb0LaCU+QA/lvNQcozwSLRM9XHZHO61R9z1f8a690qUuvOUtIj5muEI9JKEmvEMZcj5xq0A+Fb/CPQ7Wyj61F6s9OYiOu7zTOT6+reE9rAYZvhPIzb32nzW+A+WrPaU0jb43wWy+PP/JvFLLM72J2Yq8qeyFvqlgWT2kRby90zJgvjBwXD4jklq8ngR6vgJ07L3LjTu+JQm6PGZIE75d2S+9SNKpPXmR4Lxs8Xs7gkwJvsJ6HD6AD5s9OUyLPJUYDj5+ej09eKB6vvg8gz72Ox4+0xwKvkAsLrv5gTQ+i3OqPUa2yL01Y1s+aRnNukGAVT5kKCk+cn6OPhjAnL5CIy4+GWKLvVgSnb778w++mXKlvZ7X1b1bdTE+9q+MPWemPz2l2ZW+oBsXPkecm75bYyW+DBdNvdutob5rkVy+ECZaPilY8D1Kv7291sjbPW9rlL5DiyA9uG/GPQN7Rb0eEjA+2ntJPWkftj58Y1w92JqiPcGHAD4Qwtu5YrJ9PtU6jz6ferK86FGAPjK1C76gtyq+vQAZPmd6Cj3Ld6+9zWl6Pmg2Ar66qw68/K2KPjt0ar3CbpC94bccPm/bPzxsgAg+cu7OPakc07vGK4s+5c+lO7vorD6xRIs+OEPQvaOO/DykVjK9RlNAvte6nr2dYGI+Al4UPnI7Zz4J+YO9xK4ZPkGuFz77EEi9xo1nvge3nr1NFd29fT5Xvjm0rz3By8a9hHiyvV+cej1lKV89NpeCvV1ChT5xzCG+rlwkPtC/yL3Ektw9hWvVvaMlBT481268bwvovPzWsbxFFzW+QvGBvkCZHr6UhMw9Jxa+PbETSb4nHwS+Dr0MPg8OuD1mYP4989JyPqR4wT3oboO9zolNvD24Sj5V85w+Y1m1vSuMmL3395s7y66nPNhrjz7YQ0G+CX8+Pr7hIr4k1YQ+oSI/vbnNYz2trpE9ti8ePa2yUr21kpu9RxLCvIShRr7zK2w+xSM/Plm59LxRJbe9OAoePrcqCz7T1LY9AdkNvsXOMD3iQQS+akfAvecmP74R6gO+7xRMvnBMgD0ExwK+R0eWvQTLE76R8g0+gStuPTp5lb5KjBW+Z/upvTuK3L02ise9McL4PbXurT0QJwa+kZkcPidrDry1Uti8KctIPnNhEj4sZP89GZrnvS4nuj3McU09euV+vYk0O77OTEU+UV2YPRiFfD1vQ6C9V9UrPcSHlb14Lry9Vx+1vR44NT7okka9mIUFPRiCaTzg4RE9vUDhvbUvBL777yA+hDdpPlBfIzz6OVC9qidaPpgYujzXhAA9QQ7bvfdaYL0GAhc+CsFavScHdr2Tylc96dgQvokD0j2kWWk9StjrOu/oEb5FAtI8VlIwPW4bUj3XSCg95FCpPekk2r18dZ09sRIwvoBOfD355XU8COMivuPxVD6yhQg+FZwNvhQrH70qtVY9bTgdvvtpK7575Sa+wA6LvV7Mtb3DxCi9VjtIvFiTAr43CcU97ZFzPeMXEL5xNKm7tpyFvRNIOj5yPFs+FP1DPTSvej17cBc7mUeaPgcN0r0x0tA926YevYCutL0hXQ6+DDMKvov9xD2cx0I+iAIPPnR5pD0rSRQ+ohdLPtxJET6AKBC+Z1vNvcJRoTyOcMc9U3q2PCUP6b1jYNA9P4HaPdQwa72uNLC9tQETPRr4wDyImqA9pK/3vao3Try8U7m8j5IhPoQ0mj1e50+8+nwAPom0Pz5RNhQ+E14SPvFrfz1cQle+rbskPoFXPjvrhQ8+2O/cPbRkCD52UuS9lAXqvdWEP70wuQ++QS5NPvo1Lb3vGH099NoEvlritr1Nmwm+U9fLPKGZJT7XEBq+RCocPtbJ9LxG2Ck90hq1vcSpnz3utsM9GYJYvtCmEz2Gv449hOuqvS02BL3fVQe9FXs0vmI16L1dwhI+tY6OPAHlDrzBHjY9WT8wPQmuo7z9+TW+RbDAvWLQLz09vmQ+3I5hvf/o/z0KMPo8DkeFvTeRrT3WjCY7oXY7vqGqtb0eNYG7cABEvhdNgr30Wsk9706BvB+CjjyHVp89cr3lvFRiIL46fks9tpo5Pb3fX76S2pE9j1KtPU1byb2hM0W+pIJrPgE0GD2wJXM+NXJdvi5XuT58xCA+Ws6yPYiV1Txtm+48dBsEPTTHjD1PggO+gRyPPCnnFL745sG9tbYtPucVQL5jrJK9+LGiPZdsUj2O+Dg+SsUhvWvbnD4X8BY+JtgTPm2p4jzsMwo9MUY4vazOhj34TBu+f8FtvnvMjb5IaIe+w84xPrw6ML5uNIg8nTiNvm/PTj7yIyW9T7X/vOGElz5dR5s8T97nvWH7gr3JXg482yKGPd1brr2OthA+X62HPboorr1Jmrg7hWAqPqUcNT4B1YG9wGTBPWLDyz5rzYE+FRFUvmireD0iSi89IAg3vqQRkb2TBSQ+Bc5rPeX6JL7ZIhY9fr4yvhbqGb151Wc+YfESvmfgCDrCU3a96f2RvfXYvb292TW9Ie7yPYIFMb7Seyw+qv3IPb50qj06Ski9tzlAPvSmSj4dpoc+6uhPvYjMkD627wQ+wSygPm96uj2YA/O94Vc5vf9VZb7tj0e+xx8APElNbz709hi+MeRlPQTVij5cSJi+AGoePi9T1rqkgJO9MZn5vXOnIL5S0dM9KHPlvW3TIz1uaBo9DxeIvuSwDj7YQJ6+H8ZlvhsFCT5zOjQ+yNTxPaKc+r1Kw0w+hXxLPrbXej6C4Gs92h1bvRUTkL47HRe+0799PiteFD3kRU+++YGwPPyrwj0jp0E+k1swPmBDCT4wxLO80MpYPWhUrD6NP+M9l0TBvZpwzr0WVoI9pz8GPihRcT0kkDS+zTwxvdvVsb7BrMY9SpZFPh5UUDxeT3u+jV0Xvk2NG77zdVg+Bp69Puj7ZL3DaYY7WCifvTZZfj7gabk8o1dEvc2ZVr3o0ni8HlHMvddyFL6QhTk+3JFmPi/2Fj77CcU9TdYpvbjXdL3WaCY+/UnOPWMUA7zwk5y+orajPafNwTxIbg2896pnPtpiaDwMAIk+YURTvYGHgb28nBw97QtDvmks4T3Tpx89z1ZPu0bZDz502jW92wltu2RypT6wyZ+8vGufvYw67b1JeIe9NTIMPoluAj5E3E++7yIRvkxAWj3iXFA9ROVIvuqL+L2XNko+9IQYvgALSb7DtOo9+AQXvgvFyzyZaI69VsFjvcrGczyYOY88lmebvBg3KD5hg7y9niDTPVv2c75vSw4+rwGaOpZ2UDvwVl89THocPnHlu70cCiI+DT82PpX7gjxc1Kw9vhbyvQABGD4ZvP69YVCNPdiwC74pK8A9fNgJvnZGoz3nv269TH6TujUzyb3Upc69S5VuvnJyDT6GYJI9ML5Gvn5kij1s0gE8QJy2Pdh3B7rEoAq+1WJpvRTI8j3QTN08+WAGu2L37zy3o9i9c25QPbI3NT5/OMm7HjUOPdqrtz0bX0W+meTXvUbKB72s6Yi846E2vXb7sr0QAC++H+YMPtzCxD0ZI5u9KWPEO9VRGr7UeAq+/DNMPdP5eb3jEVu+nNKBvLy5grxEBzw+oTuJveDteL6E7r097v8pPlMQZr2Gk2A9FGsHvoEO8r3OVgG+tHsSPq/cN74Mfdm9vWRIvSJWYT3eYl09F4EbPYV4JT4duQE+AwHgvVhVizusXJi9TIjMvUZLUr6P8Ba+B8flvUtA+73B5f293s98PRX8Jj2LQDq9FP8avc0pqz04WDW+mgnhvOntXzvdA+O9fjGvO9qkrTzGKBi+x0cGvqNwzD0sfyA+cV5RvScN37u3lrC9mT6xvViJFD6vw9U9FK3BvZOei70vahO+kEfKvFlsTzup88C9LAikPTI6wD2VnEW+/qe/PAEi1jtp2io+Gtwzvsza3DxDTY6+BGwAPPja4D5Twk29wO9XvmaGCD5Bcb07TJ8Bvbjs7D32+Ge9H3dcvga2BL5MkYA+z/gZvhOrsD5lu04+/WLMPbI5Uj7Ivja+VOg7vdTN8r3Ey4k+YmrnPcXoKr48wwq9MICFvdZp2r10HAg+hR2Avg4P4r2ba9W7tCqCvDq7nL5bz6k92ziuPL6yDD6Q9vc9VLYMvlQo3r2Ksy290uRAvTvQ4LzgT769lvbEvI9VSr1N/Fu+ECdavo2V+72SrVw9gUCfPJiq7D2WPxS8tUIWPmKfdT1T7Zg9+yzAPFy4lzwTqgW+ppAHPuN5571250A84fYyPvMKjj0M+uQ785QaPRabzT2Sb9Y9uLgQvjLnTz0kPaU8jZqNvYEV4T31uAI90Z/3PYdAnb3OSBO7u0rxvYgHr75Baim+MKohvlfY8T17YEg+JQ/APbYOK75wfDw+110FPcCUiT4aMAE83oBcvg5Cgjy/Yqk9yxBfvZMRT7y5ZXE+RUAyPmqzArpblZo951FuPrqtVj1UAgC8XqvwPFakmb4sWu69nYSsvWcZBb66imI9+FpHPtRbQb5Skbm+6Ad4PgSmrr6MKDs9dv4aPSi6GL4JLhm+mT3SPRvyQ76wRl2+Uy6evZryib59bQ4+kn5KPoCrjr4BVnq9sdNBPLcpGj59XOu8AQuBPs6IR714VVo96TKCPnuCkT7IJy2+IOusPMKYBz5GQbq9hIxjvpmvxL0Ox4g+el0MPCvKhz2ViV2+Sjy+vCXWOb5sJ8m90e6sPVPiTj5XoR0+pQ8jvJG8Wb7TTnU+/MSrPcHslT4BCMM+ljORvkjhjD0KBK6+XlFlvaGyKj3z1hQ+RBtdPXnlGT5Y/KW9rgBPPQVkD72HFrm+NNacPIHuPrydYDa+3iC6PWqLbj0z3Ri9adBGPorCkL4lhUQ+vo28Pc9k4j0RbcC9iZLyPbf8Db6NXLY+By+FvvsLFT7cZi08GGyOvlVkjz7qcVC+heM7PgX3g76GeZU8xNYmPQoN7L0KT0C9vaqaveECOr4Tjdc9ADJjPrPlbL5c94u+cAwrvnSo6T0zU1A+8lkUvbI6gT1cAdK9ddqiPj0dbD7c4gu+7n2nPi7Z6LzNQLA8tQ+zPXrBmr1F4Rs+XS8EvISdEr7AyKK+rgvNPf8Yi76tCY08kJ0aPjN4I77O5uI9dzq0PZDxqD7LAJW+uGIhPiCx/72pSR2+YoxyPTl5bD0FD4k9mc45PU5TZTz0JrG9WJzXO0bWtboleZy9xdv9vVlXpb3hgye8lVwyPfHMnz0gLpC9re2uvay/B7t7x/S96eBaPt4fLT0rEYk8a7IRPrDwoL3MxLo9RvEvvUV5EL6xnAe9xOUbvkZRAz6d+Ww8hlW8vQKADLz/9K29yHo3Pb4GsTw/hCe9SPUfPnDJir631Ge9ifGtPd5Mmr3vDnu9tm2vOumFJD1QS848fkqZvvElCr7JeFI97Nh5vS1GBz0dRkG+4nUJPQ+0J71XQ8a77dNWPVvZqr33QwC+sacFvtBz9LycWpe7dNcZvfyzmD2ouVu+jBREvvCrmr0BRpg9CxCRvdkHDLxirHI9JmJIvGAKDz4Xqgo+JIaLvZPntr3WfAi9ptsPvg6prD3SED6+WUErvpy9kT1lfQq9PboEvk3QpD3H6gg9qgwiPHoOrD2h0P49osmqvR98Xz4KuAY+c9roPFTEUL7ThEA+sPwRvT1yej1xG3y+9ma8PVznrr0kZgc+gjjgvU+OA72lMyC9wBQ4vIZGy71Q4Ca+erUPPsPDUzwNW0y+qGMGPjqPkzyOK0s9Bf2EvloShD1eQB++3TC4vSo9YD3TXbM9DpiDPWdIWb2nS3C9EpeiPVKDQb6KCxa+BUmxvf3cH70VeyE93JbQPcaVND6ofwm+DyGlO16NlD2z0Lq8BqSzve2FkD0aQ3m9w9fXvbBUbr0c6/c9UHjMvGtdTT1+WDS+nkgEvWG6lr03jgy97zqdPRJ3pT11YJM8UMNjuvIyF74gvT87dt9RPrxZLb2YcDE+UZwNPr3jPT23plk+GwSLvTxpub3QRvo9K5hhPrl0ij1hmWy+fm8FPiZPlD2i8Wk+pMxovkAx2b2Qfgq+rWzPvfm/cT7c948+ZbrqO8Y1gz5z1sS+Pe4Rvf9Cezz4/WM+FbhHPm7Ukb5AGCC+qMTEvS6JubjKtYk+MbAjvmHnNj5yyOe9krAKPqaudb7zi4w+6SimPWJXkj7vINc9TvVHPbERg700xDK+uCBHPuGlwD7Yaiw7Xcg4PS3dlb45X029iIdEvuWc0zm5Uqc+KEaoPvoAQj4XGyU+XHNtvI/KFj5qNMM++wbTvWUhbD4HWx++zpNqvv49Eb4lc7O9uPEdPuOLAT7eLSa+GRTevYoJDD4CDgA9N4VvPSjKTD7ho8k8KSglvlb4q74N+x0+ubA4Psr0Mz4Ovoi9QXqvPjarFz3DW/29Oz4CvsOxAT7sUFe9g+u+PUEKhb7SVIo+2iFYvlofOT6qkwI+FFiGPrHbsrz8Mo0+QsWZPqfDLb3Lwx49VGECvk4+rD1Uuuc8jYzwPRMU5r2+h5q9qqkXPvhCb742FvS8rARUPoWo2b7Ti5S9LAfTvE8+dD0fL5q68SBAvQnjdj5wttq9eU+xPf8fYDvOvoE9T1SAPngTur1TZ5K+QlljPvYIfb3lKea94eKUPfZ6K74BWXY+cnSXPYLNdz5sCsy5YfMDO+AZJb7valM9mefRvKiP/D1dGeW9rcrMvQRx2L0/aUu+s0x6PjvZ473wblC9pSjQPZaLc74qAI69sPujPH5md74ZQci9wXhpPRzakz0Ldso9keXcOwX/LD4C55Y94S60vZAn/L0xicM9bDZPPfhkjLySOF2+G/HuPXm9Gz42mHc+VlOJvkxfNj5uSO28iPW7vKu1zb0uX8K+bcLLPCPHUDygR1Q9PlGUvmf8aj4SVAS8v662PTIdHb5MYDc9pB6avQZzY77cccW9P5gWvk/9NL4w8UY+Uyh5vPd2Az7KDp29P/1iPa0+jD2fEEQ9jSKuPdukf72Yjeo8qXe1vX40Hz6z7NE9r0xMvmbBkrz92K68SlDTPZgpnjzlGKg8XpFIvaYIpj3kdZM8E9BUPT3KVzvEnAw9AmaaPWza972MDB0+o1JqPhFNUr2hxGU+m7JdPoLAvr1vbuc9oS0QPAF0Nj4LWY68qpODPW1G0z0Su/w9GV+EPv7fBL2rzWM+1FwBPS4VQj2TN/E9OkeWO9hiN75OJrG9oq9UPRBnw7yksBA+G8t/PUIeFb5vbxi+ggtCPdLVXjyvxsQ8Xtw3vtcyi71KhPu9CK8bPvekRz43Kp49wm/aPVdf4b2815O+NGkmPqy0pb04xI098/xJPQManzxrXrg92+H0PaF9zj3BLMQ8K67RPa4NZbzygLw9M5o0vofIHb3qFcQ9ME+RPSo5Bj1jVIK9zP95vbaP1ryDcI094XlbvgaOpj08PAa+45frPPhaK71AzNi9uJBtvqS7Tz3JV9Y8HYiDvcvKsz0fGTk91EL6PX6LKr4lQ7O9sHy+vX5KfjxhWne9DUMSvrnNIr46qKM9wJr4PFd2kLsxC228PpOPPWLnir1ZUzG9VWilPfy3Ir7NZhM92mw4vnKeHb5kwCK9fbKzvZGJzz2K9P49ibLQPJFNO70GfTE+I7ATPQEfD77R7Ys86EOfPHDId72MiwO+nWuqPUzAKb5rZUG+IfB5vVWuQD2rx/C8HAlivWyYmD23yCk+iq7iPcyq1bwVfwY8cPjEPRez97zc0KK8stXoPRcg/Tk8CXY9Ld3FvdiOVz3PqNM91QdXPii6Az7xmuK7Ade7PXQLz72bs5S9HRZdPGuJqLyK/EQ9qtoIvl8KxL1ycOQ9XOVcvXBPoD2Ccjy+HR8Qvi1yM711fK298db1Pa8X/L0wVnc81FaAPXwUCz2BUOe9CBuxPZJBDb7JZA09B2h+vZlEFL7wXYy9Ax6Mvf4rnb1DkgW+bP//PLycRD0LiDW+rWUQvoRvBr7ewi+9BqRsPRXvbr5X8wU9Wyklvr6W+zzF2zm87KCFPmMbEb405G4+NPryPRjhTD1OsoU99tzNPCt/TD7JoFW+WKByPmZDgD7m7oQ9GNSfvK5FBr0VI1K8+g/FvKmROD4WgOU9TUFJvlDz1z0MMI2+HNawPc9B+j1K/Je+9IAtPfRHsr1fH1U9i8gTPr+BKL6Hkyi+YnoyuyZxgL5n94k+T+sxPkCJDj7JozS96hotPGza172NdWM+QHbgvDF+sD3sEQg+POFaviMNiD35d0m+Slxyvf/puD2DyTA9ufqxvMZZFj2mBho+MwzBvqfFAb0RTRY+ajEHvkjVrrvwmQu8W9ptvhWm9D3k1Aw9MvEbPd7XPb3cK1+9zl5WvrCtdr7E8pc9y/YGvkXvdT7n/1K+F1b2vVzoBD60mDA99ixnvhGZnb1gzFc+5QrpvVYsVL4yk/c9YesIPn9i3L0daiG+kWnzPVARV776h8W9O9BfvWFwIj7hxd28Ii+1PLgKJbw1GGE+g7XCPGf2Jb6SFzW9l6kVvq5rKD7nExw+1IisPZ4E+L0gW1M94gczPd2tVT2IbwA+Yv6DPn4irL7DLtk8zF9DvmzGhz0RBiq+X6MdPp5+HjtFvZs9W3lgPoVxMT5JLzO+FSjQPa6DgT7UTW++HBurvD+z5b0zNbS+MHVTPnfP1T3/66C9ym3OPbOMqL3zz209ES2KPt1+ob4oarW9MN0HPkECEL37bNM9pb6PPiRnvL1PGyG9Pn6NPih0GT4KeLW+gx4Rvi2Amb3W3VG9CFYyvjoaTr6Efr8+lWYEvk32Q76OuZI9nNxQPgFFcr6pVv49oiQUPWKjWj4hgyU+9EC2veIaBrwHICY+q0ENPrfOYj4leCM+wLe2vTQgnT1NeWk8GswrvuF2kj0xZ1E+qcFLPqgQlb0LYyo8RGfuvH74FT3/ycK+6ixpvoRFqj7zKrA819Slvl5ImD0G4Ci+2Cl0Pvu6a74o0P+9+ZsVvfFuNL6zesG97i6CPb+PaL5xooE+GdA9PpFxA77tJSo+RL0ovlaoQj3FQJo+02AlPjeRNL4oCbw+DiF4PPl7Jj7gWt+8Jc0JvRtQprzGNQk+rvGxvUO1NDvTU6S+RPuVPkRZFT6hDkw+sj5cvkBqOz5LEqK+YjUYPh6ZnD6gv6w8f/upPh9ikDtMSoi9P8WyvYcuqbyrKeG90whCvhimmT0pIpm+MRixPN/5Er633UO+4uALvmlB5jyG8xu+C+aOPT0pSj7DwWW+y/ZhvktQu7v8Ihm+twyVvlI1frtFYSc9iyY8PlTdTL4O4kK+xPyzPQdP3b3+z/47Yz1tvi+sP76iEIi+hvp5PixIkj1855W+3yMcvom6RD22BUO9kvYUPTH3Ez63R4Q8UHsNPoBNuL0CSMA9ooK/PXnSNr0M/Ie9kcC1vft5AT6mjXe8gkNMPfQ4tb0d9BS9UESEPRFJBz1atOK9bMrnvZQ1nL46Ucq9jhS5vMLpJbwXIRe+oL5SvTht4j2JhzK+WIkMvgStH74CdSO+RRo5PbXnU770IO87UlO4vCTPHr5jbD4+vEFMPfyEjby1Gyg9BBYqveBajD1ngXq8RH3avCq/IDype6E9QDNivZnDIL33E5i9UXwuvX3nOb6Jk625/VYgvqwUJ74SLVY8mm2APVUBDD5LWC09KLCqPefleD0aIGC9FM76u+VwBb7Ip+E9Jjlavo3yib3aewm+wyvUvSvf/b3NWIg9aFshPYrjwD3cQ5e8j12SPA/9Ab3pUEi9JnmCPfF6jT1SOAq+yNhKPncVnr2ggA89AHIxvMWPJr72EUQ8WSqpvS9u8b2S3Yq8OsPNPUxYzT1PZuG9bWV5PWlbFL0Rouk9eikyviO1HD5n9zK9rsR0vqHwKr4js269lWHBvToFADvKezm+VX5YvgieKL3cbpc9M4+XPeUinT1HE7W8dHT/PTQ5FD78uuO944JnvClTzD0Ztxm+rq6Bve2SUL6lQwk98OO6PfXYKj3pCQy+jORZvEro0D0AMKy9p37xO7ccZ70I4wI8AOfnvTPm6T2Kd1C+i4yMvjMRjT0LwnA96DE8PoazXD7n4tQ8hsrZPGWPYT2Ud029Xg8mPZSDUT3QCJU9twuIvqBQ2718OpC9O8IHvqfLeTtNjas92dPsPc5qHj4pG3q+BDAVvuW9u70jjBW+BkxYPuEXIz4E/CI9i5NbPpZAtbyknTg+PzvFPXxNlL1CetM9tzNhPrDmC74VtLw92Zb2vZQZEj5i74U++y04vu0glzxQHCQ98fMRvTHpez5MCGY9+CARvuzXRD35yRy+VB7yvdg/aD2q7CA9OTzrvcdwfrzd4uI8NpeQvbG2v7x3H4I9Az/nvK08Y760xCO96uIJPl4ViD7pdZ0+Sni3PQRSJ7xul7G8onIDPjFiGLxcjjy+m4DAvX4QwLzTBg++1amRvTY2/LxkGGS879BHvhS/cL4/Kbc8EZ4AvWsKEr3e6Cc9D4w8PXxTt71qI9K8YXDgPSERBr7bamq9mBzKvSKHLb3M/gY+q/1fvZxEer2Bmjo9otWZPa3BYj4iR4Y9pfFoPDldab52GeE9vnhovemGzTy6INw9c8noPUdxQL3+meM9vBjxPLWwlrwd8N29uo0NPuGydL49Zp090w8UPlkyT7zrINA8ebG/O3fXIb3tBum9l8qmvB+z/721j5c9hpFhPh8tJz0E8Qs8SY3IPamLiT1kFaq9ElY2PgwcC7xJE8g9XuUjPqjdAL5AZzA+OgiuO5d+Bz+7/AM+2t9juvEwCj6Vd6W9RrFzvUpkAj0PBpI8hiKqPbRELr7voSE++X1CPfYs7D1/Rwa+NaxgPhdmGr4BdcM9FXyMPok/GT7suyu9475jPpCbh76X8lQ9sxN1PhdGGz76Si8+5HUMvt0Eor0rRxc+3A0UvUE37z1TS5++4EXNvJeo2L3UxNc9OSOcvkoNLD5C/WI+tHgNvtOz/jyMvgu+O+DOPKuQhT6ay5k+kc0hvjezZrz925M60+rMPO4leL1aEAC+sgPbvU9NrT25fuG9y3xNPrHLQL2ZVVI9zquJPPZq8z1yvAk90YQuvnZF4jxuMky+FQXBPbQvRz6zxU0+GcoAvmGREbyV6GA+qeESvq3yiz2a4BG+Bw4BvvZjnjxfgFS8j/WEvuji2T1bhSO+LhGFPZmL/L0tjh6+mcsmPlThu7yOpBU+MredPJKvhL2NpHo+8iLkPffNvzzpjSi+ePV5PWc81Tz9pwC9Gz9NPsa6cT2pKaI+iW3MPQPSjD0K2Cc+YbaTvUrZFj1rehq+UBQ6Ow9DAr4bb5c+5rOGPUwZzz1xXjg+05MCvlDzDjwDYE09P6oyvut7ZT1Thrs+kZnhvTrbfL3NgFc90zjivUtO4T1SIhA9rr6BvagUZLyrMu286PhuPqEc3zxNC069Lo6fPROOJ71PASe9R1c2vZwqlb3fF629Y4uPPV+rWD6yvis+xeYnvpFVhz1/mWG9sas6PA6VD754pMa9+2CCPMaWor0bt/M8OpmBPX78ID68gPw9F7m8vVKr/b2iKaY8GJkHvtYQRT7lxQU+lcvPvXJdW70Hd+q9nkYHPs0xOj2N6PQ8wMCevHQCnzz1mug9uVZfvvU8a7sey+O9qL0hPnREoz3Jdsi9lecRPHFukLu4Owa++wwWPpTQx72blmu9UK8uvcVxF7yMwL+882c3vgi54T0kyq27IhM2PgUjsrwtdM29jRx7vcloEb6CHyW+KYmsPQUqFT0B5Ve9NQqNPC8jNL0A8sO9+rt/vZJzMz5Hz++9EHkuPb2IMj12u4U9p0YivoWQEj55E4E91glNPjPf/T0MXC8+DiSdvIGzh72qFKk8gOGWPcZGA7uhpmQ+l8n6ver3Jj5de7M8rJPGvXO4Kr2yew6+MLq3vdlSrDy4L2a9uUaKPbLjQb0VrWW75/cCvikZmT3/0NM9mU46PXciKz4j5TE9IKgUPeQznr3Jl0G+9KwvvsP6gL3uvAs7QLnKvUzmH708ygk9wNcFPQYV5r00aI69V2HyPRX03L220qY8KkS1vC+8SL5zYBI+sQOnPebdlz3uiKE9Pcr8vQi/ALwPOfG9ABbvPSNbvbwtk5O9pwGcPRCccL1sh5m+jd1VPv/MXb4J7te9CrjNPQirpT4+mR8+oMewvcy4VD7f99C9I8xtvdzARr2dGmS9FOvOvNDsB7xwEP29Ac4KvpzoAz6HTre8XdY9PjxGsz21WdO9OlIBvPTTbLwKiyC+GsObvYXjzLx3/zs+c2UePQTqB74xQpQ91kJovnB9Hj6yGIq+un69unnADL5bD5o+95sJvAouhD6YuIU+aWKZvvizEr5cgJs9Xm2MPiKNmb2LOgY+7FqCPTIWFj2O6289kIv2PVcGKL6gZeu9DC9Uvi4SAD1fltm9tB0LvlWjNz6k7go9nfTWPVUoUr2n//K9BY+aPcyPzb0F7qk+acw1PliQU75NicY9hFR6vYyci7uvunQ+NaRvvq1fED4eD/O7V1rnvSWYXL1i+GE+XlW/PJBNgb1RIaI8jK78vdA5Br54W5y+2cTSPcwMBz5+ke885a1KvkRKnr1r4G49Ne6APYWn3L2pOai9dzzkvGmCr730g4A9gcj5vZjmn7yFVn89L0hkPVTGX73TxEu+9UAxvhsGIL4lBQA93ldXvbO3yj4IIw8+I73evX7yu727LCq8GfEEvr+WQL610z++//SdPHIisb2X2Fm+XSwAPmTNET5vb3++qDBIPtNAwL2g9NU8arQfvt0JBj3nS7i9kJ2sPlqawr17u0o+6PfAvVoAVD6YiTi+yRk/Pu8vg76RZzy+eiNIPjsbubzqzby9nL8CvqZbuzwYYam9uD54vmTsfr4Vsbs9Kfodvl6HTr3LP4O+4iijPWv6lLyjij++iucVPHxbqDgSreg9sJyRvS0LTb6GXJI+rCPHvYn1/TwePFg+DC+HvQXRHz4Nh0u+YRdivorqLrw0uoG9fGJDPWJsDzsvRCG+XaCnvepILT6zyT491eIUPc+S1L3bs7m9mjolvotCUjxo99Q9xY+vPVeh170t2bo9jCqPPTWS2j1WrRq9B+TevbpxJ75BOS0+hwyEPkjfiL7bZqY9k9KQvjUtfb2C2Ak9peQLPjsxJb5MUos+x+IPPvc3pT1SOhm+rOSNvTi6L75yCk6+wx+JPl4RG77Lv4K9elyGvVTjTL4218o99D2LvpJt2D2b8SW+IcWePjLCdj5wYL09mZAfPk9wwj1kVBw+z2Z4vUyK176OyRa+2gLHvI5Eyz0XRL6+mxCSvZGSkb4z3zC+x4Vnvmo5hL52zE6+avIzvuJtkD2WJmA9iBGrvbbRa7113vi9TmExvIpdvb1dTAq+LvcyPVqG6L2SXFG+RFIEvtB6Pz3Obau8uTGgvsiJkL5B0AG+n7OOPhoUO7x+OQY9UPWjvjwXlT4uOSe+vzfaO6fBPbzTsTA+p9BPPvaLQL0TR4o9eDRJvWgjGz0+9m28v414Pdz++zxxGbI9tovbO/xryTzAJP29e4IrPvLnOj4VbOK8Qa1QPkWlTz59Q5m9XyIcvCgtgT7/YIU9DqgtPrSkN7zQy1a+NcjLPWCmKT6hRYG9I7arvHlRlz1Mfyg+qAFgPda10jxkMgo+UlOtOyvk3T2669c9O+4ZvRhs8D2izkW+CZyBPEmWhL0q0ps8ftrCPQ45ozxJISQ+mHwFvr8VMD4uW0E9ZmMcvuh4qz2MDIu9HJ4zvh7o4juaO0U+j8opPku7S73e60G9NWKaPTlJKb4FDIs9LVsFvYFj+Dwyug2++jn8PF3RIr7MEbg9uNQaPcKMYz6Np3q8AbXUush5k73A02Y+aggKPo1GSj5NyJQ90K6BPs/rujxUMr69BJbqvf7MR76gdkY+ZD55vc7pzb2d8Fs+gJ6SveXKBL5r5t09QJl7vXvTKT0LuBq+gzgsvls85Tng7jM9kVusvQIXFr73pWw9hxPGvYRB8jzR+l09fh7Cu/wRubw0xoE9U8D9PZvx271w3dC9F5wcvdMi2b0zS109Hi4iPPc6or0Bu6I8YMwEvrwPJL63BI69ReinPfd/Jz03TTk97GOOvcsP1b3Y+mU+8bwbPqFI/72/Sby8guxoPkI5T73NMwE+QeFdPr99pr3wSSK9mq5RvRJcWj4JDhA9LvNIPds7xj01io89DcFxPeOXC76pRGS93K0evbaLij0TMjQ+cDIZPkuAeL3EPjO90HoJvvaMzj2meGE9m+EdPlWVSL2SIz8+Xv6FPtmf8r3QwxO9dSMLPhsbR77AUhq+xf8kPiE0Eb1TQYg+VBMTPXCDC74fmAG+cYX8PcILoj78dfa9eI1/PjGpOz3Inw+9ExlovTISdr2Hbw69X/ZMPl29xz1LtYk9U0xOPkVSSD5dwQq+4aWWPUMSP7zG7AI9eKfOPbni0j3XizS99mwlviDy37yzUZs7aqJ9PUvrBT5QHhG9q6yMvfoJc775PpC+Ka4suzGT4r2rQs89fLrfPQlrR70ZqqC9SY0lvjOshD6ys9S8TtuyPHS1Gz5LDuw9s8gYvvUmEz506zK9kDtovuUy6btAPCa+tQrkO78edD6BE4Y+Vj14vRgGNb5h/XI8QYyhPYoqV72tgqy91QBbvpblyb5YM+G9DtNKvvFPTT23Qpc+2n+sPYHBgD1stiC8P7w1PVM0xT3yEMC9r9JXvg4hBb7WH5S9qVUbPTg5lj79A7w9gER6vZIwlj0eWig9yjKPPgHQ7b2C9os9nkL6PZBpaTxmo408HH5EvdLyXT12poO+4IxuPrAxXD5/U/68XIULvv/3Uz5x4IO+Ba3PPUQGTD6xR3C+aZ4cu+lZLr1xzQS9Tfy9vU76wz0bFK09H1wZvFrOBr4Zy2S+KWNXvquMBT2uRyE+4wClPbYbyz27sPC9L/LjvbIzg73zN5a9Zesovtx3cD0DdLy9OpwOPmThnLzzeoo9akjTvFdScz2jL8a9MYEGvETZX77Qchq+le1uPQfgCD6omWy9eoRbvczHA77pvpq9rS45vrEXZj5gsiq9YWPuPN9OUT4DL0m+MBhlPZKZkb0p0A4+oBxnvunFjr1qxrS9OOQUPpfhpDz4k/K9gYO3vaf5E77HV8a9kRUZPbfjq772NCe+43V3PuU/R74gl4k96rz6vdWSqT3ofQS+0AkIPjH5ED5UUgM+lX4YvS8eGbzD6LW9eiIdvahiTT0Ub5a8qtAGvj/V47xTLOy9coH5vT9lQL45mcG8Wx3iPHqAMT1V/Pu9pttkumoaJj14VKu9yOMJPlyuWr0HB6A+qt7EPE1Pbr3A/Uk827NFPRJWpD2WQvm8CBAaPuw0ej0n3Yk8I5vYvKuC4D312g+8ilbUPVKatz3ewXw+wnF2Pi4cmTw9Ta07WRhpvYb9bz1K7xi+xs8MPcCbGz5EUXo97uEgPbwWZjslkxM7u2K7vVgknb7iiQe+5c91vAiWzz0ULme93eDivdJV9z3Zp8Q9TiUsvQFNjT3+Cgy9XeXPPTUJEr25nmA89avoPT3jaj2YwRm8zdHMPd5bhz1Pa0O+7CQmvIO8h734Niq+s1oIvt9Qmb0d4s+9B+ovvvos9D3Vldg8sUSAveDzv73Roxw+VcwMvkw7ID7D+h69C7p4vUg4+r2YrcU9CY4Mvka8Lb6O6gE+xwK9vT8cWL4E9Q8+UDB1vrCIDr0CA2M9LvtHPRck2b0onp093/Vxvd2NAr6E1Qq+QR7Xvdley7yVVxm+RIj6vTRBA77kpCq+ShgEPttEDr7bxLY9xAXIveL39r1Bs6c8JO0Rvkeb8b1+R9c9K5VkviUL/z2i10m9jP6GvTK/BD5eTMS9Yxt2vjQiFr4hPpM9/ZEOPdG+Hr4X7ZY8FM9pvX/sTr4pSy49EigaPg6kjr6n6J08zuDevHxtIr44o/s9nwaaPRUDFb5UQRs9Yr72Pd9n2L2hlTQ+UW80vpA+nz1eF1g9NcTZvaGYhryYnEu+iljsvTvQ/TykcTA9zaqyvbPppzxtIDy94Tk4vocEubyIfJA9cJTiPU5mlL1kiKY8kkgsPhF80r0rHVW+ZLlmPWMb7Tx1jYu7Wd1HvuBXRL4L+DG+qLQxvslB3r0EMP299c4tvaHBhz37LWu97PxvvKPcj70bABE+JS+5vRgUKb449Q498hemPMGz8LvHexq+EwgYvsRsPj6+JGW+z7NZvGOzML2lx2o99Jd7PZbZnD0Pz0u9aKNDPg1EFD1DppG9jIq5PbUFcD4xWje+mFagPfgJiD27Lhk7nCyAPkuZ+b1DYre8Bh3mvX07hz6J3IM9rivIPT7pBj5Okk87Hq8CPgahQj23Wou9HuflPPDoVL0EMSO+0ghpvV2+b7yIL2I+vpNSvsTxPj6ZEyA+uH1XPRUipL5+sUC+bBEpO7kKNT5omBc9cD6TvsKgwj3ZYio+JgzEvbCYirypKAs+irAPPpkPy70DFTS+2/V9Pkj9wz1syt89C/GwPZL2cL30cjC+3029PYaBbzyJLAM+CgSNvX40PT5UrCc+AmRLvOyoUjx3awW+uti3Pf4ZAL7yrQ0+BTn3PVvX8DwugDe9n/IMPk9GzT21xcS92iAGPUaPZDv7WM68pJ28PW3Eyz1ncXI9zGTcPSwqLb5QeDm+WuxqvTbE+L0xlWy9mQV9u6UD+bzkak0+qcBhPpqgGT6KP+A9PHwhPpVxmr3peoY8nCwvPqAlwD3y4SU+6dINvgaCsD1YLSu+CZWGvtAZzr1pxIm9UJEcPfsBUD2fBUI+7TwdPnmzoj2HdPM9vdIWPc2+uT3BIgS9nBT6vW4ocr2KB0++AgflPVpxKj7SHye8TN+rPn2ZOj3j0RO+t3oNPv0VHT7tNmM+3YWQvp1VAD5HMya+EPrRPbfc4T0GRH+8azxvPg+n573vCy69DTx4PnyvGj7B7/G9l+wku3mwmrxWmRe+xlm5vRHDMT0EESo+6J7BvT3DcD2aeKu9TKebvA2Yv71nOHm+qORBvqQ9cT5YP18+E29IPhKETrtP6Xg9mvwfviL+gb4Serw9YzMxO1lk+z2dPDi+e/yIvj4WkD7YXxQ+Fd5HvkJXBj5O4cc9M7oBPio0lz787bS+ojQfPiLzBb0tPha+xaebvUdZKr4LoYC9a1SVvYDtJL4OwN08e0lKPSRONT4txqU9l1mJvdFzAj5vYQ49Yh+FPTe8HL6JEso97SolPZo8CD6VCZ0+bhUkvlNEw76byQi+WfU6vih6Hz1FMqc89UgrvqthAr5rlx8+u5wQvQJThb5lRG2+qrokPklHsL6M/pY+soklveInCj4i4DG+te87PTKhXL6oLE09tcEqPn/B/rwRIsg9tYQuPhulmz2Mgrs9RuA0vvK2Tz2Ovjq+mjmtvSOnWL3sDs+5/p7XPYuTyL06R/Q8u1OkvY5uzD10VaW9f8+JvfsuIL3JdT08qLcKv8wY4Dz2c8Q91Nveuw+TjD1Yx4C985pwvbFqRL5rrje+OZgOvg7dFb6FrAG+DorMPcBbHb3uPAi8kUarvViRbr2neGC9e868vAMPkD7qfoo9p0qMPWSN0b2LkTO7vfMJPjLbYj3fafs9rHyIvbKT/bztvbq9uCWIPR2jPr5pzUA9ILucvfd8Qb4WLB++aaECvhSQozxapuY9a5EjvoeiB73pPHo8cykGPFs9Yr7MwX69ad4PvrZK1r3r0M69xsiaPaFhtz3h+229hrzVvEXgsL22snY9xsrqvexdFr7tPlC9GcBVvgc7y7w0uI88Beg0vaXNgz20gpA9J92LPZDgJTwce8I9MgPhPG54oz2MrQa+hUWjvJA/7j2UbAO9UiBFvc5KPr6EO06+UcLdvfSkgL0ZxOG9dNjCPXUDrjx/qxc9Ji8xvh+WqD0w9wM+mCozvrcVOD0X2sA9B2MfvuguFz5/GCW+iq4zPMg38j3/nBe+38xOvl4UCD7h05w9lcS1vetsgDy5YYA9iFJQvYzmWb1s1Mg9mQ5cPMfqkzvAhn29YewRvkPNV75erK89zI0uPqLPnr0gI1y8dkfZvIwe0D0mdgC+zCFqPftVj73DDDo9qEXiPVBbv70T3Qa9kxNCvtmjq73sumW+bDmcO9T81Twe0Le9IC0/PRJOO75fHAa++yxqve9tbD02z6K9Dcw2Pa1R0j21zSA8yEqfvTl6dz2Y8TS9ZRfiPfRf972hQJS8v3ZCvVReo70G/Lm9Z3FCvpJmQD5KjIC9UHjfvUvlrDtYcfo9kO1bPmqdUz0CATA+z7YkuzdVdL6drNO956YkuxzBfD24or28I79QvnnuKL1B7pk97iHBvds7Jj5Qy08+HfMkPo+wgr2dhlq+4TzZO5yDSD4Glj081qWMPgqLib009QA+c9oavMTuIb6sgJw+mg/uPZ/0az2PpgU+oDcDvnINYb7TPBo+xkXHPPIAlj0fn309QerQvXtp+D23x1o++SoKPSJ0Bb5jqyE829bbPNebBL5j/gW+60yjPVX/uj01U3U+KgOMvRgU4LwINZw+/rUIvsXRAL4uzwy+F7x2vYVjpL4VFAI8SQbFvHeLXj6kili8drXAvd0CFT2DyjW+OKw9vdO7Db7RRFC9jwwWvFeMHLwnkHw964Q3PegqCz5MiQw+vx0QvvOlT77Q4Ac++AkqvreqXT0YN2+8gKEZPh/PTD6k+QU7/rnTPOGzeD4iHzc9wZyGuwk0uL206UG+vFp5vTII2z0cjZA+8m4dvVU0Yrson/I9nquSvY2oLz6JMzs+cBYbPnptZ71RRIK91jAbPkxUnT3I9Vw92wu0vfgSuLy0h4C99DeEPsLVgr6uNTK+juABPje5qbz9tWk9Q8UVPtjFET66OCa+ioypvSviar2EBDi+R4dcPsW+tjwO0I2+TIUPPtl7aT7SHBO+AHAePOlr2L2RDVQ+NU2WPqetcrwqP9g9t8jwvTb/7j0Cq8S9XLL/vTd/KD216uK98HZfvRH/jL2/bZ49/rVXPrdLBj5NeQA+jsUMPuScbD3F60s9cJZUPrb0q73S7CQ+iBhVPgnCdjz8DcK9w4vmPeClK76eYiu+po+dPbi0LD4NjkE+5nwhvgFq6j1kJoc8wBqKvpedy70LDx++BDNEPtb8Pb5WdII+5kUsPnroQj2xTQI9Fi3MvY8nUr635tm9R5SgO7/sKj7jWGU8UV2KPY4/1L2EQe49WI04vkswTj1m3qA8xMlKvkpiML48Nqs6NAA/vuid9L1k2Mc9Sq4FPjAHMD2MwjE+wvAEvqRelT5wZkK9SU0lvoKcNz61K5c9X92CPteeJb7kEAs+DT7uvXOhhb1DYJC8Eo87vvMyTb0UBQk9k1eGvT3JJz612vm9ajNHvsOggr3cn/i9OGd/PrcKYj4tTaC8Oq/ZPWG+l72AErO8dHXYu+uCBL6vSTe+4OkAvSl8Gz5hndu9iHhnvIsVQ71Oq4W7edc+Pqzb7z37Koi9V19HPlO1gz4Cj4A7/vgmPFOZJD4vKb49cVHiPaHWSr771Zc9RAMhvA3PYb2DeoQ+6PD6vWjICb7AMUM87CZSvjzgST34+6q9tTTUvZ/fZbsvbw0+MhFKPpBArTvFTgK+CeotPZlziD078NM9"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d/Conv2D/ReadVariableOp", "op": "Identity", "input": ["sequential/conv2d/Conv2D/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d/Conv2D", "op": "Conv2D", "input": ["Func/PartitionedCall/output/_2", "sequential/conv2d/Conv2D/ReadVariableOp"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}}}, {"name": "sequential/conv2d/BiasAdd/ReadVariableOp/resource", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}, "tensorContent": "ScvsvMONLb2s3pG9EC3fPF0fbb3h4gK9tg1XvPLNpb3yi6U8kE9WvGmzq72LjW+91qKDvckGILwBlXy8jVvLu62njj0b82C8+IYUPXxCMb1aneu9dvXmvBWY97yW8Ym99liuPeNbUzsvskc74kbfvLK6QzudnqG8KAS7vDjM3zw5JQG97V0qPRkvHb2pQ4e9krUpPbKUu7ych/280EfrPNGR6r3LXbC9neTKvIPuaL2WWPi7eNibPM/X37zuA4O9ncXBPC1m+zvyeKC7TkvDvOryeL2AEUU8Vis4Pd0cTz0v6t+82/xvvYKEPT36y7M8asdIvWENSb10wAs7ahfhPC1VI72rgcS8tJ9NPNLxkL0CeI68IDWtPF4XqzleENm92U5cvcLfjr3GGba8RpqDvJLDEr1xjZY9va9gvQrAFT1a3tK8kGKwPVynsb0JOQW+XSr+u6M9lr3Zuym9Y5ZGPLfyhrpYFQy99CoZvNY1j72DiJ+8uPWuvMGzrLzeMRS9gY8OvHL2Aj2pZ/S8B1kbO4QOuTuOgh29HFQNPJDWQzvReQY72w83vLAHPjucscO7LU/oO06tzLwWiy493PpBvUb0t72MiTI9ArLCPBbgAzovWEu9tq0GvKnbBz3GJdi87RG4vDI7hb0bx/A8vYuIPXBOCz1Bf8K9odIhPRWpmr0="}}}}, {"name": "sequential/conv2d/BiasAdd/ReadVariableOp", "op": "Identity", "input": ["sequential/conv2d/BiasAdd/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d/BiasAdd", "op": "BiasAdd", "input": ["sequential/conv2d/Conv2D", "sequential/conv2d/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d/Relu", "op": "Relu", "input": ["sequential/conv2d/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/conv2d_1/Conv2D/ReadVariableOp/resource", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "16"}]}, "tensorContent": 